#X-Generator: crowdin.com
callActivityTargetNameMigrationDescription=\u30b3\u30fc\u30eb\u30a2\u30af\u30c6\u30a3\u30d3\u30c6\u30a3\u306e\u30bf\u30fc\u30b2\u30c3\u30c8\u540d\u306f\u3001\u5f0f\u306b\u79fb\u884c\u3055\u308c\u307e\u3057\u305f
callActivityTargetVersionMigrationDescription=\u30b3\u30fc\u30eb\u30a2\u30af\u30c6\u30a3\u30d3\u30c6\u30a3\u306e\u30bf\u30fc\u30b2\u30c3\u30c8 \u30d0\u30fc\u30b8\u30e7\u30f3\u306f\u3001\u5f0f\u306b\u79fb\u884c\u3055\u308c\u307e\u3057\u305f
callActivityTargetNameProperty=\u30b5\u30d6\u30d7\u30ed\u30bb\u30b9\u306e\u540d\u524d
callActivityTargetVersionProperty=\u30b5\u30d6\u30d7\u30ed\u30bb\u30b9\u306e\u30d0\u30fc\u30b8\u30e7\u30f3
dataProperty=\u30c7\u30fc\u30bf
document=\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8
documentProperty=\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8
documentCreationDescription=\u6dfb\u4ed8\u30d5\u30a1\u30a4\u30eb\u306e\u30c7\u30fc\u30bf\u304b\u3089\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8\u304c\u4f5c\u6210\u3055\u308c\u3066\u3044\u307e\u3059\u3002\u6dfb\u4ed8\u30d5\u30a1\u30a4\u30eb\u306e\u30c7\u30fc\u30bf\u306f\u3082\u3046\u5b58\u5728\u3057\u307e\u305b\u3093\u3002
dataDefaultValueMigrationDescription=\u3053\u306e\u30c7\u30fc\u30bf\u306e\u30c7\u30d5\u30a9\u30eb\u30c8\u5024\u306f\u3001\u5f0f\u306b\u5909\u63db\u3055\u308c\u3066\u3044\u307e\u3059
dataDefaultValueProperty=\u30c7\u30fc\u30bf\u306e\u30c7\u30d5\u30a9\u30eb\u30c8\u5024
dataDefaultValueWithOtherDataDependencyMigrationDescription=\u540c\u3058\u30b3\u30f3\u30c6\u30ca\u306e\u5225\u306e\u30c7\u30fc\u30bf\u306b\u4f9d\u5b58\u3059\u308b\u30c7\u30fc\u30bf\u306e\u30c7\u30d5\u30a9\u30eb\u30c8\u5024\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093
sequenceFlowConditionMigrationDescription=\u3053\u306e\u30b7\u30fc\u30b1\u30f3\u30b9 \u30d5\u30ed\u30fc\u306e\u6761\u4ef6\u306f\u3001\u5f0f\u306b\u5909\u63db\u3055\u308c\u3066\u3044\u307e\u3059
sequenceFlowConditionProperty=\u30b7\u30fc\u30b1\u30f3\u30b9 \u30d5\u30ed\u30fc\u306e\u6761\u4ef6
removeDeadlinesMigrationDescription=\u3053\u306e\u671f\u9650\u306f\u3001\u30e2\u30c7\u30eb\u304b\u3089\u524a\u9664\u3055\u308c\u307e\u3057\u305f\u3002\u3053\u306e\u6982\u5ff5\u306f\u3082\u306f\u3084\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002\u30e2\u30c7\u30eb\u306b\u6709\u52b9\u306a\u610f\u5473\u3092\u6301\u305f\u305b\u308b\u306b\u306f\u3001\u3042\u306a\u305f\u304c\u8a2d\u8a08\u3057\u305f\u30e2\u30c7\u30eb\u3092\u5909\u66f4\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
connectorProperty=\u30b3\u30cd\u30af\u30bf
loopMaximumScriptMigrationDescription=\u6700\u5927\u30eb\u30fc\u30d7\u6570\u306e\u30b9\u30af\u30ea\u30d7\u30c8\u304c\u3001\u5f0f\u306b\u5909\u63db\u3055\u308c\u3066\u3044\u307e\u3059
loopConditionScriptMigrationDescription=\u30eb\u30fc\u30d7\u6761\u4ef6\u306e\u30b9\u30af\u30ea\u30d7\u30c8\u306f\u3001\u5f0f\u306b\u5909\u63db\u3055\u308c\u3066\u3044\u307e\u3059
iterationProperty=\u53cd\u5fa9\u51e6\u7406
dynamicLabelMigrationDescription=\u8868\u793a\u540d\u306e\u30b9\u30af\u30ea\u30d7\u30c8\u306f\u3001\u5f0f\u306b\u5909\u63db\u3055\u308c\u3066\u3044\u307e\u3059
portalProperty=\u30dd\u30fc\u30bf\u30eb
dynamicDescriptionMigrationDescription=\u8aac\u660e\u306e\u8868\u793a\u30b9\u30af\u30ea\u30d7\u30c8\u306f\u3001\u5f0f\u306b\u5909\u63db\u3055\u308c\u3066\u3044\u307e\u3059
stepSummaryMigrationDescription=\u5b8c\u4e86\u5f8c\u3092\u8aac\u660e\u3059\u308b\u30b9\u30af\u30ea\u30d7\u30c8\u306f\u3001\u5f0f\u306b\u5909\u63db\u3055\u308c\u3066\u3044\u307e\u3059
removeConnectorMigrationDescription=\u30b3\u30cd\u30af\u30bf\u304c\u524a\u9664\u3055\u308c\u307e\u3057\u305f
removeCustomConnectorMigrationDescription=\u5bfe\u5fdc\u3059\u308b\u30b3\u30cd\u30af\u30bf\u306e\u5b9a\u7fa9\u304c\u898b\u3064\u304b\u3089\u306a\u304b\u3063\u305f\u306e\u3067\u3001\u30b3\u30cd\u30af\u30bf\u306f\u524a\u9664\u3055\u308c\u307e\u3057\u305f\u3002\u30ab\u30b9\u30bf\u30e0 \u30b3\u30cd\u30af\u30bf\u3092\u4f7f\u7528\u3057\u305f\u3044\u5834\u5408\u306f .bar \u30d5\u30a1\u30a4\u30eb\u3067\u30a8\u30af\u30b9\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u308b\u304b\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
removeGroupMigrationDescription=\u3053\u306e\u30a2\u30af\u30bf\u30fc\u30bb\u30ec\u30af\u30bf\u30fc\u306f\u524a\u9664\u3055\u308c\u307e\u3057\u305f
actorProperty=\u30a2\u30af\u30bf\u30fc
actorSelector=\u30a2\u30af\u30bf\u30fc\u30bb\u30ec\u30af\u30bf\u30fc
redirectionUrlMigrationDescription=Url \u306e\u30ea\u30c0\u30a4\u30ec\u30af\u30c8\u306e\u30b9\u30af\u30ea\u30d7\u30c8\u304c\u5f0f\u306b\u5909\u63db\u3055\u308c\u3066\u3044\u307e\u3059
entryPageflowProperty=\u30da\u30fc\u30b8\u30d5\u30ed\u30fc
confirmationProperty=\u78ba\u8a8d
confirmationMessageMigrationDescription=\u78ba\u8a8d\u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u30b9\u30af\u30ea\u30d7\u30c8\u306f\u3001\u5f0f\u306b\u5909\u63db\u3055\u308c\u3066\u3044\u307e\u3059
redirectionActionMigrationDescription=\u30ea\u30c0\u30a4\u30ec\u30af\u30c8\u306e\u30a2\u30af\u30b7\u30e7\u30f3\u306f\u3001\uff11\u3064\u306e\u30c7\u30fc\u30bf\u64cd\u4f5c\u306b\u5909\u63db\u3055\u308c\u3066\u3044\u307e\u3059\u3002
viewPageflowProperty=\u30da\u30fc\u30b8\u30d5\u30ed\u30fc\u306e\u5909\u9077
recapPageflowProperty=\u30da\u30fc\u30b8\u30d5\u30ed\u30fc\u306e\u8981\u7d04
pageFlowTransitionMigrationDescription=\u30da\u30fc\u30b8\u30d5\u30ed\u30fc\u306e\u9077\u79fb\u30b9\u30af\u30ea\u30d7\u30c8\u304c\u3001\u5f0f\u306b\u5909\u63db\u3055\u308c\u3066\u3044\u307e\u3059
messageContentMigrationDescription=\u30e1\u30c3\u30bb\u30fc\u30b8 \u30b3\u30f3\u30c6\u30f3\u30c4\u306f\u5f0f\u306b\u5909\u63db\u3055\u308c\u307e\u3057\u305f\u3002
messagesProperty=\u30e1\u30c3\u30bb\u30fc\u30b8
targetProcessNameMigrationDescription=\u5bfe\u8c61\u306e\u30d7\u30ed\u30bb\u30b9\u540d\u304c\u3001\u5f0f\u306b\u5909\u63db\u3055\u308c\u3066\u3044\u307e\u3059
targetElementNameMigrationDescription=\u30bf\u30fc\u30b2\u30c3\u30c8\u306e\u8981\u7d20\u540d\u304c\u5f0f\u306b\u5909\u63db\u3055\u308c\u3066\u3044\u307e\u3059
correlationMigrationDescription=\u76f8\u4e92\u95a2\u4fc2\u30ad\u30fc\uff08Correlation keys \uff09\u3068\u305d\u306e\u5024\u304c\u5f0f\u306b\u5909\u63db\u3055\u308c\u3066\u3044\u307e\u3059
correlationProperty=\u76f8\u4e92\u95a2\u4fc2\uff08Correlation\uff09\u30ad\u30fc
timerConditionProperty=\u30bf\u30a4\u30de\u30fc\u6761\u4ef6
timerConditionMigrationDescription=\u30bf\u30a4\u30de\u30fc\u6761\u4ef6\u306f\u3001\u5f0f\u306b\u5909\u63db\u3055\u308c\u3066\u3044\u307e\u3059
removeFilterMigrationDescription=\u3053\u306e\u30d5\u30a3\u30eb\u30bf\u30fc\u306f\u524a\u9664\u3055\u308c\u307e\u3057\u305f
formActionsMigrationDescription=\u30d5\u30a9\u30fc\u30e0\u306e\u30a2\u30af\u30b7\u30e7\u30f3\u306f\u3001\u8907\u6570\u306e\u30c7\u30fc\u30bf\u64cd\u4f5c\u306b\u5909\u63db\u3055\u308c\u3066\u3044\u307e\u3059\u3002
actionProperty=\u30a2\u30af\u30b7\u30e7\u30f3
widgetActionsMigrationDescription=\u30a6\u30a3\u30b8\u30a7\u30c3\u30c8\u306e\u51fa\u529b\u64cd\u4f5c\u306f\u3001\u8907\u6570\u306e\u30c7\u30fc\u30bf\u64cd\u4f5c\u306b\u5909\u63db\u3055\u308c\u3066\u3044\u307e\u3059\u3002
widgetModifierMigrationDescription=\u30a6\u30a3\u30b8\u30a7\u30c3\u30c8\u306e\u623b\u308a\u5024\u578b\u306e\u4fee\u98fe\u5b50\u304c\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u307e\u3059
widgetDataInputAtProcessLevelMigrationDescription=\u30a6\u30a3\u30b8\u30a7\u30c3\u30c8\u306e\u5165\u529b\u306f\u3001\u305d\u306e\u30c7\u30d5\u30a9\u30eb\u30c8\u5024\u3092\u521d\u671f\u5316\u3059\u308b\u305f\u3081\u306b\u5909\u6570\u3092\u4f7f\u7528\u3057\u3066\u3044\u307e\u3057\u305f\u3002\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u958b\u59cb\u30d5\u30a9\u30fc\u30e0\u3067\u306f\u3001\u3053\u306e\u5909\u6570\u306f\u30a2\u30af\u30bb\u30b9\u3067\u304d\u307e\u305b\u3093\u3002
widgetDataInputMigrationDescription=\u30a6\u30a3\u30b8\u30a7\u30c3\u30c8\u306e\u5165\u529b\u306f\u3001\u5f0f\u306b\u5909\u63db\u3055\u308c\u3066\u3044\u307e\u3059
generalProperty=\u5168\u822c
userAidsProperty=\u30e6\u30fc\u30b6\u30fc\u88dc\u52a9
tooltipMigrationDescription=\u30c4\u30fc\u30eb\u30d2\u30f3\u30c8\u304c\u5f0f\u306b\u5909\u63db\u3055\u308c\u3066\u3044\u307e\u3059
helpMessageMigrationDescription=\u30d8\u30eb\u30d7 \u30e1\u30c3\u30bb\u30fc\u30b8\u304c\u5f0f\u306b\u5909\u63db\u3055\u308c\u3066\u3044\u307e\u3059
displayAfterEventConditionMigrationDescription=\u300c\u9023\u52d5\u30d5\u30a3\u30fc\u30eb\u30c9\u304c\u5909\u66f4\u3055\u308c\u305f\u3068\u304d\u306b\u8868\u793a\u300d\u306e\u6761\u4ef6\u306f\u3001\u5f0f\u306b\u5909\u63db\u3055\u308c\u3066\u3044\u307e\u3059
contingencyProperty=\u30d5\u30a3\u30fc\u30eb\u30c9\u9023\u52d5
showImmediatelyConditionMigrationDescription=\u300c\u3059\u3050\u306b\u8868\u793a\u300d\u306e\u6761\u4ef6\u306f\u3001\u5f0f\u306b\u5909\u63db\u3055\u308c\u3066\u3044\u307e\u3059
optionsProperty=\u30aa\u30d7\u30b7\u30e7\u30f3
updateSelectedValueMigrationDescription=\u30d5\u30a3\u30fc\u30eb\u30c9\u9023\u52d5\u30b9\u30af\u30ea\u30d7\u30c8\u3067\u66f4\u65b0\u5f8c\u306b\u9078\u629e\u3055\u308c\u305f\u5024\u306f\u3001\u5f0f\u306b\u5909\u63db\u3055\u308c\u3066\u3044\u307e\u3059
updateAvailableValueMigrationDescription=\u30d5\u30a3\u30fc\u30eb\u30c9\u9023\u52d5\u30b9\u30af\u30ea\u30d7\u30c8\u3067\u66f4\u65b0\u5f8c\u306b\u4f7f\u7528\u53ef\u80fd\u306a\u5024\u306f\u3001\u5f0f\u306b\u5909\u63db\u3055\u308c\u3066\u3044\u307e\u3059\u3002
updateValueMigrationDescription=\u30d5\u30a3\u30fc\u30eb\u30c9\u9023\u52d5\u30b9\u30af\u30ea\u30d7\u30c8\u306e\u66f4\u65b0\u5024\u306f\u3001\u5f0f\u306b\u5909\u63db\u3055\u308c\u3066\u3044\u307e\u3059
displayLabelMigrationDescription=\u8868\u793a\u30e9\u30d9\u30eb\u306f\u3001\u5f0f\u306b\u5909\u63db\u3055\u308c\u3066\u3044\u307e\u3059
exampleMigrationDescription=\u30b5\u30f3\u30d7\u30eb\u306e\u30b9\u30af\u30ea\u30d7\u30c8\u306f\u3001\u5f0f\u306b\u5909\u63db\u3055\u308c\u3066\u3044\u307e\u3059
initialValueMigrationDescription=\u521d\u671f\u5024\u306f\u3001\u5f0f\u306b\u5909\u63db\u3055\u308c\u3066\u3044\u307e\u3059
buttonActionsMigrationDescription=\u9001\u4fe1\u30dc\u30bf\u30f3\u306e\u30a2\u30af\u30b7\u30e7\u30f3\u306f\u3001\u8907\u6570\u306e\u30c7\u30fc\u30bf\u64cd\u4f5c\u306b\u5909\u63db\u3055\u308c\u3066\u3044\u307e\u3059\u3002
validatorParameterMigrationDescription=\u30d0\u30ea\u30c7\u30fc\u30bf\u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u306f\u3001\u5f0f\u306b\u5909\u63db\u3055\u308c\u3066\u3044\u307e\u3059
validatorsProperty=\u30d0\u30ea\u30c7\u30fc\u30bf
appearanceProperty=\u5916\u89b3
maxNumberMigrationDescription=\u91cd\u8907\u306e\u6700\u5927\u6570\u306f\u3001\u5f0f\u306b\u5909\u63db\u3055\u308c\u3066\u3044\u307e\u3059
minNumberMigrationDescription=\u91cd\u8907\u306e\u6700\u5c0f\u6570\u306f\u3001\u5f0f\u306b\u5909\u63db\u3055\u308c\u3066\u3044\u307e\u3059
displayLabelForAddMigrationDescription=\u300c\u8ffd\u52a0'\u300d\u306e\u8868\u793a\u30e9\u30d9\u30eb\u306f\u3001 \u5f0f\u306b\u5909\u63db\u3055\u308c\u3066\u3044\u307e\u3059
displayLabelForRemoveMigrationDescription=\u300c\u524a\u9664'\u300d\u306e\u8868\u793a\u30e9\u30d9\u30eb\u306f\u3001 \u5f0f\u306b\u5909\u63db\u3055\u308c\u3066\u3044\u307e\u3059
tooltipForAddMigrationDescription=\u300c\u8ffd\u52a0\u300d\u306e\u30c4\u30fc\u30eb\u30d2\u30f3\u30c8 \u30e9\u30d9\u30eb\u306f\u3001\u5f0f\u306b\u5909\u63db\u3055\u308c\u3066\u3044\u307e\u3059
tooltipForRemoveMigrationDescription=\u300c\u524a\u9664\u300d\u306e\u30c4\u30fc\u30eb\u30d2\u30f3\u30c8 \u30e9\u30d9\u30eb\u306f\u3001\u5f0f\u306b\u5909\u63db\u3055\u308c\u3066\u3044\u307e\u3059
imgPathMigrationDescription=\u753b\u50cf\u306e\u30d1\u30b9\u306f\u3001\u5f0f\u306b\u5909\u63db\u3055\u308c\u3066\u3044\u307e\u3059
validatorDisplayNameMigrationDescription=\u30d0\u30ea\u30c7\u30fc\u30bf\u306e\u30a8\u30e9\u30fc\u30e1\u30c3\u30bb\u30fc\u30b8\u306f\u3001\u5f0f\u306b\u5909\u63db\u3055\u308c\u3066\u3044\u307e\u3059
changeGatewayTypeToInclusiveGatewayMigrationDescription=\u30d1\u30e9\u30ec\u30eb\u30fb\u30b2\u30fc\u30c8\u30a6\u30a7\u30a4\u306f\u3001 BPMN 2.0 \u306e\u30eb\u30fc\u30eb\u306b\u9069\u5408\u3059\u308b\u5305\u542b\u30b2\u30fc\u30c8\u30a6\u30a7\u30a4\u306b\u7f6e\u304d\u63db\u3048\u3089\u308c\u307e\u3057\u305f
changeInclusiveGatewayMigrationDescription=\u5909\u66f4\u3055\u308c\u305f\u5305\u542b\u30b2\u30fc\u30c8\u30a6\u30a7\u30a4
changeParallelGatewayWithIncomingConditionsMigrationDescription=\u6761\u4ef6\u4ed8\u304d\u306e\u6d41\u5165\u30b7\u30fc\u30b1\u30f3\u30b9\u30d5\u30ed\u30fc\u3092\u6301\u3064\u30d1\u30e9\u30ec\u30eb\u30fb\u30b2\u30fc\u30c8\u30a6\u30a7\u30a4\u306f\u3001\u5909\u66f4\u3055\u308c\u307e\u3057\u305f
changeParallelGatewayWithOutgoingConditionsMigrationDescription=\u6761\u4ef6\u4ed8\u304d\u306e\u6d41\u5165\u30b7\u30fc\u30b1\u30f3\u30b9\u30d5\u30ed\u30fc\u3092\u6301\u3064\u30d1\u30e9\u30ec\u30eb\u30fb\u30b2\u30fc\u30c8\u30a6\u30a7\u30a4\u306f\u3001\u5909\u66f4\u3055\u308c\u307e\u3057\u305f
mandatoryLabelMigrationDescription=\u5fc5\u9808\u30e9\u30d9\u30eb\u306f\u3001\u5f0f\u306b\u5909\u63db\u3055\u308c\u3066\u3044\u307e\u3059
mandatorySymbolMigrationDescription=\u5fc5\u9808\u3092\u8868\u3059\u8a18\u53f7\u306f\u3001\u5f0f\u306b\u5909\u63db\u3055\u308c\u3066\u3044\u307e\u3059
verticalHeaderMigrationDescription=\u5782\u76f4\u30d8\u30c3\u30c0\u30fc \u306e\u30b9\u30af\u30ea\u30d7\u30c8\u306f\u3001\u5f0f\u306b\u5909\u63db\u3055\u308c\u3066\u3044\u307e\u3059\u3002
horizontalHeaderMigrationDescription=\u6c34\u5e73\u30d8\u30c3\u30c0\u30fc \u306e\u30b9\u30af\u30ea\u30d7\u30c8\u306f\u3001\u5f0f\u306b\u5909\u63db\u3055\u308c\u3066\u3044\u307e\u3059\u3002
cellExpressionMigrationDescription=\u30c6\u30fc\u30d6\u30eb\u306e\u30b3\u30f3\u30c6\u30f3\u30c4\u306f\u3001\u5f0f\u306b\u5909\u63db\u3055\u308c\u3066\u3044\u307e\u3059
kpiBinding=KPI\u306e\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0
bamProperty=\u30e2\u30cb\u30bf\u30ea\u30f3\u30b0
removeKpiMigrationDescription=KPI \u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0\u306e\u79fb\u884c\u306f\u3001\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3001\u524a\u9664\u3055\u308c\u307e\u3057\u305f
maxRowForPaginationMigrationDescription=\u6539\u30da\u30fc\u30b8\u8abf\u6574\u306e\u305f\u3081\u306e\u6700\u5927\u884c\u6570\u306f\u3001\u5f0f\u306b\u5909\u63db\u3055\u308c\u3066\u3044\u307e\u3059
columnForInitialIndexMigrationDescription=\u6700\u521d\u306e\u30a4\u30f3\u30c7\u30c3\u30af\u30b9\u5217\u306f\u3001\u5f0f\u306b\u5909\u63db\u3055\u308c\u3066\u3044\u307e\u3059\u3002
selectedValuesMigrationDescription=\u9078\u629e\u3057\u305f\u5024\u306f\u3001\u5f0f\u306b\u5909\u63db\u3055\u308c\u3066\u3044\u307e\u3059
minNumberOfColumnMigrationDescription=\u5217\u306e\u6700\u5c0f\u6570\u306f\u3001\u5f0f\u306b\u5909\u63db\u3055\u308c\u3066\u3044\u307e\u3059
maxNumberOfColumnMigrationDescription=\u5217\u306e\u6700\u5927\u6570\u306f\u3001\u5f0f\u306b\u5909\u63db\u3055\u308c\u3066\u3044\u307e\u3059
maxNumberOfRowMigrationDescription=\u884c\u306e\u6700\u5927\u6570\u306f\u3001\u5f0f\u306b\u5909\u63db\u3055\u308c\u3066\u3044\u307e\u3059
minNumberOfRowMigrationDescription=\u884c\u306e\u6700\u5c0f\u6570\u306f\u3001\u5f0f\u306b\u5909\u63db\u3055\u308c\u3066\u3044\u307e\u3059
simDataExpressionMigrationDescription=\u30b7\u30df\u30e5\u30ec\u30fc\u30b7\u30e7\u30f3\u306e\u30c7\u30fc\u30bf\u5f0f\u306f\u3001\u5f0f\u306b\u5909\u63db\u3055\u308c\u3066\u3044\u307e\u3059
simDataChangeValueMigrationDescription=\u30b7\u30df\u30e5\u30ec\u30fc\u30b7\u30e7\u30f3\u306e\u30c7\u30fc\u30bf\u66f4\u65b0\u5f0f\u306f\u3001\u5f0f\u306b\u5909\u63db\u3055\u308c\u3066\u3044\u307e\u3059
migrationReportOf={0} \u306e\u30a4\u30f3\u30dd\u30fc\u30c8\u30fb\u30ec\u30dd\u30fc\u30c8
removeMultiInstantiationMigrationDescription=\u30de\u30eb\u30c1 \u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u3092\u524a\u9664\u3057\u307e\u3059
deadlinesToNonInterruptingEventMigrationDescription=\u3053\u306e\u671f\u9650\u306f\u3001\u5225\u306e\u8981\u7d20\u578b\u306b\u7f6e\u304d\u63db\u308f\u308a\u307e\u3057\u305f\u3002\u671f\u9650\u306e\u8a2d\u5b9a\u306f\u3001\u975e\u4e2d\u65ad\u306e\u30bf\u30a4\u30de\u30fc\u5883\u754c\u30a4\u30d9\u30f3\u30c8\u3092\u5883\u754c\u306b\u4ed8\u3051\u308b\u65b9\u5f0f\u306b\u5909\u308f\u308a\u307e\u3057\u305f\u3002\u5143\u306e\u671f\u9650\u306b\u30ea\u30f3\u30af\u3055\u308c\u3066\u3044\u305f\u30b3\u30cd\u30af\u30bf\u306f\u524a\u9664\u3055\u308c\u307e\u3057\u305f\u3002
removeMessageEventFromSendTaskDescription={0} \u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30a4\u30d9\u30f3\u30c8\u306f\u3001BPMN \u306b\u6e96\u62e0\u3059\u308b\u305f\u3081\u306b\u3001\u3053\u306e\u9001\u4fe1\u30bf\u30b9\u30af\u304b\u3089\u524a\u9664\u3055\u308c\u307e\u3057\u305f\u3002\u30e1\u30c3\u30bb\u30fc\u30b8 \u30a4\u30d9\u30f3\u30c8\u306f\u30011 \u3064\u3060\u3051\u304c\u9001\u4fe1\u30bf\u30b9\u30af\u3067\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u3059\u3002
attachementDataRemovedFromMessage=\u6dfb\u4ed8\u30d5\u30a1\u30a4\u30eb\u306e\u30c7\u30fc\u30bf {0} \u306f\u3001\u3053\u306e\u30e1\u30c3\u30bb\u30fc\u30b8 \u30b3\u30f3\u30c6\u30f3\u30c4\u304b\u3089\u524a\u9664\u3055\u308c\u307e\u3057\u305f\u3002
invalidArchiveStructure=BAR \u30d5\u30a1\u30a4\u30eb {0} \u306f\u3001\u6b63\u3057\u3044\u69cb\u9020\u3092\u6301\u3063\u3066\u3044\u307e\u305b\u3093\u3002.Proc \u30d5\u30a1\u30a4\u30eb\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002\n5.9 \u4ee5\u964d \u3067\u306e\u307f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u308b 6.x \u306e.bar \u3092\u30a4\u30f3\u30dd\u30fc\u30c8\u3057\u3088\u3046\u3068\u3057\u3066\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
startTimerCycleMigration=\u671f\u9593\u3092\u6307\u5b9a\u3059\u308b\u30bf\u30a4\u30de\u30fc \u6761\u4ef6\u5f62\u5f0f\u306f\u3001\u7e70\u308a\u8fd4\u3057\u9593\u9694\uff08timeCyde\uff09\u3092\u6307\u5b9a\u3059\u308b cron \u5f0f\u306b\u79fb\u884c\u3055\u308c\u307e\u3057\u305f\u3002\u65e5\u4ed8\u3092\u4f7f\u3063\u305f\u671f\u9593\u6307\u5b9a\u306e\u6761\u4ef6\u306f\u30016.x\u4ee5\u964d\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
timerCondition=\u30bf\u30a4\u30de\u30fc\u6761\u4ef6
connectorMigrationDescription=\u30b3\u30cd\u30af\u30bf\u304c\u79fb\u884c\u3055\u308c\u307e\u3057\u305f\u3002\u5165\u529b\u30d1\u30e9\u30e1\u30fc\u30bf\u3068\u51fa\u529b\u30d1\u30e9\u30e1\u30fc\u30bf\u306e\u6574\u5408\u6027\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044
development=\u958b\u767a
customConnectorMigrationDescription=\u3053\u306e\u30ab\u30b9\u30bf\u30e0 \u30b3\u30cd\u30af\u30bf\u306f\u3001\u30b3\u30cd\u30af\u30bf\u306e\u5b9a\u7fa9\u304a\u3088\u3073\u30b3\u30cd\u30af\u30bf\u306e\u5b9f\u88c5\u306b\u79fb\u884c\u3055\u308c\u307e\u3057\u305f\u3002\u30b3\u30cd\u30af\u30bf\u306e\u5b9f\u88c5\u304c\u671f\u5f85\u3069\u304a\u308a\u306b\u52d5\u4f5c\u3059\u308b\u304b\u518d\u78ba\u8a8d\u304c\u5fc5\u8981\u3067\u3059\u3002
customConnector=\u30ab\u30b9\u30bf\u30e0 \u30b3\u30cd\u30af\u30bf
connectorMigrationSetVarConnectorOnEnterOrOnStartDescription=\u5909\u6570\u8a2d\u5b9a\u306e\u30b3\u30cd\u30af\u30bf\u3001"{0}" \u306f\u30b9\u30c6\u30c3\u30d7\u306e\u30c7\u30fc\u30bf\u64cd\u4f5c\u306b\u5909\u63db\u3055\u308c\u3066\u3044\u307e\u3059\u3002\n\u3053\u306e\u30b3\u30cd\u30af\u30bf\u306f\u30b9\u30c6\u30c3\u30d7\u306e\u5165\u53e3\u307e\u305f\u306f\u958b\u59cb\u6642\u306b\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u307e\u3059\u304c\u3001\u305d\u306e\u30c7\u30fc\u30bf\u64cd\u4f5c\u306f\u30b9\u30c6\u30c3\u30d7\u306e\u7d42\u4e86\u6642\u306b\u5b9f\u884c\u3055\u308c\u308b\u3053\u3068\u306b\u7559\u610f\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u30d2\u30e5\u30fc\u30de\u30f3 \u30bf\u30b9\u30af\u3067\u306f\u3001\u305d\u308c\u3089\u306f\u30d5\u30a9\u30fc\u30e0\u306e\u9001\u4fe1\uff08submit\uff09\u5f8c\u306b\u5b9f\u884c\u3055\u308c\u308b\u3053\u3068\u306b\u6ce8\u610f\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u671f\u5f85\u901a\u308a\u306e\u52d5\u4f5c\u306b\u305d\u3050\u308f\u306a\u3044\u5834\u5408\u306f\u3001\u3053\u308c\u3089\u306e\u30c7\u30fc\u30bf\u64cd\u4f5c\u3092\u524d\u30b9\u30c6\u30c3\u30d7\u306b\u79fb\u52d5\u3057\u3066\u304f\u3060\u3055\u3044\u3002
connectorMigrationSetVarConnectorOnFinishDescription=\u5909\u6570\u8a2d\u5b9a\u306e\u30b3\u30cd\u30af\u30bf\u3001"{0}" \u306f\u3001\u30b9\u30c6\u30c3\u30d7\u306e\u30c7\u30fc\u30bf\u64cd\u4f5c\u306b\u5909\u63db\u3055\u308c\u3066\u3044\u307e\u3059\u3002
connectorMigrationFinishTaskDescription=V6\u3067\u306f\u3001\u30a2\u30af\u30c6\u30a3\u30d3\u30c6\u30a3\u306e\u30e9\u30a4\u30d5 \u30b5\u30a4\u30af\u30eb\u304c\u5909\u66f4\u3055\u308c\u3001\u7d42\u4e86\u30bf\u30b9\u30af\u306e\u30a2\u30af\u30b7\u30e7\u30f3\u306f\u5229\u7528\u3067\u304d\u306a\u304f\u306a\u308a\u307e\u3059
connectorMigrationStartInstanceDescription=\u30d7\u30ed\u30bb\u30b9 \u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u3092\u958b\u59cb\u3059\u308b\u305f\u3081\u306b\u306f\u3001\u30e1\u30c3\u30bb\u30fc\u30b8\u307e\u305f\u306f\u30b7\u30b0\u30ca\u30eb\u3092\u4f7f\u7528\u3057\u3066\u304f\u3060\u3055\u3044
connectorMigrationUseScriptAndApiDescription=Groovy \u30b9\u30af\u30ea\u30d7\u30c8\u3092\u4f7f\u7528\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002API \u3092\u76f4\u63a5\u4f7f\u7528\u3059\u308b\u304b\u3001\u307e\u305f\u306fBonita \u30ab\u30c6\u30b4\u30ea\u304b\u3089\u63d0\u4f9b\u3055\u308c\u305f\u30e1\u30bd\u30c3\u30c9\u3092\u518d\u5229\u7528\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002
customConnectorMigrationFailureDescription=\u3053\u306e\u30ab\u30b9\u30bf\u30e0 \u30b3\u30cd\u30af\u30bf\u306f\u79fb\u884c\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002\u4e00\u90e8\u306e\u4f9d\u5b58\u95a2\u4fc2\u304c\u30aa\u30ea\u30b8\u30ca\u30eb\u306ebar\u30d5\u30a1\u30a4\u30eb\: {0} \u306b\u6b20\u843d\u3057\u3066\u3044\u307e\u3059\u3002
unsupportedVersionMessage=\u30d7\u30ed\u30bb\u30b9\u306e\u30bd\u30fc\u30b9\u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u306f {0} \u3067\u3059\u3002{1} \u30d0\u30fc\u30b8\u30e7\u30f3\u306e\u79fb\u884c\u306f\u3001\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u3059\u3002
descripitonProperty=\u8aac\u660e
tooLongDescriptionHasBeenTruncated=\u4f7f\u7528\u53ef\u80fd\u306a\u6587\u5b57\u306e\u65b0\u3057\u3044\u6700\u5927\u5024\u3092\u8d85\u3048\u3066\u3044\u305f\u306e\u3067\u3001\u3053\u306e\u8981\u7d20\u306e\u8aac\u660e\u306f\u5207\u308a\u6368\u3066\u3089\u308c\u307e\u3057\u305f\u3002
warningImageFormat=\u7121\u52b9\u306a\u30a4\u30e1\u30fc\u30b8\u5f62\u5f0f
warningImageFormatMessage=\u6b63\u3057\u3044\u5f62\u5f0f\u3067\u306f\u306a\u3044\u305f\u3081\u306b\u3001{0} \u3092\u30a4\u30f3\u30dd\u30fc\u30c8\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002\u6b21\u306e\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u308b\u5f62\u5f0f\u306e\u3044\u305a\u308c\u304b\u3092\u4f7f\u7528\u3057\u3066\u304f\u3060\u3055\u3044\uff1a *.gif;*.jpg;*.jpeg;*.png;*.bmp
migratingCustomConnector=\u30ab\u30b9\u30bf\u30e0 \u30b3\u30cd\u30af\u30bf {0} \u3092\u79fb\u884c\u3059\u308b...
groovyForNameWarningDescription=Groovy\u306e\u30ea\u30d5\u30ec\u30af\u30b7\u30e7\u30f3\u304c\u30b9\u30af\u30ea\u30d7\u30c8\u3067\u691c\u51fa\u3055\u308c\u307e\u3057\u305f\u3002\u30af\u30e9\u30b9\u30d1\u30b9\u7ba1\u7406\u304c\u5909\u66f4\u3055\u308c\u3066\u3044\u308b\u306e\u3067\u3001\u30b9\u30af\u30ea\u30d7\u30c8\u3092\u5909\u66f4\u3059\u308b\u304b\u3001\u307e\u305f\u306f\u5171\u6709\u306e\u30af\u30e9\u30b9\u30d1\u30b9\u306b\u30e9\u30a4\u30d6\u30e9\u30ea\u3092\u914d\u7f6e\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
groovyForNameWarningPropertyName=\u30b9\u30af\u30ea\u30d7\u30c8\u306e\u30b3\u30f3\u30c6\u30f3\u30c4
widgetDataInputTooManyConnectorMigrationDescription=1 \u3064\u4ee5\u4e0a\u306e\u30b3\u30cd\u30af\u30bf\u304c\u30a6\u30a3\u30b8\u30a7\u30c3\u30c8\u306e\u5165\u529b\u3068\u3057\u3066\u4f7f\u7528\u3055\u308c\u307e\u3057\u305f\u3002\u6700\u521d\u306e 1 \u3064\u306e\u307f\u304c\u30de\u30a4\u30b0\u30ec\u30fc\u30c8\u3055\u308c\u307e\u3057\u305f\u3002
widgetContigencyConnectorMigrationDescription=1 \u3064\u4ee5\u4e0a\u306e\u30b3\u30cd\u30af\u30bf\u304c\u5076\u767a\u7684\u306b\u4f7f\u7528\u3055\u308c\u307e\u3057\u305f\u3002\u6700\u521d\u306e 1 \u3064\u306e\u307f\u304c\u30de\u30a4\u30b0\u30ec\u30fc\u30c8\u3055\u308c\u307e\u3057\u305f\u3002
