newDocument=\u65b0\u898f\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8
editDocument=\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8\u3092\u7de8\u96c6\u3059\u308b
documentWizardPageTitle={0} \u306b\u65b0\u3057\u3044\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8\u3092\u8ffd\u52a0\u3057\u307e\u3059
newDocumentWizardDescription=\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8\u306e\u5b9a\u7fa9\u306b\u5fc5\u8981\u306a\u60c5\u5831\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002\n\u8aac\u660e\u3068\u521d\u671f\u30b3\u30f3\u30c6\u30f3\u30c4\u306f\u7701\u7565\u3067\u304d\u307e\u3059\u3002
error_documentURLEmpty=URL \u306f\u5fc5\u9808\u3067\u3059
error_documentURLTooLong=URL \u304c\u9577\u3059\u304e\u307e\u3059\u3002\u6700\u5927\u6587\u5b57\u6570\u306f {0} \u3067\u3059\u3002
error_documentDefaultIDEmpty=\u30d5\u30a1\u30a4\u30eb\u306f\u5fc5\u9808\u3067\u3059
error_documentInitialContentsEmpty=\u521d\u671f\u30b3\u30f3\u30c6\u30f3\u30c4\u306f\u5fc5\u9808\u3067\u3059
multipleInitialContentsLabel=\u521d\u671f\u30b3\u30f3\u30c6\u30f3\u30c4
name=\u540d\u524d
description=\u8aac\u660e
mimeType=MIME \u306e\u30bf\u30a4\u30d7
hintMimeTypeDocument=\u4f8b\: application/octet-stream, image/ico
External=\u5916\u90e8
Internal=\u5185\u90e8
explanationExternalDocument=\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8\u306f\u3001\u30b5\u30fc\u30c9 \u30d1\u30fc\u30c6\u30a3\u88fd\u306e\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u306b\u3088\u3063\u3066\u51e6\u7406\u3055\u308c\u307e\u3059\u3002\u305d\u308c\u306b\u30a2\u30af\u30bb\u30b9\u3059\u308b URL \u3092\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
explanationInternalDocument=\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8\u306f\u76f4\u63a5 {0} \u306b\u3088\u3063\u3066\u51e6\u7406\u3055\u308c\u307e\u3059\u3002\u305d\u308c\u3092\u521d\u671f\u5316\u3059\u308b\u305f\u3081\u306e\u30d5\u30a1\u30a4\u30eb\u3092\u63d0\u4f9b\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002
hintExternalUrl=hintExternalUrl
Browse=\u53c2\u7167...
selectResourceDescription=\u30ea\u30bd\u30fc\u30b9\u3092\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044
selectResourceDialogTitle=\u30ea\u30bd\u30fc\u30b9\u3092\u9078\u629e
importEtc=\u30a4\u30f3\u30dd\u30fc\u30c8...
remove=\u524a\u9664
initialValueLabel=\u521d\u671f\u30b3\u30f3\u30c6\u30f3\u30c4
initialValueButtonNone=\uff1c\u306a\u3057\uff1e
initialValueButtonContract=\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u304b\u3089
initialValueButtonInternal=\u30ed\u30fc\u30ab\u30eb \u30d5\u30a1\u30a4\u30eb\u304b\u3089
initialValueButtonInternalToolTip=\u521d\u671f\u30b3\u30f3\u30c6\u30f3\u30c4\u306f\u3001\u30d5\u30a1\u30a4\u30eb\u3068\u3057\u3066\u63d0\u4f9b\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002
initialValueButtonExternal=\u5916\u90e8\u30b7\u30b9\u30c6\u30e0\u304b\u3089
initialValueButtonExternalToolTip=\u521d\u671f\u30b3\u30f3\u30c6\u30f3\u30c4\u306f URL \u3068\u3057\u3066\u63d0\u4f9b\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002\nCMS \u306b\u683c\u7d0d\u3055\u308c\u3066\u3044\u308b\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8\u306e\u66f4\u65b0\u306f\u3001\u30b3\u30cd\u30af\u30bf\u3092\u4f7f\u7528\u3057\u3066\u884c\u308f\u308c\u308b\u3053\u3068\u306b\u6ce8\u610f\u3057\u3066\u304f\u3060\u3055\u3044\u3002
explanationMimeTypeDocument=MIME\u30bf\u30a4\u30d7\u306e\u8a73\u7d30\u306b\u3064\u3044\u3066\u306f http\://www.iana.org/assignments/media-types/index.html \u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
documentExternalLabel=URL
documentInternalLabel=\u30d5\u30a1\u30a4\u30eb
error_documentAllreadyexist=\u540c\u3058\u540d\u524d\u306e\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8\u304c\u65e2\u306b\u5b58\u5728\u3057\u307e\u3059
editDocumentTitle=\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8\u3092\u7de8\u96c6
editDocumentDescription=\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8\u3092\u5b9a\u7fa9\u3059\u308b\u60c5\u5831\u3092\u66f4\u65b0\u3057\u307e\u3059\u3002\n[OK] \u3092\u30af\u30ea\u30c3\u30af\u3059\u308b\u3068 \u3001Groovy \u30b9\u30af\u30ea\u30d7\u30c8\u306e\u4e2d\u3067\u305d\u306e\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8\u304c\u4f7f\u7528\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u3001\u300c\u30ea\u30d5\u30a1\u30af\u30bf\u30ea\u30f3\u30b0\u300d\u30a6\u30a3\u30f3\u30c9\u30a6\u304c\u8868\u793a\u3055\u308c\u3001\u5909\u66f4\u3092\u691c\u8a3c\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002
hideMimeType=\u4fdd\u7559\u3059\u308b
manageMimeType=\u30aa\u30d7\u30b7\u30e7\u30f3\: MIME \u306e\u7a2e\u985e\u3092\u6307\u5b9a\u3059\u308b...
documentInitialContentExternalErrorMessage=\u5916\u90e8\u306e\u521d\u671f\u30b3\u30f3\u30c6\u30f3\u30c4\u3092\u7a7a\u306b\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093
documentInitialContentInternalErrorMessage=\u5185\u90e8\u306e\u521d\u671f\u30b3\u30f3\u30c6\u30f3\u30c4\u3092\u7a7a\u306b\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093
initialMultipleContent=\u521d\u671f\u30b3\u30f3\u30c6\u30f3\u30c4\u306e\u30b9\u30af\u30ea\u30d7\u30c8\u3092\u4f5c\u6210\u3059\u308b...
radioButtonMultiple=\u8907\u6570
radioButtonMultipleToolTip=\u3053\u306e\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8\u306f\u3001\u30ea\u30b9\u30c8\u3068\u3057\u3066\u51e6\u7406\u3055\u308c\u307e\u3059
radioButtonSingle=\u5358\u4e00
areYouSureMessage=\u3053\u306e\u6587\u66f8\uff1a{0} \u3092\u524a\u9664\u3057\u3066\u3082\u3088\u308d\u3057\u3044\u3067\u3059\u304b\uff1f
documentPropertySectionDescription=\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8\u3068\u306f\u3001\u30d7\u30ed\u30bb\u30b9\u306b\u95a2\u9023\u3059\u308b\u60c5\u5831\u3092\u542b\u3080\u6dfb\u4ed8\u30d5\u30a1\u30a4\u30eb\u3067\u3059\u3002\u30d7\u30ed\u30bb\u30b9\u306b\u6dfb\u4ed8\u3055\u308c\u3066\u3044\u308b\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8\u3092\u6307\u5b9a\u3057\u307e\u3059
AddSimple=\u8ffd\u52a0...
documentRepository=\u30ea\u30bd\u30fc\u30b9
documentType=\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8
documentReferenceType=\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8\u306e\u53c2\u7167
returnType=\u623b\u308a\u5024\u306e\u578b
fileContractInput=\u5165\u529b\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u3092\u30d5\u30a1\u30a4\u30eb\u4fdd\u5b58
contractInputNotSet=\u521d\u671f\u30b3\u30f3\u30c6\u30f3\u30c4\u306e\u5165\u529b\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u304c\u3042\u308a\u307e\u305b\u3093\u3002
initialValueButtonScript=\u30b9\u30af\u30ea\u30d7\u30c8\u304b\u3089
documentListScriptToolTip=List<DocumentValue> \u307e\u305f\u306f List<FileInputValue> \u3092\u671f\u5f85
additionalResources=\u8ffd\u52a0\u30ea\u30bd\u30fc\u30b9
additionalResourcesDesc=\u30d7\u30ed\u30bb\u30b9\u306e\u8ffd\u52a0\u30ea\u30bd\u30fc\u30b9\u3092\u8a2d\u5b9a\u3057\u307e\u3059
resourceName=\u30ea\u30bd\u30fc\u30b9\u540d
file=\u30d5\u30a1\u30a4\u30eb
unknownResource=\u3053\u306e\u30ea\u30bd\u30fc\u30b9\u306f\u3053\u306e\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306b\u5b58\u5728\u3057\u307e\u305b\u3093\u3002
deleteAdditionalResourceConfirmTitle=\u524a\u9664\u306e\u78ba\u8a8d
deleteAdditionalResourceConfirm=\u8ffd\u52a0\u30ea\u30bd\u30fc\u30b9`%s`\u3092\u524a\u9664\u3057\u307e\u3059\u304b\uff1f 
barPathInvalid=\u3044\u304f\u3064\u304b\u306e\u8ffd\u52a0\u30ea\u30bd\u30fc\u30b9\u306b\u306f\u540d\u524d\u306e\u30a8\u30e9\u30fc\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002
projectPathInvalid=\u3044\u304f\u3064\u304b\u306e\u8ffd\u52a0\u30ea\u30bd\u30fc\u30b9\u306b\u30d5\u30a1\u30a4\u30eb\u30a8\u30e9\u30fc\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002
barPathUnicityError=\u540d\u524d'%s' \u306f\u4ed6\u306e\u8ffd\u52a0\u30ea\u30bd\u30fc\u30b9\u3067\u65e2\u306b\u4f7f\u7528\u3055\u308c\u3066\u3044\u307e\u3059\u3002
edit=\u7de8\u96c6...
newAdditionalResource=\u65b0\u3057\u3044\u8ffd\u52a0\u30ea\u30bd\u30fc\u30b9
editAdditionalResource=\u8ffd\u52a0\u30ea\u30bd\u30fc\u30b9\u3092\u7de8\u96c6
newAdditionalResourceDescription=\u8ffd\u52a0\u30ea\u30bd\u30fc\u30b9\u3092\u4f5c\u6210\u3059\u308b\u305f\u3081\u306b\u5fc5\u8981\u306a\u60c5\u5831\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
additionalresourceNameIsRequired=\u2019\u540d\u524d\u2019\u306f\u5fc5\u9808\u3067\u3059
additionalResourcesLiveUpdateWarning=\u26a0\ufe0f \u8ffd\u52a0\u306e\u30ea\u30bd\u30fc\u30b9\u306b\u5bfe\u3057\u3066\u30e9\u30a4\u30d6\u66f4\u65b0\u3092\u5b9f\u884c\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002\u5168\u3066\u306e\u8ffd\u52a0\u30ea\u30bd\u30fc\u30b9\u306f\u8a2d\u5b9a\u3067\u8a55\u4fa1\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
additionalResourcesHelp=\u8ffd\u52a0\u306e\u30ea\u30bd\u30fc\u30b9\u306f\u30d7\u30ed\u30bb\u30b9\u3067\u5b9a\u7fa9\u3055\u308c\u3001\u8a2d\u5b9a\u3067\u8a55\u4fa1\u3055\u308c\u307e\u3059\u3002\u30d7\u30ed\u30bb\u30b9\u3092\u69cb\u7bc9\u3059\u308b\u305f\u3081\u306b\u306f\u5168\u3066\u306e\u8ffd\u52a0\u30ea\u30bd\u30fc\u30b9\u3092\u8a55\u4fa1\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
fileNotFoundTitle=\u30d5\u30a1\u30a4\u30eb\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093
fileNotFound=\u30d5\u30a1\u30a4\u30eb '%s' \u306f\u30d5\u30a1\u30a4\u30eb\u30b7\u30b9\u30c6\u30e0\u4e0a\u306b\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
manageResourcesDialogTitle=\u30ea\u30bd\u30fc\u30b9\u306e\u7ba1\u7406
manageResourcesDescription=Bonita \u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u304b\u3089\u30ea\u30bd\u30fc\u30b9\u3092\u8ffd\u52a0\u307e\u305f\u306f\u524a\u9664