invalidURLTitle=URL inv\u00e1lida
invalidURLMsg=Ha ocurrido un error al abrir el navegador web.
formRepository=P\u00e1ginas/Formularios/Layouts
fragmentRepository=Fragmentos
widgetRepository=Widgets personalizados
externalURL=URL externa
targetForm=Formulario de destino
url=URL
pageDoesntExist=La p\u00e1gina con id "{0}" no existe.
formDoesntExist=El formulario con id "{0}" no existe.
caseStartFormMappingDescription=Seleccione el tipo de formulario utilizado para crear una instancia del proceso. Edici\u00f3n de suscripci\u00f3n\: con "Live Update", podr\u00e1 actualizar su proceso en caliente para asignar un formulario diferente despu\u00e9s del despliegue.
entryFormMappingDescription=Seleccione el tipo de formulario utilizado para cumplir con el contrato. Edici\u00f3n de suscripci\u00f3n\: con "Live Update", podr\u00e1 actualizar su proceso en caliente para asignar un formulario diferente despu\u00e9s del despliegue.
caseOverviewFormMappingDescription=La p\u00e1gina de resumen aparece en Bonita Portal cuando hace clic en el bot\u00f3n Resumen en la p\u00e1gina Detalles del caso. No hay restricciones sobre la informaci\u00f3n que puede incluir esta p\u00e1gina. Si no se especifica una p\u00e1gina, se proporciona una p\u00e1gina de Resumen de forma predeterminada.
newFormTooltipForPool=Crear o editar un formulario basado en el contrato. Se mapear\u00e1 autom\u00e1ticamente a este proceso.
newFormTooltipForTask=Crear o editar un formulario basado en el contrato. Se mapear\u00e1 autom\u00e1ticamente a esta tarea.
legacyForm=6.x
openUIDesigner=Abrir UI Designer
uiDesignerLabel=UI Designer
creatingNewForm=Creando nuevo formulario...
switchTypeOfFormQuestionTitle=Formulario incompatible
switchTypeOfFormQuestion=El tipo de formulario actual para esta tarea es {0}. Un contrato ha sido definido as\u00ed que se puede utilizar el UI Designer para crear un formulario que contenga autom\u00e1ticamente los widgets relevantes para las entradas de contrato. \u00bfQuieres utilizar el UI Designer para crear un nuevo formulario?
internalFormMappingUndefined=La asignaci\u00f3n de formulario no se ha definido para {0}.
urlNotDefined=Asignaci\u00f3n de formulario por URL externa se ha definido para {0}.
formDoesntExistAnymoreMessage=El formulario {0} ya no existe. Probablemente ha sido borrado del UI Designer.
formDoesntExistAnymoreTitle=La formulario {0} ya no existe.
stepUIDesignerInfo=Si a\u00fan no se ha creado el formulario, se recomienda definir el contrato primero. Esto permitir\u00e1 la generaci\u00f3n de un formulario con los widgets relevantes y datos pertinentes para las entradas de contrato. Si no se especifica un formulario, se proporcionar\u00e1 un formulario predeterminado basado en el contrato para fines de desarrollo. Haga clic en el icono de l\u00e1piz para editar el formulario, o utilizar la lista desplegable para asignar un formulario diferente.
processUIDesignerInfo=Si a\u00fan no se ha creado el formulario, se recomienda definir el contrato primero. Esto permitir\u00e1 la generaci\u00f3n de un formulario con los widgets relevantes y datos pertinentes para las entradas de contrato. Si no se especifica un formulario, se proporcionar\u00e1 un formulario predeterminado basado en el contrato para fines de desarrollo. Haga clic en el icono de l\u00e1piz para editar el formulario, o utilizar la lista desplegable para asignar un formulario diferente.
overviewUIDesignerInfo=Haga clic en el icono de l\u00e1piz para crear o editar la p\u00e1gina de Resumen, o utilizar la lista desplegable para asignar una p\u00e1gina diferente.
overviewURLInfo=Especifique la direcci\u00f3n URL de la p\u00e1gina.\nEl processInstanceID se proporciona en el string de la consulta. Es el valor del par\u00e1metro <id> que se agrega a las URL externas cuando se redirecciona. \nOtros recursos del API REST est\u00e1n disponibles para llenar la p\u00e1gina con los valores, en particular un "contexto" (API/bpm/caso/<processInstanceId>/context y API/bpm/archivedCase/<archivedProcessInstanceId>/context) incluyendo referencias a los datos de negocio y documentos.
stepURLInfo=Especifique la direcci\u00f3n URL del formulario. \nDeber\u00e1 enviar la informaci\u00f3n que cumpla con el contrato llamando a API/bpm/userTask/<taskInstanceId>/execution. \nEl taskInstanceID se proporciona en el string de la consulta. Es el valor del par\u00e1metro <id> que se agrega a las URL externas cuando se redireciona. \nOtros recursos del API REST est\u00e1n disponibles para llenar el formulario con los valores iniciales, en particular un "contexto" (API/bpm/userTask/<taskInstanceId>/context) que incluye un "contrato" (API/bpm/userTask/<taskInstanceId>/contrat) que describe el formato del contrato a rellenar cuando se ejecuta la tarea.
processURLInfo=Especifique la direcci\u00f3n URL del formulario. \nSe debe devolver la informaci\u00f3n que cumpla con el contrato llamando a API/bpm/process/<processDefinitionId>/instantiation. \nEl processDefinitionID se proporciona en el string de la consulta. Es el valor del par\u00e1metro <id> que se agrega a las URL externas cuando se redirecciona. \nOtros recursos del API REST est\u00e1n disponibles para llenar el formulario con los valores iniciales, en particular un "contexto" (API/bpm/proceso/<processDefinitionId>/context) que incluye un "contrato" (API/bpm/proceso/<processDefinitionId>/contrat) que describe el formato del contrato a rellenar para instanciar el proceso.
overviewLegacyInfo=Ir a la pesta\u00f1a de Aplicaciones 6.x para definir la p\u00e1gina de Resumen.
stepLegacyInfo=Ir a la pesta\u00f1a Aplicaciones 6.x para definir el formulario. El contrato debe estar vac\u00edo.
processLegacyInfo=Ir a la pesta\u00f1a Aplicaciones 6.x para definir el formulario de instanciaci\u00f3n. El contrato debe estar vac\u00edo.
openUiDesignerInformationWindowTitle=Informaci\u00f3n del UI Designer
openUiDesignerInformationMessage=Puedes utilizar el UI Designer para crear y modificar formularios. Para crear un nuevo formulario, recomendamos que primero se cree un contrato y luego se use el formulario generado autom\u00e1ticamente como punto de partida, en lugar de crear el formulario desde cero. Tambi\u00e9n se puede utilizar el UI Designer para crear las p\u00e1ginas y el layout de su aplicaci\u00f3n.
openUiDesignerInformationToggleMessage=No volver a mostrar este cuadro de di\u00e1logo.
hideEmptyContractDialogTitle=Contrato vac\u00edo
hideEmptyContractDialogMessage=Este bot\u00f3n genera un formulario con los correspondientes widgets y datos para las entradas del contrato. La correspondencia entre el formulario y esta tarea o este proceso se realiza una vez para todas. No se actualiza cuando se cambia el contrato. Le recomendamos que cree su contrato antes de hacer clic en este bot\u00f3n.\n\u00bfDesea abrir el UI Designer?
hideEmptyContractDialogToggleMessage=No volver a mostrar este cuadro de di\u00e1logo.
waitingForUIDesigner=Esperando al arranque del servidor para abrir el {0}. Esto toma unos pocos segundos.
noForm=Sin formulario
noFormMessageOnTask=Una tarea humana sin forma y sin contrato representa una tarea manual, completada fuera de Bonita.\nNo debe tener ning\u00fan contrato asociado. Completar la tarea solo significar\u00e1 agregar un comentario que diga que la tarea se ha realizado y tal vez informaci\u00f3n \u00fatil para que otros actores la lean.\nSi se ha definido un contrato, los valores esperados del contrato deben enviarse mediante programaci\u00f3n. Sin embargo, la tarea seguir\u00e1 apareciendo en la lista de tareas del Portal.
noFormMessageOnProcess=Este proceso ser\u00e1 instanciado mediante programaci\u00f3n (por una actividad de llamada o una llamada al API desde una aplicaci\u00f3n, por ejemplo), as\u00ed que no es necesario un formulario. Cuando se selecciona "Sin formulario", no se generar\u00e1 ning\u00fan formulario por defecto para el test. Si ha definido un contrato y desea utilizar el formulario predeterminado para el test, elija la opci\u00f3n UI Desginer pero no especifique un formulario.
overviewnoFormMessage=No se mostrar\u00e1 ninguna p\u00e1gina de resumen en el resumen del caso. (En el Portal > Casos > Ver resumen del caso - acci\u00f3n sobre un caso.)
startingUIDesigner=Iniciando el UI Designer...
migratingUID=Migrando los artefactos del UI designer...
creatingNewPage=Crear nueva p\u00e1gina...
createPageFailed=Se ha producido un error al crear una nueva p\u00e1gina de la aplicaci\u00f3n.
creatingNewWidget=Creando un nuevo widget personalizado...
createWidgetFailed=Se ha producido un error al crear el nuevo widget personalizado
creatingNewLayout=Creando nuevo layout...
createLayoutFailed=Se ha producido un error al crear el nuevo layout
buildingWebPage=Construyendo p\u00e1gina web %s...
startingDataRepositoryService=Iniciando Data Repository Service...
indexingUIDPages=Indexing UID pages...