invalidURLTitle=URL inv\u00e1lida
invalidURLMsg=Ocorreu um erro ao abrir um navegador web.
formRepository=P\u00e1ginas/Formul\u00e1rios/Layouts
fragmentRepository=Fragmentos
widgetRepository=Widgets personalizados
externalURL=URL externa
targetForm=Formul\u00e1rio de destino
url=URL
pageDoesntExist=P\u00e1gina com id "{0}" n\u00e3o existe.
formDoesntExist=Formul\u00e1rio com o Id "{0}" n\u00e3o existe.
caseStartFormMappingDescription=Selecione o tipo de formul\u00e1rio utilizado para instanciar o processo. Edi\u00e7\u00e3o de assinatura\: com "Live Update", \u00e9 poss\u00edvel atualizar o formul\u00e1rio utilizado pelo processo ap\u00f3s a sua implanta\u00e7\u00e3o.
entryFormMappingDescription=Selecione o tipo de formul\u00e1rio utilizado para cumprir o contrato. Edi\u00e7\u00e3o de assinatura\: com "Live Update", \u00e9 poss\u00edvel atualizar o formul\u00e1rio utilizado pelo processo ap\u00f3s a sua implanta\u00e7\u00e3o.
caseOverviewFormMappingDescription=A p\u00e1gina geral \u00e9 exibida no Bonita BPM Portal ao clicar no bot\u00e3o Geral na p\u00e1gina de detalhes do caso. N\u00e3o existem restri\u00e7\u00f5es quanto \u00e0s informa\u00e7\u00f5es que esta p\u00e1gina pode  incluir. Caso nenhuma p\u00e1gina espec\u00edfica seja definida, uma p\u00e1gina de s\u00edntese padr\u00e3o \u00e9 fornecida.
newFormTooltipForPool=Crie ou edite um formul\u00e1rio com base no contrato. Ele ser\u00e1 automaticamente mapeado para esse pool.
newFormTooltipForTask=Criar ou editar um formul\u00e1rio com base no contrato. Ele ser\u00e1 automaticamente associado a esta tarefa.
legacyForm=6.x
openUIDesigner=Abrir o UI Designer
uiDesignerLabel=Designer de interface do usu\u00e1rio
creatingNewForm=Criando novo formul\u00e1rio...
switchTypeOfFormQuestionTitle=Tipo de formul\u00e1rio incompat\u00edvel
switchTypeOfFormQuestion=O tipo de formul\u00e1rio atual para esta tarefa \u00e9 {0}. Um contrato foi definido para que voc\u00ea possa usar o Designer de UI para criar um formul\u00e1rio que contenha automaticamente os widgets relevantes para as entradas do contrato. Deseja usar o Designer de interface do usu\u00e1rio para criar um novo formul\u00e1rio?
internalFormMappingUndefined=O mapeamento de formul\u00e1rio interno \u00e9 indefinido para {0}.
urlNotDefined=O mapeamento de formul\u00e1rio de URL externo \u00e9 indefinido para {0}.
formDoesntExistAnymoreMessage=O formul\u00e1rio {0} n\u00e3o existe mais. Ele pode ter sido removido do UI Designer.
formDoesntExistAnymoreTitle=O formul\u00e1rio {0} n\u00e3o existe mais.
stepUIDesignerInfo=Se o formul\u00e1rio ainda n\u00e3o tiver sido criado, recomendamos que voc\u00ea defina o contrato primeiro.\nIsso permitir\u00e1 a gera\u00e7\u00e3o de um formul\u00e1rio com os widgets e liga\u00e7\u00f5es de dados relevantes para as entradas do contrato.\nSe voc\u00ea n\u00e3o especificar um formul\u00e1rio, um formul\u00e1rio padr\u00e3o baseado no contrato ser\u00e1 fornecido para fins de desenvolvimento.\nClique no \u00edcone de l\u00e1pis para editar o formul\u00e1rio ou use a lista suspensa para mapear um formul\u00e1rio diferente.
processUIDesignerInfo=Se o formul\u00e1rio ainda n\u00e3o tiver sido criado, recomendamos que voc\u00ea defina o contrato primeiro.\nIsso permitir\u00e1 a gera\u00e7\u00e3o de um formul\u00e1rio com os widgets e liga\u00e7\u00f5es de dados relevantes para as entradas do contrato.\nSe voc\u00ea n\u00e3o especificar um formul\u00e1rio, um formul\u00e1rio padr\u00e3o baseado no contrato ser\u00e1 fornecido para fins de desenvolvimento.\nClique no \u00edcone de l\u00e1pis para editar o formul\u00e1rio ou use a lista suspensa para mapear um formul\u00e1rio diferente.
overviewUIDesignerInfo=Clique no \u00edcone de l\u00e1pis para criar ou editar a p\u00e1gina de s\u00edntese, ou use a lista de op\u00e7\u00f5es para escolher uma p\u00e1gina diferente.
overviewURLInfo=Especifique a URL da p\u00e1gina.\nO processInstanceID \u00e9 fornecido na string de consulta. \u00c9 o valor do par\u00e2metro <id> que \u00e9 adicionado \u00e0 URL externa quando redirecionado.\nOutros recursos da API REST est\u00e3o dispon\u00edveis para preencher na p\u00e1gina com valores, nomeadamente um "contexto" (API/bpm/case/<processInstanceId>/context\ne API/bpm/archivedCase/<archivedProcessInstanceId>/context) incluindo dados de neg\u00f3cios e refer\u00eancias de documentos.
stepURLInfo=Especifique o URL do formul\u00e1rio.\nIsso deve retornar informa\u00e7\u00f5es que atendam ao contrato chamando API/bpm/userTask/<taskInstanceId>/execution.\nO taskInstanceID \u00e9 fornecido na cadeia de consulta. \u00c9 o valor do par\u00e2metro <id> que \u00e9 adicionado \u00e0 URL externa ao redirecionar.\nOutros recursos da REST API est\u00e3o dispon\u00edveis para preencher o formul\u00e1rio com valores iniciais, principalmente um "contexto" (API/bpm/userTask/<taskInstanceId>/context) que inclui dados de neg\u00f3cios e refer\u00eancias de documentos, e um "contrato" (API/bpm/userTask/<taskInstanceId>/contract) que descreve o formato do contrato a ser cumprido ao executar a tarefa.
processURLInfo=Especifique o URL do formul\u00e1rio.\nIsso deve retornar informa\u00e7\u00f5es que atendem ao contrato chamando API/bpm/process/<processDefinitionId>/instantiation.\nO processDefinitionID \u00e9 fornecido na cadeia de consulta. \u00c9 o valor do par\u00e2metro <id> que \u00e9 adicionado ao URL externo ao redirecionar.\nOutros recursos da API REST est\u00e3o dispon\u00edveis para preencher o formul\u00e1rio com valores iniciais, notavelmente um "contexto" (API / bpm / process / <processDefinitionId> / context)\nque inclui dados de neg\u00f3cios e refer\u00eancias de documentos, e um "contrato" (API / bpm / process / <processDefinitionId> / contract) que descreve o formato\ndo contrato a cumprir ao instanciar o processo.
overviewLegacyInfo=V\u00e1 para a aba aplica\u00e7\u00e3o 6. x para definir a p\u00e1gina de s\u00edntese.
stepLegacyInfo=V\u00e1 para a aba aplica\u00e7\u00e3o 6. x para definir o formul\u00e1rio da tarefa. O contrato deve ser vazio.
processLegacyInfo=V\u00e1 para a aba aplica\u00e7\u00e3o 6. x para definir o formul\u00e1rio de instancia\u00e7\u00e3o. O contrato deve ser vazio.
openUiDesignerInformationWindowTitle=UI Designer\: informa\u00e7\u00f5es
openUiDesignerInformationMessage=Voc\u00ea pode usar o Designer de interface do usu\u00e1rio para criar e modificar formul\u00e1rios. Para criar uma nova forma, recomendamos que voc\u00ea primeiro cria um contrato e em seguida, use o formul\u00e1rio gerado automaticamente como seu ponto de partida, em vez de criar o formul\u00e1rio do zero.\nvoc\u00ea tamb\u00e9m pode usar o Designer de interface do usu\u00e1rio para criar p\u00e1ginas de aplicativos e layouts de aplicativo personalizado.
openUiDesignerInformationToggleMessage=N\u00e3o mostrar este di\u00e1logo novamente.
hideEmptyContractDialogTitle=Contrato vazio
hideEmptyContractDialogMessage=Este bot\u00e3o gera um formul\u00e1rio com as liga\u00e7\u00f5es de widgets e dados relevantes para as entradas de contrato. O mapeamento entre a forma e esta tarefa/processo \u00e9 feito uma vez por todas. N\u00e3o \u00e9 atualizado quando voc\u00ea atualizar o contrato. Recomendamos que voc\u00ea crie seu contrato antes de clicar neste bot\u00e3o.\nquer ainda abrir o Designer de interface do usu\u00e1rio?
hideEmptyContractDialogToggleMessage=N\u00e3o mostrar este di\u00e1logo novamente.
waitingForUIDesigner=Esperando o Servidor iniciar para abrir {0}. Isto leva alguns segundos.
noForm=Nenhum formul\u00e1rio
noFormMessageOnTask=Uma tarefa humana com nenhum formul\u00e1rio e nenhum contrato representa uma tarefa manual, completada fora Bonita BPM. O usu\u00e1rio indicar\u00e1 no aplicativo ou no Portal que a tarefa manual est\u00e1 completa.\numa tarefa humana com um contrato, mas nenhuma forma espera que as informa\u00e7\u00f5es necess\u00e1rias para cumprir o contrato a ser fornecido por meio de programa\u00e7\u00e3o.
noFormMessageOnProcess=Este processo ser\u00e1 instanciado programaticamente (por uma atividade de telefonema ou por uma chamada de API de um aplicativo, por exemplo), ent\u00e3o nenhuma forma \u00e9 necess\u00e1ria.\nquando "Sem forma" \u00e9 seleccionada, nenhum formul\u00e1rio de instancia\u00e7\u00e3o de padr\u00e3o \u00e9 gerado para o teste.\nse voc\u00ea tiver definido um contrato e deseja usar o formul\u00e1rio padr\u00e3o para o teste, escolha a op\u00e7\u00e3o de Designer de interface do usu\u00e1rio mas n\u00e3o especificar um formul\u00e1rio.
overviewnoFormMessage=Nenhuma p\u00e1gina de vis\u00e3o geral ser\u00e1 exibida no caso geral. (No portal > casos > ver vis\u00e3o geral caso ac\u00e7\u00e3o num caso.)
startingUIDesigner=Iniciando Designer de UI...
migratingUID=Migrando artefatos do UI Designer...
creatingNewPage=Criar nova p\u00e1gina...
createPageFailed=Ocorreu um erro ao criar uma nova p\u00e1gina do aplicativo.
creatingNewWidget=Criando novo widget personalizado...
createWidgetFailed=Ocorreu um erro ao criar um novo widget personalizado
creatingNewLayout=Criando novo layout...
createLayoutFailed=Ocorreu um erro ao criar um novo layout
buildingWebPage=Building web page %s...
startingDataRepositoryService=Starting Data Repository Service...