processesWithErrorAfterImport=\u3044\u304f\u3064\u304b\u30a4\u30f3\u30dd\u30fc\u30c8\u3055\u308c\u305f\u30d7\u30ed\u30bb\u30b9\u306b\u306f\u3001\u691c\u8a3c\u30a8\u30e9\u30fc\u304c\u542b\u307e\u308c\u307e\u3059\u3002
openDiagramWithErrors=\u554f\u984c\u306e\u8a73\u7d30\u3092\u4f34\u3046\u30c0\u30a4\u30a2\u30b0\u30e9\u30e0\u3092\u958b\u304f\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002
skippedValidationMessage=\u30a4\u30f3\u30dd\u30fc\u30c8\u304c\u6b63\u5e38\u306b\u5b8c\u4e86\u3057\u307e\u3057\u305f\u3002\n\u305f\u3060\u3057\u3001\u30c0\u30a4\u30a2\u30b0\u30e9\u30e0\u306e\u691c\u8a3c\u304c\u30b9\u30ad\u30c3\u30d7\u3055\u308c\u305f\u305f\u3081\u3001\u3053\u306e\u30c0\u30a4\u30a2\u30b0\u30e9\u30e0\u306b\u306f\u3001\u3044\u304f\u3064\u304b\u306e\u30a8\u30e9\u30fc\u304c\u542b\u307e\u308c\u3066\u3044\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u30a8\u30e9\u30fc\u3092\u30c1\u30a7\u30c3\u30af\u3059\u308b\u305f\u3081\u306b\u306f\u3001\u30c0\u30a4\u30a2\u30b0\u30e9\u30e0\u3092\u691c\u8a3c\u3057\u3066\u304f\u3060\u3055\u3044\u3002
importButtonLabel=\u30a4\u30f3\u30dd\u30fc\u30c8
errorWhileImporting_message=\u30a4\u30f3\u30dd\u30fc\u30c8\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
errorWhileImporting_title=\u30a4\u30f3\u30dd\u30fc\u30c8\u4e2d\u306e\u30a8\u30e9\u30fc
parsingArchive=BOS \u306e\u30a2\u30fc\u30ab\u30a4\u30d6\u3092\u89e3\u6790\u4e2d...
importFileTitle=\u30d5\u30a1\u30a4\u30eb\u306e\u30a4\u30f3\u30dd\u30fc\u30c8
importFileDescription=\u5225\u306e {0} \u304b\u3089 .bos \u30d5\u30a1\u30a4\u30eb (6.x \u4ee5\u4e0a) \u3092\u30a4\u30f3\u30dd\u30fc\u30c8
selectLocation=Select location
browseButton_label=\u53c2\u7167...
invalidFilePath=\u7121\u52b9\u306a\u30d5\u30a1\u30a4\u30eb
importProcessTitle=\u30d7\u30ed\u30bb\u30b9\u3092\u30a4\u30f3\u30dd\u30fc\u30c8\u3057\u307e\u3059\u3002
importDetails=\u8a73\u7d30\u3092\u30a4\u30f3\u30dd\u30fc\u30c8
overwriteAll=\u3059\u3079\u3066\u3092\u4e0a\u66f8\u304d
keepAll = \u3059\u3079\u3066\u3092\u4fdd\u6301
archiveColumn=\u30a2\u30fc\u30ab\u30a4\u30d6
actionColumn=\u30a2\u30af\u30b7\u30e7\u30f3
conflictMessage=Conflicts have been detected between the archive and the target project. Manage conflicts by choosing the right actions. 
noConflictMessage=\u4e0d\u4e00\u81f4\u306a\u70b9\u306f\u3042\u308a\u307e\u305b\u3093\u3002\u5b89\u5168\u306b\u30a4\u30f3\u30dd\u30fc\u30c8\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002
analyseBosArchive=BOS \u306e\u30a2\u30fc\u30ab\u30a4\u30d6\u3092\u5206\u6790\u4e2d...
importBosArchive=BOS \u306e\u30a2\u30fc\u30ab\u30a4\u30d6\u3092\u30a4\u30f3\u30dd\u30fc\u30c8\u4e2d...
importBosArchiveTitle=BOS \u306e\u30a2\u30fc\u30ab\u30a4\u30d6\u3092\u30a4\u30f3\u30dd\u30fc\u30c8
retrivingDataToImport=\u30a4\u30f3\u30dd\u30fc\u30c8\u306e\u305f\u3081\u306e\u30c7\u30fc\u30bf\u3092\u53d6\u5f97\u4e2d
importing=\u30a4\u30f3\u30dd\u30fc\u30c8\u4e2d\uff1a {0}
bosArchiveName=\u30a4\u30f3\u30dd\u30fc\u30c8\u3059\u308b BOS \u306e\u30a2\u30fc\u30ab\u30a4\u30d6\uff1a
skipped=\u65e2\u306b\u5b58\u5728\u3057\u307e\u3059
alreadyPresent=The content of this archive already exists in your project. Importing wouldn't have any effect.
errorOccuredWhileParsingBosArchive=BOS \u30a2\u30fc\u30ab\u30a4\u30d6 \u30b3\u30f3\u30c6\u30f3\u30c4\u306e\u89e3\u6790\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
importWorkspaceTitle=\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u3092\u30a4\u30f3\u30dd\u30fc\u30c8
importWorkspaceDescription=\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9 (6.x \u4ee5\u4e0a) \u3092\u65e2\u5b58\u306e {0} \u306e\u5834\u6240\u304b\u3089\u30a4\u30f3\u30dd\u30fc\u30c8
selectABonitaStudioWorkspace=Bonita Studio \u306e\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u3092\u9078\u629e
cannotImportWorkspaceWithVersion='%s' \u306f\u30a4\u30f3\u30dd\u30fc\u30c8\u3067\u304d\u307e\u305b\u3093\u3002\u4e92\u63db\u6027\u306e\u306a\u3044\u30d0\u30fc\u30b8\u30e7\u30f3\: %s \u3067\u3059\u3002
cannotImportWorkspaceWithEdition='%s' \u306f\u30a4\u30f3\u30dd\u30fc\u30c8\u3067\u304d\u307e\u305b\u3093\u3002\u4e92\u63db\u6027\u306e\u306a\u3044\u30a8\u30c7\u30a3\u30b7\u30e7\u30f3\: %s \u3067\u3059\u3002
validRepository='%s' \u306f\u30a4\u30f3\u30dd\u30fc\u30c8\u306e\u6e96\u5099\u304c\u3067\u304d\u307e\u3057\u305f\u3002
validRepositoryOverwritten='%s' \u306f\u30a4\u30f3\u30dd\u30fc\u30c8\u306e\u6e96\u5099\u304c\u3067\u304d\u307e\u3057\u305f\u3002\u26a0 \u65e2\u5b58\u306e\u30b3\u30f3\u30c6\u30f3\u30c4\u306f\u4e0a\u66f8\u304d\u3055\u308c\u307e\u3059\u3002
noRepositoryFoundAtLocation=No project found at this location.
noValidRepositoryFoundAtLocation=No valid project found at this location.
scanningWorkspace=\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u3092\u30b9\u30ad\u30e3\u30f3\u3057\u3066\u3044\u307e\u3059...
importingWorkspace=\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u3092\u30a4\u30f3\u30dd\u30fc\u30c8\u3057\u3066\u3044\u307e\u3059...
repositoryImported='%s' \u306f\u6b63\u5e38\u306b\u30a4\u30f3\u30dd\u30fc\u30c8\u3055\u308c\u307e\u3057\u305f\u3002
exportingWorkspace=Retrieving data from '%s'... 
workspaceTips=\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u306f 1 \u3064\u307e\u305f\u306f\u8907\u6570\u306e\u30ea\u30dd\u30b8\u30c8\u30ea\u3067\u4f5c\u3089\u308c\u3066\u3044\u307e\u3059\u3002\n\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u306e\u30a4\u30f3\u30dd\u30fc\u30c8\u306f\u3001\u3053\u306e\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u306e\u3059\u3079\u3066\u306e\u30ea\u30dd\u30b8\u30c8\u30ea\u3092\u73fe\u5728\u306e\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u306b\u30a4\u30f3\u30dd\u30fc\u30c8\u3059\u308b\u3053\u3068\u3092\u610f\u5473\u3057\u307e\u3059\u3002
importWorkspaceOverwriteBehavior=We assume your current workspace is empty, this is why we overwrite.To view the differences between the current workspace content and what is imported, import each project one by one using the "File>Import> BOS archive" menu option.
moreInfo=\u8a73\u7d30\u60c5\u5831\u306b\u3064\u3044\u3066
bdmImportedInfo=BDM has been imported.
legacyFormsNotImported=Linked to 6.x forms - not imported
formsRemovedFromStudio=They have been removed from Bonita Studio and will not be imported.
legacyFormsNotImportedFromWorkspace=6.x forms based on Google Web Toolkit (GWT) technology are not supported anymore.\nThey have been removed from Bonita Studio. Such forms and their related content will not be imported.
projectConnectorToVCS='%s' is connected to a VCS. You must clone/checkout this project from Team menu.
occurrences=occurrences
smartImportMessage=Merge
downloadingRemoteBosArchive=Downloading remote BOS archive...
invalidBosArchiveType=Invalid archive extension. Only '.bos' extension is supported.
cannotImportRemoteArchive=Failed to download archive\: %s
conflictingArtifactTooltip=An artifact `%s` already exists in the current project, but with a different content.
identicalArtifactTooltip=An artifact `%s` already exists in the current project, with the exact same content.
importedArtifactTooltip=The artifact `%s` will be imported in the current project.