processesWithErrorAfterImport=\u3044\u304f\u3064\u304b\u30a4\u30f3\u30dd\u30fc\u30c8\u3055\u308c\u305f\u30d7\u30ed\u30bb\u30b9\u306b\u306f\u3001\u691c\u8a3c\u30a8\u30e9\u30fc\u304c\u542b\u307e\u308c\u307e\u3059\u3002
openDiagramWithErrors=\u554f\u984c\u306e\u8a73\u7d30\u3092\u4f34\u3046\u30c0\u30a4\u30a2\u30b0\u30e9\u30e0\u3092\u958b\u304f\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002
skippedValidationMessage=\u30a4\u30f3\u30dd\u30fc\u30c8\u304c\u6b63\u5e38\u306b\u5b8c\u4e86\u3057\u307e\u3057\u305f\u3002\n\u305f\u3060\u3057\u3001\u30c0\u30a4\u30a2\u30b0\u30e9\u30e0\u306e\u691c\u8a3c\u304c\u30b9\u30ad\u30c3\u30d7\u3055\u308c\u305f\u305f\u3081\u3001\u3053\u306e\u30c0\u30a4\u30a2\u30b0\u30e9\u30e0\u306b\u306f\u3001\u3044\u304f\u3064\u304b\u306e\u30a8\u30e9\u30fc\u304c\u542b\u307e\u308c\u3066\u3044\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u30a8\u30e9\u30fc\u3092\u30c1\u30a7\u30c3\u30af\u3059\u308b\u305f\u3081\u306b\u306f\u3001\u30c0\u30a4\u30a2\u30b0\u30e9\u30e0\u3092\u691c\u8a3c\u3057\u3066\u304f\u3060\u3055\u3044\u3002
importButtonLabel=\u30a4\u30f3\u30dd\u30fc\u30c8
errorWhileImporting_message=\u30a4\u30f3\u30dd\u30fc\u30c8\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
errorWhileImporting_title=\u30a4\u30f3\u30dd\u30fc\u30c8\u4e2d\u306e\u30a8\u30e9\u30fc
parsingArchive=BOS \u306e\u30a2\u30fc\u30ab\u30a4\u30d6\u3092\u89e3\u6790\u4e2d...
importFileTitle=\u30d5\u30a1\u30a4\u30eb\u306e\u30a4\u30f3\u30dd\u30fc\u30c8
importFileDescription=\u5225\u306e {0} \u304b\u3089 .bos \u30d5\u30a1\u30a4\u30eb (6.x \u4ee5\u4e0a) \u3092\u30a4\u30f3\u30dd\u30fc\u30c8
selectLocation=\u30ed\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u9078\u629e
browseButton_label=\u53c2\u7167...
invalidFilePath=\u7121\u52b9\u306a\u30d5\u30a1\u30a4\u30eb
importProcessTitle=\u30d7\u30ed\u30bb\u30b9\u3092\u30a4\u30f3\u30dd\u30fc\u30c8\u3057\u307e\u3059\u3002
importDetails=\u8a73\u7d30\u3092\u30a4\u30f3\u30dd\u30fc\u30c8
overwriteAll=\u3059\u3079\u3066\u3092\u4e0a\u66f8\u304d
keepAll = \u3059\u3079\u3066\u3092\u4fdd\u6301
archiveColumn=\u30a2\u30fc\u30ab\u30a4\u30d6
actionColumn=\u30a2\u30af\u30b7\u30e7\u30f3
conflictMessage=\u30a2\u30fc\u30ab\u30a4\u30d6\u3068\u30bf\u30fc\u30b2\u30c3\u30c8 \u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u9593\u3067\u7af6\u5408\u304c\u691c\u51fa\u3055\u308c\u307e\u3057\u305f\u3002\u9069\u5207\u306a\u30a2\u30af\u30b7\u30e7\u30f3\u3092\u9078\u629e\u3057\u3066\u7af6\u5408\u3092\u7ba1\u7406\u3057\u307e\u3059\u3002 \n
noConflictMessage=\u4e0d\u4e00\u81f4\u306a\u70b9\u306f\u3042\u308a\u307e\u305b\u3093\u3002\u5b89\u5168\u306b\u30a4\u30f3\u30dd\u30fc\u30c8\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002
analyseBosArchive=Analyzing BOS archive...
importBosArchive=BOS \u306e\u30a2\u30fc\u30ab\u30a4\u30d6\u3092\u30a4\u30f3\u30dd\u30fc\u30c8\u4e2d...
importBosArchiveTitle=BOS \u306e\u30a2\u30fc\u30ab\u30a4\u30d6\u3092\u30a4\u30f3\u30dd\u30fc\u30c8
retrivingDataToImport=Retrieving data to import
importing=\u30a4\u30f3\u30dd\u30fc\u30c8\u4e2d\uff1a {0}
bosArchiveName=\u30a4\u30f3\u30dd\u30fc\u30c8\u3059\u308b BOS \u306e\u30a2\u30fc\u30ab\u30a4\u30d6\uff1a
skipped=\u65e2\u306b\u5b58\u5728\u3057\u307e\u3059
alreadyPresent=\u3053\u306e\u30a2\u30fc\u30ab\u30a4\u30d6\u306e\u30b3\u30f3\u30c6\u30f3\u30c4\u306f\u65e2\u306b\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306b\u5b58\u5728\u3057\u307e\u3059\u3002\u30a4\u30f3\u30dd\u30fc\u30c8\u3057\u3066\u3082\u52b9\u679c\u306f\u3042\u308a\u307e\u305b\u3093\u3002
errorOccuredWhileParsingBosArchive=BOS \u30a2\u30fc\u30ab\u30a4\u30d6 \u30b3\u30f3\u30c6\u30f3\u30c4\u306e\u89e3\u6790\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
importWorkspaceTitle=\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u3092\u30a4\u30f3\u30dd\u30fc\u30c8
importWorkspaceDescription=\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9 (6.x \u4ee5\u4e0a) \u3092\u65e2\u5b58\u306e {0} \u306e\u5834\u6240\u304b\u3089\u30a4\u30f3\u30dd\u30fc\u30c8
selectABonitaStudioWorkspace=Bonita Studio \u306e\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u3092\u9078\u629e
cannotImportWorkspaceWithVersion='%s' \u306f\u30a4\u30f3\u30dd\u30fc\u30c8\u3067\u304d\u307e\u305b\u3093\u3002\u4e92\u63db\u6027\u306e\u306a\u3044\u30d0\u30fc\u30b8\u30e7\u30f3\: %s \u3067\u3059\u3002
cannotImportWorkspaceWithEdition='%s' \u306f\u30a4\u30f3\u30dd\u30fc\u30c8\u3067\u304d\u307e\u305b\u3093\u3002\u4e92\u63db\u6027\u306e\u306a\u3044\u30a8\u30c7\u30a3\u30b7\u30e7\u30f3\: %s \u3067\u3059\u3002
validRepository='%s' \u306f\u30a4\u30f3\u30dd\u30fc\u30c8\u306e\u6e96\u5099\u304c\u3067\u304d\u307e\u3057\u305f\u3002
validRepositoryOverwritten='%s' \u306f\u30a4\u30f3\u30dd\u30fc\u30c8\u306e\u6e96\u5099\u304c\u3067\u304d\u307e\u3057\u305f\u3002\u26a0 \u65e2\u5b58\u306e\u30b3\u30f3\u30c6\u30f3\u30c4\u306f\u4e0a\u66f8\u304d\u3055\u308c\u307e\u3059\u3002
noRepositoryFoundAtLocation=\u3053\u306e\u30ed\u30b1\u30fc\u30b7\u30e7\u30f3\u306b\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002
noValidRepositoryFoundAtLocation=\u3053\u306e\u30ed\u30b1\u30fc\u30b7\u30e7\u30f3\u306b\u6709\u52b9\u306a\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002
scanningWorkspace=\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u3092\u30b9\u30ad\u30e3\u30f3\u3057\u3066\u3044\u307e\u3059...
importingWorkspace=\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u3092\u30a4\u30f3\u30dd\u30fc\u30c8\u3057\u3066\u3044\u307e\u3059...
repositoryImported='%s' \u306f\u6b63\u5e38\u306b\u30a4\u30f3\u30dd\u30fc\u30c8\u3055\u308c\u307e\u3057\u305f\u3002
exportingWorkspace=%s'\u304b\u3089\u30c7\u30fc\u30bf\u3092\u53d6\u5f97\u3057\u3066\u3044\u307e\u3059... 
workspaceTips=\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u306f 1 \u3064\u307e\u305f\u306f\u8907\u6570\u306e\u30ea\u30dd\u30b8\u30c8\u30ea\u3067\u4f5c\u3089\u308c\u3066\u3044\u307e\u3059\u3002\n\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u306e\u30a4\u30f3\u30dd\u30fc\u30c8\u306f\u3001\u3053\u306e\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u306e\u3059\u3079\u3066\u306e\u30ea\u30dd\u30b8\u30c8\u30ea\u3092\u73fe\u5728\u306e\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u306b\u30a4\u30f3\u30dd\u30fc\u30c8\u3059\u308b\u3053\u3068\u3092\u610f\u5473\u3057\u307e\u3059\u3002
importWorkspaceOverwriteBehavior=\u73fe\u5728\u306e\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u304c\u7a7a\u3067\u3042\u308b\u3068\u4eee\u5b9a\u3057\u3066\u3044\u307e\u3059\u3002\u305d\u308c\u304c\u4e0a\u66f8\u304d\u3092\u3059\u308b\u7406\u7531\u3067\u3059\u3002 o\: \u73fe\u5728\u306e\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u306e\u30b3\u30f3\u30c6\u30f3\u30c4\u3068\u30a4\u30f3\u30dd\u30fc\u30c8\u3055\u308c\u305f\u30b3\u30f3\u30c6\u30f3\u30c4\u306e\u9055\u3044\u3092\u8868\u793a\u3059\u308b\u306b\u306f "File>Import>BOS \u30a2\u30fc\u30ab\u30a4\u30d6"\u30e1\u30cb\u30e5\u30fc\u30aa\u30d7\u30b7\u30e7\u30f3\u3092\u4f7f\u7528\u3057\u3066\u3001\u5404\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u4e00\u3064\u305a\u3064\u30a4\u30f3\u30dd\u30fc\u30c8\u3057\u307e\u3059\u3002
moreInfo=\u8a73\u7d30\u60c5\u5831\u306b\u3064\u3044\u3066
bdmImportedInfo=BDM \u304c\u30a4\u30f3\u30dd\u30fc\u30c8\u3055\u308c\u307e\u3057\u305f\u3002
legacyFormsNotImported=6.x \u30d5\u30a9\u30fc\u30e0\u306b\u30ea\u30f3\u30af\u3055\u308c\u307e\u3057\u305f - \u3057\u304b\u3057\u30a4\u30f3\u30dd\u30fc\u30c8\u306f\u3055\u308c\u3066\u3044\u307e\u305b\u3093
formsRemovedFromStudio=\u3053\u308c\u3089\u306fBonita Studio\u304b\u3089\u524a\u9664\u3055\u308c\u3066\u304a\u308a\u30a4\u30f3\u30dd\u30fc\u30c8\u306f\u3055\u308c\u307e\u305b\u3093\u3002
legacyFormsNotImportedFromWorkspace=Google Web Toolkit (GWT) \u30c6\u30af\u30ce\u30ed\u30b8\u30fc\u306b\u57fa\u3065\u3044\u305f 6.x \u30d5\u30a9\u30fc\u30e0\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u306a\u304f\u306a\u308a\u307e\u3057\u305f\u3002\n\u5f93\u3063\u3066Bonita Studio \u304b\u3089\u524a\u9664\u3055\u308c\u307e\u3057\u305f\u3002\u3053\u306e\u3088\u3046\u306a\u30d5\u30a9\u30fc\u30e0\u3068\u95a2\u9023\u3059\u308b\u30b3\u30f3\u30c6\u30f3\u30c4\u306f\u30a4\u30f3\u30dd\u30fc\u30c8\u3055\u308c\u307e\u305b\u3093\u3002
projectConnectorToVCS='%s' is connected to a VCS. You must clone/checkout this project from Team menu.
occurrences=\u30aa\u30ab\u30ec\u30f3\u30b9
downloadingRemoteBosArchive=\u30ea\u30e2\u30fc\u30c8 BOS \u30a2\u30fc\u30ab\u30a4\u30d6\u3092\u30c0\u30a6\u30f3\u30ed\u30fc\u30c9\u3057\u3066\u3044\u307e\u3059...\n
cannotImportRemoteArchive=\u30a2\u30fc\u30ab\u30a4\u30d6\u306e\u30c0\u30a6\u30f3\u30ed\u30fc\u30c9\u306b\u5931\u6557\u3057\u307e\u3057\u305f\: %s
conflictingArtifactTooltip=An artifact `%s` already exists in the current project, but with a different content.
identicalArtifactTooltip=An artifact `%s` already exists in the current project, with the exact same content.
importedArtifactTooltip=The artifact `%s` will be imported in the current project.
errorReadArchive=An error occurred while reading the bos archive
failSwitchRepository=An error occurred while trying to switch to an other project
importWithSwitchRepositorySuccessful=\u30a4\u30f3\u30dd\u30fc\u30c8\u304c\u6b63\u5e38\u306b\u5b8c\u4e86\u3057\u307e\u3057\u305f\u3002\u73fe\u5728 {0} \u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3067\u4f5c\u696d\u4e2d\u3067\u3059\u3002
importWithSwitchRepositoryError=\u30a4\u30f3\u30dd\u30fc\u30c8\u3055\u308c\u305f\u30b3\u30f3\u30c6\u30f3\u30c4\u3067\u554f\u984c\u304c\u691c\u51fa\u3055\u308c\u307e\u3057\u305f\u3002\u73fe\u5728 {0} \u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3067\u4f5c\u696d\u4e2d\u3067\u3059\u3002
currentRepoinfo=(\u73fe\u5728\u306e\u30d7\u30ed\u30b8\u30a7\u30af\u30c8)
updateProjectDependencies=Updating project extensions...
extensionsPreviewTitle=Extensions preview
extensionsPreviewDescription=Preview of the extensions that will be added to the target project.
groupId=Group id
artifactId=Artifact id
version=Version
resolvedFromRepository=Resolved from %s.
cannotBeResolvedAgainstProvidedRepository=Cannot be resolved against configured remote repositories.
cannotBeResolvedAgainstProvidedRepositoryInstalledLocally=Cannot be resolved against configured remote repositories. Will be installed in local repository.
unresolvedLocalDependenciesMessage=Some extensions cannot be resolved against the configured remote repositories. Those extensions will be stored in the project and installed in a local repository. You might want to fix the extension coordinates or <a>configure an additional remote repository</a> before importing this archive.
unresolvedDependenciesMessage=Some extensions cannot be resolved against the configured remote repositories. You might want to fix the extension coordinates or <a>configure an additional remote repository</a> before importing this archive.
unusedDependenciesWarning=This extension is not used in any imported processes.
errorOccuredWhileLookingUpDependencies=An error occurred while looking up for remote extensions.
remoteRepositories=Remote repositories
configuredRemoteRepositories=The list of configured <a>remote repositories</a>.
description=Description
bosArchiveContentTitle=BOS Archive content
bosArchiveContentDescription=BOS Archive content to be imported, you may view and resolve conflicting files from below tree.
detailsPageButtonLabel=Details
extensionPageLabel=Extensions
validatingDiagram=Validating diagram %s (%s)
validatingDiagramWithProgess=Validating imported diagrams [%s/%s]...
anotherVersionAlreadyExists=Another version of this dependency already exists in the target project.\nSelect the version to use in the project after import.
dependencyUpdatedStatus=%s\:%s dependency version has been updated to %s
dependencyAddedStatus=%s\:%s dependency has been added
conflictingDependenciesMessage=When resolving a dependency version conflict you may have to manually update processes and/or configurations after the import.
