skippedValidationMessage=\u30a4\u30f3\u30dd\u30fc\u30c8\u304c\u6b63\u5e38\u306b\u5b8c\u4e86\u3057\u307e\u3057\u305f\u3002\n\u305f\u3060\u3057\u3001\u30c0\u30a4\u30a2\u30b0\u30e9\u30e0\u306e\u691c\u8a3c\u304c\u30b9\u30ad\u30c3\u30d7\u3055\u308c\u305f\u305f\u3081\u3001\u3053\u306e\u30c0\u30a4\u30a2\u30b0\u30e9\u30e0\u306b\u306f\u3001\u3044\u304f\u3064\u304b\u306e\u30a8\u30e9\u30fc\u304c\u542b\u307e\u308c\u3066\u3044\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u30a8\u30e9\u30fc\u3092\u30c1\u30a7\u30c3\u30af\u3059\u308b\u305f\u3081\u306b\u306f\u3001\u30c0\u30a4\u30a2\u30b0\u30e9\u30e0\u3092\u691c\u8a3c\u3057\u3066\u304f\u3060\u3055\u3044\u3002
importButtonLabel=\u30a4\u30f3\u30dd\u30fc\u30c8
errorWhileImporting_message=\u30a4\u30f3\u30dd\u30fc\u30c8\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
parsingArchive=BOS \u306e\u30a2\u30fc\u30ab\u30a4\u30d6\u3092\u89e3\u6790\u4e2d...
importFileDescription=\u5225\u306e {0} \u304b\u3089 .bos \u30d5\u30a1\u30a4\u30eb (6.x \u4ee5\u4e0a) \u3092\u30a4\u30f3\u30dd\u30fc\u30c8
selectLocation=\u30ed\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u9078\u629e
browseButton_label=\u53c2\u7167...
importProcessTitle=\u30d7\u30ed\u30bb\u30b9\u3092\u30a4\u30f3\u30dd\u30fc\u30c8\u3057\u307e\u3059\u3002
importDetails=\u8a73\u7d30\u3092\u30a4\u30f3\u30dd\u30fc\u30c8
overwriteAll=\u3059\u3079\u3066\u3092\u4e0a\u66f8\u304d
keepAll = \u3059\u3079\u3066\u3092\u4fdd\u6301
archiveColumn=\u30a2\u30fc\u30ab\u30a4\u30d6
actionColumn=\u30a2\u30af\u30b7\u30e7\u30f3
conflictMessage=\u30a2\u30fc\u30ab\u30a4\u30d6\u3068\u30bf\u30fc\u30b2\u30c3\u30c8 \u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u9593\u3067\u7af6\u5408\u304c\u691c\u51fa\u3055\u308c\u307e\u3057\u305f\u3002\u9069\u5207\u306a\u30a2\u30af\u30b7\u30e7\u30f3\u3092\u9078\u629e\u3057\u3066\u7af6\u5408\u3092\u7ba1\u7406\u3057\u307e\u3059\u3002 \n
noConflictMessage=\u4e0d\u4e00\u81f4\u306a\u70b9\u306f\u3042\u308a\u307e\u305b\u3093\u3002\u5b89\u5168\u306b\u30a4\u30f3\u30dd\u30fc\u30c8\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002
analyseBosArchive=BOS \u306e\u30a2\u30fc\u30ab\u30a4\u30d6\u3092\u5206\u6790\u3057\u3066\u3044\u307e\u3059...
importBosArchive=BOS \u306e\u30a2\u30fc\u30ab\u30a4\u30d6\u3092\u30a4\u30f3\u30dd\u30fc\u30c8\u4e2d...
importBosArchiveTitle=BOS \u306e\u30a2\u30fc\u30ab\u30a4\u30d6\u3092\u30a4\u30f3\u30dd\u30fc\u30c8
retrivingDataToImport=\u30a4\u30f3\u30dd\u30fc\u30c8\u3059\u308b\u30c7\u30fc\u30bf\u3092\u53d6\u5f97\u3057\u3066\u3044\u307e\u3059
importing=\u30a4\u30f3\u30dd\u30fc\u30c8\u4e2d\uff1a {0}
bosArchiveName=\u30a4\u30f3\u30dd\u30fc\u30c8\u3059\u308b BOS \u306e\u30a2\u30fc\u30ab\u30a4\u30d6\uff1a
skipped=\u65e2\u306b\u5b58\u5728\u3057\u307e\u3059
alreadyPresent=\u3053\u306e\u30a2\u30fc\u30ab\u30a4\u30d6\u306e\u30b3\u30f3\u30c6\u30f3\u30c4\u306f\u65e2\u306b\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306b\u5b58\u5728\u3057\u307e\u3059\u3002\u30a4\u30f3\u30dd\u30fc\u30c8\u3057\u3066\u3082\u52b9\u679c\u306f\u3042\u308a\u307e\u305b\u3093\u3002
errorOccuredWhileParsingBosArchive=BOS \u30a2\u30fc\u30ab\u30a4\u30d6 \u30b3\u30f3\u30c6\u30f3\u30c4\u306e\u89e3\u6790\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
bdmImportedInfo=BDM \u304c\u30a4\u30f3\u30dd\u30fc\u30c8\u3055\u308c\u307e\u3057\u305f\u3002
occurrences=\u30aa\u30ab\u30ec\u30f3\u30b9
downloadingRemoteBosArchive=\u30ea\u30e2\u30fc\u30c8 BOS \u30a2\u30fc\u30ab\u30a4\u30d6\u3092\u30c0\u30a6\u30f3\u30ed\u30fc\u30c9\u3057\u3066\u3044\u307e\u3059...\n
cannotImportRemoteArchive=\u30a2\u30fc\u30ab\u30a4\u30d6\u306e\u30c0\u30a6\u30f3\u30ed\u30fc\u30c9\u306b\u5931\u6557\u3057\u307e\u3057\u305f\: %s
conflictingArtifactTooltip=An artifact `%s` already exists in the current project, but with a different content.
identicalArtifactTooltip=An artifact `%s` already exists in the current project, with the exact same content.
importedArtifactTooltip=The artifact `%s` will be imported in the current project.
errorReadArchive=An error occurred while reading the bos archive
failSwitchRepository=An error occurred while trying to switch to an other project
importWithSwitchRepositorySuccessful=\u30a4\u30f3\u30dd\u30fc\u30c8\u304c\u6b63\u5e38\u306b\u5b8c\u4e86\u3057\u307e\u3057\u305f\u3002\u73fe\u5728 {0} \u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3067\u4f5c\u696d\u4e2d\u3067\u3059\u3002
importWithSwitchRepositoryError=\u30a4\u30f3\u30dd\u30fc\u30c8\u3055\u308c\u305f\u30b3\u30f3\u30c6\u30f3\u30c4\u3067\u554f\u984c\u304c\u691c\u51fa\u3055\u308c\u307e\u3057\u305f\u3002\u73fe\u5728 {0} \u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3067\u4f5c\u696d\u4e2d\u3067\u3059\u3002
updateProjectDependencies=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u62e1\u5f35\u6a5f\u80fd\u3092\u66f4\u65b0\u3057\u3066\u3044\u307e\u3059...
extensionsPreviewTitle=\u30a8\u30af\u30b9\u30c6\u30f3\u30b7\u30e7\u30f3\u306e\u30d7\u30ec\u30d3\u30e5\u30fc
extensionsPreviewDescription=\u30bf\u30fc\u30b2\u30c3\u30c8 \u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306b\u8ffd\u52a0\u3055\u308c\u308b\u62e1\u5f35\u6a5f\u80fd\u306e\u30d7\u30ec\u30d3\u30e5\u30fc\u3002
groupId=\u30b0\u30eb\u30fc\u30d7 ID
artifactId=\u30a2\u30fc\u30c6\u30a3\u30d5\u30a1\u30af\u30c8ID
version=\u30d0\u30fc\u30b8\u30e7\u30f3
resolvedFromRepository=%s \u304b\u3089\u89e3\u6c7a\u3057\u307e\u3057\u305f\u3002
cannotBeResolvedAgainstProvidedRepository=\u8a2d\u5b9a\u3055\u308c\u305f\u30ea\u30e2\u30fc\u30c8\u30ea\u30dd\u30b8\u30c8\u30ea\u306b\u5bfe\u3057\u3066\u89e3\u6c7a\u3067\u304d\u307e\u305b\u3093\u3002
cannotBeResolvedAgainstProvidedRepositoryInstalledLocally=\u8a2d\u5b9a\u3055\u308c\u305f\u30ea\u30e2\u30fc\u30c8 \u30ea\u30dd\u30b8\u30c8\u30ea\u306b\u5bfe\u3057\u3066\u89e3\u6c7a\u3067\u304d\u307e\u305b\u3093\u3002\u30ed\u30fc\u30ab\u30eb \u30ea\u30dd\u30b8\u30c8\u30ea\u306b\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3055\u308c\u307e\u3059\u3002
unresolvedLocalDependenciesMessage=\u4e00\u90e8\u306e\u62e1\u5f35\u6a5f\u80fd\u306f\u3001\u8a2d\u5b9a\u3055\u308c\u305f\u30ea\u30e2\u30fc\u30c8\u30ea\u30dd\u30b8\u30c8\u30ea\u306b\u5bfe\u3057\u3066\u89e3\u6c7a\u3067\u304d\u307e\u305b\u3093\u3002\u3053\u308c\u3089\u306e\u62e1\u5f35\u6a5f\u80fd\u306f\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306b\u683c\u7d0d\u3055\u308c\u3001\u30ed\u30fc\u30ab\u30eb\u30ea\u30dd\u30b8\u30c8\u30ea\u306b\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3055\u308c\u307e\u3059\u3002 \u3053\u306e\u30a2\u30fc\u30ab\u30a4\u30d6\u3092\u30a4\u30f3\u30dd\u30fc\u30c8\u3059\u308b\u524d\u306b\u3001\u62e1\u5f35\u5ea7\u6a19\u3092\u4fee\u6b63\u3059\u308b\u304b\u3001 <a>\u8ffd\u52a0\u306e\u30ea\u30e2\u30fc\u30c8\u30ea\u30dd\u30b8\u30c8\u30ea\u3092\u8a2d\u5b9a</a> \u3059\u308b\u3053\u3068\u3092\u304a\u52e7\u3081\u3057\u307e\u3059\u3002
unresolvedDependenciesMessage=\u4e00\u90e8\u306e\u62e1\u5f35\u6a5f\u80fd\u306f\u3001\u8a2d\u5b9a\u3055\u308c\u305f\u30ea\u30e2\u30fc\u30c8\u30ea\u30dd\u30b8\u30c8\u30ea\u306b\u5bfe\u3057\u3066\u89e3\u6c7a\u3067\u304d\u307e\u305b\u3093\u3002 \u3053\u306e\u30a2\u30fc\u30ab\u30a4\u30d6\u3092\u30a4\u30f3\u30dd\u30fc\u30c8\u3059\u308b\u524d\u306b\u3001\u62e1\u5f35\u5ea7\u6a19\u3092\u4fee\u6b63\u3059\u308b\u304b\u3001 <a>\u8ffd\u52a0\u306e\u30ea\u30e2\u30fc\u30c8\u30ea\u30dd\u30b8\u30c8\u30ea\u3092\u8a2d\u5b9a</a> \u3059\u308b\u3053\u3068\u3092\u304a\u52e7\u3081\u3057\u307e\u3059\u3002
unusedDependenciesWarning=\u3053\u306e\u62e1\u5f35\u6a5f\u80fd\u306f\u30a4\u30f3\u30dd\u30fc\u30c8\u3055\u308c\u305f\u3069\u306e\u30d7\u30ed\u30bb\u30b9\u3067\u3082\u4f7f\u7528\u3055\u308c\u307e\u305b\u3093\u3002
errorOccuredWhileLookingUpDependencies=\u30ea\u30e2\u30fc\u30c8\u30a8\u30af\u30b9\u30c6\u30f3\u30b7\u30e7\u30f3\u306e\u691c\u7d22\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
remoteRepositories=\u30ea\u30e2\u30fc\u30c8 \u30ea\u30dd\u30b8\u30c8\u30ea
configuredRemoteRepositories=\u8a2d\u5b9a\u6e08\u306e <a>\u30ea\u30e2\u30fc\u30c8\u30ea\u30dd\u30b8\u30c8\u30ea</a>\u306e\u30ea\u30b9\u30c8\u3002
description=\u8aac\u660e
bosArchiveContentTitle=BOS \u30a2\u30fc\u30ab\u30a4\u30d6 \u30b3\u30f3\u30c6\u30f3\u30c4
bosArchiveContentDescription=BOS \u30a2\u30fc\u30ab\u30a4\u30d6\u30b3\u30f3\u30c6\u30f3\u30c4\u3092\u30a4\u30f3\u30dd\u30fc\u30c8\u3059\u308b\u306b\u306f\u3001\u4e0b\u306e\u30c4\u30ea\u30fc\u304b\u3089\u7af6\u5408\u3059\u308b\u30d5\u30a1\u30a4\u30eb\u3092\u8868\u793a\u3057\u3066\u89e3\u6c7a\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002
detailsPageButtonLabel=\u8a73\u7d30
extensionPageLabel=\u30a8\u30af\u30b9\u30c6\u30f3\u30b7\u30e7\u30f3\uff08\u62e1\u5f35\uff09
validatingDiagram=\u30c0\u30a4\u30a2\u30b0\u30e9\u30e0\u306e\u691c\u8a3c %s (%s)
validatingDiagramWithProgess=\u30a4\u30f3\u30dd\u30fc\u30c8\u3057\u305f\u30c0\u30a4\u30a2\u30b0\u30e9\u30e0\u3092\u691c\u8a3c\u4e2d [%s/%s]...
anotherVersionAlreadyExists=\u3053\u306e\u4f9d\u5b58\u95a2\u4fc2\u306e\u5225\u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u306f\u3001\u30bf\u30fc\u30b2\u30c3\u30c8 \u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306b\u65e2\u306b\u5b58\u5728\u3057\u307e\u3059\u3002\n\u30a4\u30f3\u30dd\u30fc\u30c8\u5f8c\u306b\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3067\u4f7f\u7528\u3059\u308b\u30d0\u30fc\u30b8\u30e7\u30f3\u3092\u9078\u629e\u3057\u307e\u3059\u3002
dependencyUpdatedStatus=%s\:%s \u4f9d\u5b58\u95a2\u4fc2\u30d0\u30fc\u30b8\u30e7\u30f3\u304c %s \u306b\u66f4\u65b0\u3055\u308c\u307e\u3057\u305f
dependencyAddedStatus=%s\:%s \u306e\u4f9d\u5b58\u95a2\u4fc2\u304c\u8ffd\u52a0\u3055\u308c\u307e\u3057\u305f
conflictingDependenciesMessage=\u4f9d\u5b58\u95a2\u4fc2\u30d0\u30fc\u30b8\u30e7\u30f3\u306e\u7af6\u5408\u3092\u89e3\u6c7a\u3059\u308b\u5834\u5408\u3001\u30a4\u30f3\u30dd\u30fc\u30c8\u5f8c\u306b\u624b\u52d5\u3067\u30d7\u30ed\u30bb\u30b9\u304a\u3088\u3073/\u307e\u305f\u306f\u8a2d\u5b9a\u3092\u66f4\u65b0\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
