processesWithErrorAfterImport=Certains processus import\u00e9s contiennent des erreurs de validation \:
openDiagramWithErrors=Vous pouvez ouvrir les diagrammes en erreur pour consulter les d\u00e9tails.
skippedValidationMessage=Importation termin\u00e9e avec succ\u00e8s. \nCependant la validation du diagramme a \u00e9t\u00e9 ignor\u00e9e. Validez le diagramme (Diagramme > Valider) pour v\u00e9rifier qu'il ne contient pas d'erreurs.
importButtonLabel=Importer
errorWhileImporting_message=Une erreur s'est produite \u00e0 l'import
errorWhileImporting_title=Erreur lors de l'import
parsingArchive=Parsing de l\u2019archive BOS ...
importFileTitle=Importer un fichier
importFileDescription=Importer un fichier .bos (6.x et au-del\u00e0) \u00e0 partir d\u2019un autre {0}
selectLocation=Choisir l'emplacement
browseButton_label=Parcourir...
invalidFilePath=Chemin de fichier invalide
importProcessTitle=Importer un processus
importDetails=D\u00e9tails de l'importation
overwriteAll=Remplacer tous
keepAll = Garder tout
archiveColumn=Archive
actionColumn=Action
conflictMessage=Des conflits ont \u00e9t\u00e9 d\u00e9tect\u00e9s entre l'archive et le projet cible. G\u00e9rez les conflits en choisissant les actions \u00e0 r\u00e9aliser. 
noConflictMessage=Il n\u2019y a pas de conflit. Vous pouvez importer en toute s\u00e9curit\u00e9
analyseBosArchive=Analyse de l\u2019archive BOS...
importBosArchive=Importation de l'archive BOS ...
importBosArchiveTitle=Importer une archive BOS
retrivingDataToImport=R\u00e9cup\u00e9ration des donn\u00e9es \u00e0 importer
importing=Importation de\: {0}
bosArchiveName=Archive bos \u00e0 importer\u00a0\: 
skipped=Existe d\u00e9j\u00e0
alreadyPresent=Le contenu de cette archive existe d\u00e9j\u00e0 dans votre projet. Importer cette archive n'aura aucun effet.
errorOccuredWhileParsingBosArchive=Une erreur s'est produite lors du parsing du contenu de l'archive BOS.
importWorkspaceTitle=Importez l\u2019espace de travail (workspace)
importWorkspaceDescription=Importez un espace de travail (workspace 6.x et au-del\u00e0) \u00e0 partir d\u2019un emplacement de {0} existant
selectABonitaStudioWorkspace=S\u00e9lectionnez un espace de travail (workspace) de Bonita Studio
cannotImportWorkspaceWithVersion='%s' ne peut pas \u00eatre import\u00e9. La version est incompatible\u00a0\: %s.
cannotImportWorkspaceWithEdition='%s' ne peut pas \u00eatre import\u00e9. L'\u00e9dition est incompatible\u00a0\: %s.
validRepository='%s' est pr\u00eat \u00e0 \u00eatre import\u00e9.
validRepositoryOverwritten='%s' est pr\u00eat \u00e0 \u00eatre import\u00e9. \u26a0 Le contenu existant va \u00eatre \u00e9cras\u00e9.
noRepositoryFoundAtLocation=Il n'y a pas de projet \u00e0 cet emplacement.
noValidRepositoryFoundAtLocation=Il n'y a pas de projet valide \u00e0 cet emplacement.
scanningWorkspace=Analyse de l'espace de travail ...
fetchRemoteDialogTitle=Fetch Remote BOS Archive
importingWorkspace=Importation de l\u2019espace de travail ...
repositoryImported='%s' a \u00e9t\u00e9 import\u00e9 avec succ\u00e8s.
exportingWorkspace=R\u00e9cup\u00e9ration des donn\u00e9es \u00e0 partir de '%s' ... 
workspaceTips=Un espace de travail est constitu\u00e9 d\u2019un ou plusieurs repositories.\nImporter un espace de travail signifie importer tous les repositories de cet espace de travail dans votre espace de travail courant.
importWorkspaceOverwriteBehavior=Nous supposons que votre espace de travail actuel est vide, donc l'importation \u00e9crase tout le contenu. Pour afficher les diff\u00e9rences de contenu entre les espaces de travail actuel et import\u00e9, importez les projets un par un avec le menu \u00ab\u00a0Fichier > Importer > Archive BOS\u00a0\u00bb.
moreInfo=Plus d'informations
bdmImportedInfo=Le BDM a \u00e9t\u00e9 import\u00e9.
legacyFormsNotImported=Li\u00e9 \u00e0 des formulaires 6.x - ne sera pas import\u00e9
formsRemovedFromStudio=Ils ont \u00e9t\u00e9 supprim\u00e9s de Bonita Studio et ne seront pas import\u00e9s.
legacyFormsNotImportedFromWorkspace=Les formulaires anciens datant de Bonita 6.x, bas\u00e9s sur la technologie Google Web Toolkit (GWT), ne sont plus support\u00e9s.\nIls ont \u00e9t\u00e9 supprim\u00e9s de Bonita Studio. Ces formulaires et leur contenu ne seront pas import\u00e9s.
containsLegacyFormsWarning=Contient des formulaires datant de Bonita 6.x qui ne sont plus support\u00e9s. Ils seront supprim\u00e9s \u00e0 la migration.
spDiagramCannotBeImportedError=Cr\u00e9\u00e9 avec une \u00e9dition Souscription, incompatible avec cette \u00e9dition Communaut\u00e9.
projectConnectorToVCS='%s' est connect\u00e9 \u00e0 un syst\u00e8me de gestion des versions (VCS). Vous devez le cloner/en faire le checkout \u00e0 partir du menu Equipe.
occurrences=occurrences
smartImportMessage=Fusionner
browseLocalButton_label=Browse local...
fetchRemote=Fetch remote...
enterAValidURL=Enter a valid URL
invalidContentType=Invalid Content-Type\: %s
cannotRetrieveContentType=Cannot retrieve content-type
onlyHTTPUrlSupported=Only HTTP remote URL are supported
invalidURL=Invalid URL\: %s
downloadingRemoteBosArchive=T\u00e9l\u00e9chargement de l'archive BOS distante...
url=URL
invalidBosArchiveType=Extension d'archive invalide. Seule l'extension '.bos' est support\u00e9e.
cannotImportRemoteArchive=Failed to download archive\: %s
conflictingArtifactTooltip=Un artefact `%s` existe d\u00e9j\u00e0 dans le projet actuel, mais avec un contenu diff\u00e9rent.
identicalArtifactTooltip=Un artefact `%s` existe d\u00e9j\u00e0 dans le projet en cours, avec le m\u00eame contenu.
importedArtifactTooltip=L'artefact `%s` sera import\u00e9 dans le projet actuel.