processesWithErrorAfterImport=Algunos procesos importados contienen errores de validaci\u00f3n\:
openDiagramWithErrors=Puede abrir diagramas con problemas para ver los detalles.
skippedValidationMessage=Importaci\u00f3n completada con \u00e9xito. Sin embargo, la validaci\u00f3n del diagrama se ha omitido, as\u00ed que el diagrama puede contener algunos errores. Valida el diagrama para verificar si existe alg\u00fan error.
importButtonLabel=Importar
errorWhileImporting_message=Se ha producido un error durante la importaci\u00f3n
errorWhileImporting_title=Error durante la importaci\u00f3n
parsingArchive=Analizando archivo BOS...
importFileTitle=Importar Archivo
importFileDescription=Importar un archivo .bos (6.x y superior) a partir de un otro {0}
selectLocation=Seleccione ubicaci\u00f3n
browseButton_label=Buscar...
invalidFilePath=Ruta de archivo no v\u00e1lido
importProcessTitle=Importar Proceso desde un archivo .bar o .proc
importDetails=Detalles de la importaci\u00f3n
overwriteAll=Sobrescribir todos
keepAll = Mantener todo
archiveColumn=Archivo
actionColumn=Acci\u00f3n
conflictMessage=Se han detectado conflictos entre el archivo y el proyecto de destino. Gestione los conflictos eligiendo las acciones correctas. 
noConflictMessage=No hay ning\u00fan conflicto. Puede importar con seguridad
analyseBosArchive=Analizando archivo BOS...
importBosArchive=Importando archivo BOS...
importBosArchiveTitle=Importar archivo BOS
retrivingDataToImport=Recuperando los datos para importar
importing=Importando\: {0}
bosArchiveName=Archivo BOS para importar\: 
skipped=Ya existe
alreadyPresent=El contenido de este archivo ya existe en el proyecto. Importar dicho archivo no tendr\u00e1 ning\u00fan efecto.
errorOccuredWhileParsingBosArchive=Se ha producido un error al analizar el contenido del archivo BOS.
importWorkspaceTitle=Importar un espacio de trabajo
importWorkspaceDescription=Importar un espacio de trabajo (6.x y superior) de una localizaci\u00f3n {0} existente
selectABonitaStudioWorkspace=Seleccione un espacio de trabajo de Bonita Studio
cannotImportWorkspaceWithVersion='%s' no puede ser importada. Versi\u00f3n incompatible\: %s.
cannotImportWorkspaceWithEdition='%s' no puede ser importada. Edici\u00f3n incompatible\: %s.
validRepository='%s' est\u00e1 listo para importar.
validRepositoryOverwritten='%s' est\u00e1 listo para importar. \u26a0 Se sobrescribir\u00e1 el contenido existente.
noRepositoryFoundAtLocation=Proyecto no encontrado en esta localizaci\u00f3n.
noValidRepositoryFoundAtLocation=No se ha encontrado ning\u00fan proyecto v\u00e1lido en esta localizaci\u00f3n.
scanningWorkspace=Analizando espacio de trabajo...
importingWorkspace=Importando espacio de trabajo...
repositoryImported='%s' ha sido importado con \u00e9xito.
exportingWorkspace=Recuperando datos de '%s'... 
workspaceTips=Un espacio de trabajo se compone de uno o m\u00e1s repositorios. \nImportar un espacio de trabajo significa importar todos los repositorios de este espacio de trabajo en su espacio de trabajo actual.
importWorkspaceOverwriteBehavior=Asumimos que su espacio de trabajo actual est\u00e1 vac\u00edo, por eso sobrescribimos. Para ver las diferencias entre el contenido del espacio de trabajo actual y lo que se importa, importe cada proyecto uno por uno usando la opci\u00f3n del men\u00fa "Archivo> Importar> archivo BOS".
moreInfo=M\u00e1s informaci\u00f3n
bdmImportedInfo=BDM ha sido importado.
legacyFormsNotImported=Vinculado a formularios 6.x - no importados
formsRemovedFromStudio=Se han eliminado de Bonita Studio y no ser\u00e1n importados.
legacyFormsNotImportedFromWorkspace=Los formularios 6.x basados en la tecnolog\u00eda Google Web Toolkit (GWT) ya no est\u00e1n soportados.\nHan sido retirados de Bonita Studio. Dichos formularios y su contenido relacionado no ser\u00e1n importados.
projectConnectorToVCS='%s' est\u00e1 conectado a un VCS. Debe clonar/checkout del projecto desde el men\u00fa Equipo.
occurrences=sucesos
downloadingRemoteBosArchive=Descargando archivo BOS remoto...
cannotImportRemoteArchive=Error al descargar el archivo\: %s
conflictingArtifactTooltip=Un artefacto `%s` existe en el projecto actual, pero con un contenido diferente.
identicalArtifactTooltip=Un artefacto `%s` existe en el projecto actual, con el mismo contenido.
importedArtifactTooltip=El artefacto `%s` ser\u00e1 importado en el proyecto actual.
errorReadArchive=An error occurred while reading the bos archive
failSwitchRepository=An error occurred while trying to switch to an other project
importWithSwitchRepositorySuccessful=Importaci\u00f3n completada con \u00e9xito. Est\u00e1 ahora trabajando en el proyecto {0}.
importWithSwitchRepositoryError=Se han detectado problemas en el contenido importado. Est\u00e1 ahora trabajando en el proyecto {0}.
currentRepoinfo=(su proyecto actual)