skippedValidationMessage=Importaci\u00f3n completada con \u00e9xito. Sin embargo, la validaci\u00f3n del diagrama se ha omitido, as\u00ed que el diagrama puede contener algunos errores. Valida el diagrama para verificar si existe alg\u00fan error.
importButtonLabel=Importar
errorWhileImporting_message=Se ha producido un error durante la importaci\u00f3n
parsingArchive=Analizando archivo BOS...
importFileDescription=Importar un archivo .bos (6.x y superior) a partir de un otro {0}
selectLocation=Seleccione ubicaci\u00f3n
browseButton_label=Buscar...
importProcessTitle=Importar Proceso desde un archivo .bar o .proc
importDetails=Detalles de la importaci\u00f3n
overwriteAll=Sobrescribir todos
keepAll = Mantener todo
archiveColumn=Archivo
actionColumn=Acci\u00f3n
conflictMessage=Se han detectado conflictos entre el archivo y el proyecto de destino. Gestione los conflictos eligiendo las acciones correctas. 
noConflictMessage=No hay ning\u00fan conflicto. Puede importar con seguridad
analyseBosArchive=Analizando archivo BOS...
importBosArchive=Importando archivo BOS...
importBosArchiveTitle=Importar archivo BOS
retrivingDataToImport=Recuperando datos para importar
importing=Importando\: {0}
bosArchiveName=Archivo BOS para importar\: 
skipped=Ya existe
alreadyPresent=El contenido de este archivo ya existe en el proyecto. Importar dicho archivo no tendr\u00e1 ning\u00fan efecto.
errorOccuredWhileParsingBosArchive=Se ha producido un error al analizar el contenido del archivo BOS.
bdmImportedInfo=BDM ha sido importado.
occurrences=sucesos
downloadingRemoteBosArchive=Descargando archivo BOS remoto...
cannotImportRemoteArchive=Error al descargar el archivo\: %s
conflictingArtifactTooltip=Un artefacto `%s` existe en el projecto actual, pero con un contenido diferente.
identicalArtifactTooltip=Un artefacto `%s` existe en el projecto actual, con el mismo contenido.
importedArtifactTooltip=El artefacto `%s` ser\u00e1 importado en el proyecto actual.
errorReadArchive=An error occurred while reading the bos archive
failSwitchRepository=An error occurred while trying to switch to an other project
importWithSwitchRepositorySuccessful=Importaci\u00f3n completada con \u00e9xito. Est\u00e1 ahora trabajando en el proyecto {0}.
importWithSwitchRepositoryError=Se han detectado problemas en el contenido importado. Est\u00e1 ahora trabajando en el proyecto {0}.
updateProjectDependencies=Actualizando extensiones del proyecto...
extensionsPreviewTitle=Vista previa de extensiones
extensionsPreviewDescription=Vista previa de las extensiones que se a\u00f1adir\u00e1n al proyecto objetivo.
groupId=Id de grupo
artifactId=Id de artefacto
version=Versi\u00f3n
resolvedFromRepository=Resuelto desde %s.
cannotBeResolvedAgainstProvidedRepository=No se puede resolver contra los repositorios remotos configurados.
cannotBeResolvedAgainstProvidedRepositoryInstalledLocally=No se puede resolver contra los repositorios remotos configurados. Se instalar\u00e1 en el repositorio local.
unresolvedLocalDependenciesMessage=Algunas extensiones no se pueden resolver con los repositorios remotos configurados. Estas extensiones se almacenar\u00e1n en el proyecto e instalar\u00e1n en un repositorio local. Puede que quieras arreglar las coordenadas de extensi\u00f3n o <a>configurar un repositorio remoto adicional</a> antes de importar este archivo.
unresolvedDependenciesMessage=Algunas extensiones no se pueden resolver contra los repositorios remotos configurados. Puede que quieras arreglar las coordenadas de extensi\u00f3n o <a>configurar un repositorio remoto adicional</a> antes de importar este archivo.
unusedDependenciesWarning=Esta extensi\u00f3n no se utiliza en ning\u00fan proceso importado.
errorOccuredWhileLookingUpDependencies=Ocurri\u00f3 un error mientras se buscaban extensiones remotas.
remoteRepositories=Repositorios remotos
configuredRemoteRepositories=La lista de <a>repositorios remotos configurados</a>.
description=Descripci\u00f3n
bosArchiveContentTitle=Contenido del fichero BOS
bosArchiveContentDescription=Contenido del archivo BOS a importar, puede ver y resolver archivos en conflicto desde el \u00e1rbol de abajo.
detailsPageButtonLabel=Detalles
extensionPageLabel=Extensiones
validatingDiagram=Validando diagrama %s (%s)
validatingDiagramWithProgess=Validando diagramas importados [%s/%s]...
anotherVersionAlreadyExists=Ya existe otra versi\u00f3n de esta dependencia en el proyecto de destino.\nSeleccione la versi\u00f3n a utilizar en el proyecto despu\u00e9s de la importaci\u00f3n.
dependencyUpdatedStatus=%s\: la versi\u00f3n de dependencia %s ha sido actualizada a %s
dependencyAddedStatus=%s\:%s dependencia ha sido a\u00f1adida
conflictingDependenciesMessage=Al resolver un conflicto de versiones de dependencia, puede que tenga que actualizar manualmente procesos y/o configuraciones despu\u00e9s de la importaci\u00f3n.
