#X-Generator: crowdin.com
callActivityTargetNameMigrationDescription=Zielname der Aufruf-Aktivit\u00e4t wurde in einen Ausdruck migriert.
callActivityTargetVersionMigrationDescription=Zielversion der Aufruf-Aktivit\u00e4t wurde in einen Ausdruck migriert.
callActivityTargetNameProperty=Teilprozessname
callActivityTargetVersionProperty=Teilprozessversion
dataProperty=Daten
document=Dokument
documentProperty=Dokumente
documentCreationDescription=Ein Dokument wurde aus Anlagendaten erstellt. Anlagendaten existieren nicht mehr.
dataDefaultValueMigrationDescription=Der Standardwert dieser Daten wurde in einen Ausdruck konvertiert.
dataDefaultValueProperty=Daten-Standardwert
dataDefaultValueWithOtherDataDependencyMigrationDescription=Ein Daten-Standardwert, der von anderen Daten im selben Beh\u00e4lter abh\u00e4ngig ist, wird nicht unterst\u00fctzt.
sequenceFlowConditionMigrationDescription=Die Bedingung dieses Sequenzflusses wude in einen Ausdruck konvertiert.
sequenceFlowConditionProperty=Sequenzfluss-Bedingung
removeDeadlinesMigrationDescription=Diese Deadline wurde aus dem Modell entfernt. Dieses Konzept wird nicht mehr unterst\u00fctzt. Aktualisieren Sie Ihr Design f\u00fcr den Abruf einer g\u00fcltigen Semantik.
connectorProperty=Konnektoren
loopMaximumScriptMigrationDescription=Das Skript f\u00fcr die maximale Schleife wurde in einen Ausdruck konvertiert.
loopConditionScriptMigrationDescription=Das Schleifenbedingungs-Skript wurde in einen Ausdruck konvertiert.
iterationProperty=Iteration
dynamicLabelMigrationDescription=Anzeigenamen-Skript wurde in einen Ausdruck konvertiert.
portalProperty=Portal
dynamicDescriptionMigrationDescription=Anzeigebeschreibungs-Skript wurde in einen Ausdruck konvertiert.
stepSummaryMigrationDescription=Das Skript "Beschreibung nach Fertigstellung" wurde in einen Ausdruck konvertiert.
removeConnectorMigrationDescription=Konnektor wurde entfernt.
removeCustomConnectorMigrationDescription=Konnektor wurde entfernt, da keine entsprechende Konnektor-Definition gefunden wurde. Wenn Sie einen benutzerdefinierten Konnektor erwartet haben, \u00fcberpr\u00fcfen Sie, ob er in Ihre .bar-Datei exportiert wurde.
removeGroupMigrationDescription=Dieser Akteur-Selektor wurde entfernt.
actorProperty=Akteure
actorSelector=Akteur-Selektor
redirectionUrlMigrationDescription=Das Redirect-URL-Skript wurde in einen Ausdruck konvertiert.
entryPageflowProperty=Pageflow
confirmationProperty=Best\u00e4tigung
confirmationMessageMigrationDescription=Das Nachrichtenbest\u00e4tigungs-Skript wurde in einen Ausdruck konvertiert.
redirectionActionMigrationDescription=Eine Redirect-Aktion wurde in einen Vorgang konvertiert.
viewPageflowProperty=Pageflow-History
recapPageflowProperty=Pageflow-Zusammenfassung
pageFlowTransitionMigrationDescription=Das Pageflow-\u00dcbergangsskript wurde in einen Ausdruck konvertiert.
messageContentMigrationDescription=Nachrichteninhalt wurde in Ausdr\u00fccke umgewandelt.
messagesProperty=Nachrichten
targetProcessNameMigrationDescription=Der Name des Zielprozesses wurde in einen Ausdruck konvertiert.
targetElementNameMigrationDescription=Der Name des Zielelements wurde in einen Ausdruck konvertiert.
correlationMigrationDescription=Korrelationsschl\u00fcssel und Werte wurden in Ausdr\u00fccke konvertiert.
correlationProperty=Korrelation
timerConditionProperty=Timer-Bedingung
timerConditionMigrationDescription=Timer-Bedingung wurde in einen Ausdruck konvertiert.
removeFilterMigrationDescription=Dieser Filter wurde entfernt.
formActionsMigrationDescription=Formularaktionen wurden in Vorg\u00e4nge umgewandelt.
actionProperty=Aktionen
widgetActionsMigrationDescription=Widget-Ausgabe-Vorgang wurde in Vorg\u00e4nge konvertiert.
widgetModifierMigrationDescription=Widget-R\u00fcckgabetyp-Modifier wurde gesetzt.
widgetDataInputAtProcessLevelMigrationDescription=Bei der Widget-Eingabe wurde eine Variable zur Initiierung des Standardwertes verwendet. Die Variablen im Instanziierungsformular sind jedoch nicht mehr zug\u00e4nglich.
widgetDataInputMigrationDescription=Widget-Eingabe wurde in einen Ausdruck konvertiert.
generalProperty=Allgemein
userAidsProperty=Benutzer-Hilfsmittel
tooltipMigrationDescription=Der Tooltip wurde in einen Ausdruck konvertiert.
helpMessageMigrationDescription=Hilfenachricht wurde in einen Ausdruck konvertiert.
displayAfterEventConditionMigrationDescription=Die Bedingung "Anzeige bei \u00c4nderung eines Kontingenzfelds" wurde in einen Ausdruck konvertiert.
contingencyProperty=Kontingenzen
showImmediatelyConditionMigrationDescription=Die Bedingung "Sofort anzeigen" wurde in einen Ausdruck konvertiert.
optionsProperty=Optionen
updateSelectedValueMigrationDescription=Gew\u00e4hlter Wert nach Aktualisierungsskript aus Kontingenzen wurde in einen Ausdruck konvertiert.
updateAvailableValueMigrationDescription=Verf\u00fcgbare Werte nach Aktualisierungsskript aus Kontingenzen wurden in einen Ausdruck konvertiert.
updateValueMigrationDescription=Werteaktualisierungs-Skript aus Kontingenzen wurde in einen Ausdruck konvertiert.
displayLabelMigrationDescription=Anzeigelabel wurde in einen Ausdruck konvertiert.
exampleMigrationDescription=Beispiel-Skript wurde in einen Ausdruck konvertiert.
initialValueMigrationDescription=Anfangswert wurde in einen Ausdruck konvertiert.
buttonActionsMigrationDescription=Aktionen der Sendeschaltfl\u00e4che wurden in Vorg\u00e4nge konvertiert.
validatorParameterMigrationDescription=Validator-Parameter wurde in einen Ausdruck konvertiert.
validatorsProperty=Validatoren
appearanceProperty=Darstellung
maxNumberMigrationDescription=Die max. Anzahl der Vervielf\u00e4ltigungen wurde in einen Ausdruck konvertiert.
minNumberMigrationDescription=Die Mindestanzahl der Vervielf\u00e4ltigungen wurde in einen Ausdruck konvertiert.
displayLabelForAddMigrationDescription=Anzeigelabel f\u00fcr "Hinzuf\u00fcgen" wurde in einen Ausdruck konvertiert.
displayLabelForRemoveMigrationDescription=Anzeigelabel f\u00fcr "Entfernen" wurde in einen Ausdruck konvertiert.
tooltipForAddMigrationDescription=Tooltip-Label f\u00fcr "Hinzuf\u00fcgen" wurde in einen Ausdruck konvertiert.
tooltipForRemoveMigrationDescription=Tooltip-Label f\u00fcr "Entfernen" wurde in einen Ausdruck konvertiert.
imgPathMigrationDescription=Bild-Pfad wurde in einen Ausdruck konvertiert.
validatorDisplayNameMigrationDescription=Validator-Fehlermeldung wurde in einen Ausdruck konvertiert.
changeGatewayTypeToInclusiveGatewayMigrationDescription=Paralleles Gatway wurde zwecks Kompatibilit\u00e4t mit BPMN2-Regeln durch ein inklusives Gateway ersetzt.
changeInclusiveGatewayMigrationDescription=Modifiziertes inklusives Gateway.
changeParallelGatewayWithIncomingConditionsMigrationDescription=Paralleles Gateway mit eingehenden Sequenzfluss-Bedingungen modifiziert.
changeParallelGatewayWithOutgoingConditionsMigrationDescription=Paralleles Gateway mit ausgehenden Sequenzfluss-Bedingungen modifiziert.
mandatoryLabelMigrationDescription=Obligatorisches Label wurde in einen Ausdruck konvertiert.
mandatorySymbolMigrationDescription=Obligatorisches Symbol wurde in einen Ausdruck konvertiert.
verticalHeaderMigrationDescription=Skript f\u00fcr vertikale Kopfzeile wurde in einen Ausdruck konvertiert.
horizontalHeaderMigrationDescription=Skript f\u00fcr horizontale Kopfzeile wurde in einen Ausdruck konvertiert.
cellExpressionMigrationDescription=Tabelleninhalt wurde in einen Ausdruck konvertiert.
kpiBinding=KPI-Bindung
bamProperty=BAM
removeKpiMigrationDescription=Die Migration f\u00fcr KPI-Bindungen wird nicht unterst\u00fctzt und wurde gel\u00f6scht.
maxRowForPaginationMigrationDescription=Max. Zeilenanzahl f\u00fcr Seitenumbruch wurde in einen Ausdruck konvertiert.
columnForInitialIndexMigrationDescription=Spalte f\u00fcr Anfangsindex wurde in einen Ausdruck konvertiert.
selectedValuesMigrationDescription=Die ausgew\u00e4hlten Werte wurden in einen Ausdruck umgewandelt.
minNumberOfColumnMigrationDescription=Mindestanzahl der Spalten wurde in einen Ausdruck konvertiert.
maxNumberOfColumnMigrationDescription=Max. Anzahl der Spalten wurde in einen Ausdruck konvertiert.
maxNumberOfRowMigrationDescription=Max. Anzahl der Zeilen wurde in einen Ausdruck konvertiert.
minNumberOfRowMigrationDescription=Mindestanzahl der Zeilen wurde in einen Ausdruck konvertiert.
simDataExpressionMigrationDescription=Simulationsdaten-Ausdruck wurde in einen Ausdruck konvertiert.
simDataChangeValueMigrationDescription=Der Aktualisierungsausdruck f\u00fcr Simulationsdaten wurde in einen Ausdruck konvertiert.
migrationReportOf=Importbericht f\u00fcr {0}
removeMultiInstantiationMigrationDescription=Mehrfach-Instanziierung entfernen
deadlinesToNonInterruptingEventMigrationDescription=Diese Deadline wurde durch einen anderen Elementtyp ersetzt. Dieses Konzept ist jetzt mit einem unterbrechungsfreien Grenz-Timer-Ereignis verbunden. Der Konnektor, der mit der vorherigen Deadline verbunden war, wurde entfernt.
removeMessageEventFromSendTaskDescription={0} Das Nachrichten-Ereignis wurde von dieser Sendeaufgabe entfernt, um mit BPMN kompatibel zu sein. Nur ein Nachrichten-Ereignis wird durch Sendeaufgabe unterst\u00fctzt.
attachementDataRemovedFromMessage=Anlagedaten {0} wurden von diesem Nachrichteninhalt entfernt.
invalidArchiveStructure=Die BAR-Datei {0} hat nicht die richtige Struktur. Die .proc-Datei fehlt.\nSie haben evtl. versucht, eine 6.x .bar-Datei zu importieren, obwohl nur 5.9+ unterst\u00fctzt wird.
startTimerCycleMigration=Timer-Bedingungs-Format f\u00fcr Zyklus-Bedingung wurde zu einem Cron-Ausdruck migriert. Wenn Sie eine Zyklus-Bedingung mit einem Ausgangsdatum verwendet haben, wird dies nicht mehr unterst\u00fctzt.
timerCondition=Timer-Bedingung
connectorMigrationDescription=Konnektor wurde migriert. Bitte \u00fcberpr\u00fcfen Sie Eingabe-und Ausgabeparameter-Kontinuit\u00e4t. 
development=Entwicklung
customConnectorMigrationDescription=Dieser benutzerdefinierter Konnektor wurde in eine Konnektor-Definition und eine Konnektor-Implementierung migriert. Die Konnektor-Implementierung muss \u00fcberpr\u00fcft werden, damit wie erwartet funktioniert.
customConnector=Konnektor individuell anpassen
connectorMigrationSetVarConnectorOnEnterOrOnStartDescription=Das Variablenset Konnektor "{0}" wurde auf den/ die Schritt(e) Arbeitsgang/ Arbeitsg\u00e4nge umgestellt. Die Ausf\u00fchrungsereignisse wurden in diesem Fall nicht beachtet, daher werden die Arbeitsg\u00e4nge am Ende der Etappe ausgef\u00fchrt. Beachten Sie, dass diese Arbeitsg\u00e4nge f\u00fcr menschliche Aufgaben nach der Formular-Vorlage ausgef\u00fchrt werden. Wenn dies nicht mit dem erwarteten Verhalten \u00fcbereinstimmt, bewegen Sie bitte diese Vorg\u00e4nge zu einem vorherigen Schritt.
connectorMigrationSetVarConnectorOnFinishDescription=Das Variablenset Konnektor "{0}" wurde in den/ die Schritt(e) Arbeitsgang/ Arbeitsg\u00e4ngen umgestellt.
connectorMigrationFinishTaskDescription=Der Aktivit\u00e4tszyklus hat sich in V6 ge\u00e4ndert. Kein Vorgang zum Beenden der Aufgabe mehr verf\u00fcgbar.
connectorMigrationStartInstanceDescription=Bitte verwenden Sie eine Nachricht oder ein Signal zum Starten einer Prozessinstanz.
connectorMigrationUseScriptAndApiDescription=Sie m\u00fcssen ein Groovy-Skript verwenden. Sie k\u00f6nnen die API direkt verwenden oder eine der Methoden aus der Bonita-Kategorie.
customConnectorMigrationFailureDescription=Dieser benutzerdefinierte Konnektor wurde nicht migriert. Einige Abh\u00e4ngigkeiten fehlen in der urspr\u00fcnglichen bar-Datei\: {0}
unsupportedVersionMessage=Die Quell-Version Ihres Prozesses ist {0}. Migration ist f\u00fcr {1} Versionen unterst\u00fctzt.
descripitonProperty=Beschreibung
tooLongDescriptionHasBeenTruncated=Eine Beschreibung dieses Elements wurde abgeschnitten, weil das neue Maximum der zul\u00e4ssigen Zeichen \u00fcberschritten wurde
warningImageFormat=Ung\u00fcltiges Bildformat
warningImageFormatMessage={0} konnte nicht importiert werden, weil es nicht im korrekten Format ist. Bitte benutzen Sie eins der folgenden unterst\u00fctzten Formate\: .gif;.jpg;.jpeg;.png;*.bmp.
migratingCustomConnector=Migrieren des benutzerdefinierten Konnektors {0}...
groovyForNameWarningDescription=Im Skript wurde Groovy Reflexion festgestellt. Die Klassenpfad-Verwaltung hat sich ver\u00e4ndert und Sie sollten in Erw\u00e4gung ziehen, das Skript zu \u00e4ndern oder Bibliotheken in geteilte Klassenpfade zu setzen
groovyForNameWarningPropertyName=Skript-Inhalt
widgetDataInputTooManyConnectorMigrationDescription=More than one connector was used as widget input. Only the first one has been migrated.
widgetContigencyConnectorMigrationDescription=More than one connector was used in contingencies. Only the first one has been migrated.
