#X-Generator: crowdin.com
GeneralSection_Name=Name
GeneralSection_Description=Beschreibung
GeneralSection_Version=Version
defaultFlowLabel=Standardfluss
activityType=Aufgabentyp
activityType_task=Menschlich
activityType_receiveTask=Empfangen
activityType_sendTask=Senden
activityType_serviceTask=Service
activityType_scriptTask=Skript
gatwetypeAnd=Parallel
gatwetypeXor=XOR
gatewayType=Gateway-Typ
newCategory=Neue Kategorie
estimatadExecutionTimeLabel=Gesch\u00e4tzte Ausf\u00fchrungszeit
dynamicLabelLabel=Name
dynamicDescriptionLabel=Dynamische Beschreibung
dataNameLabel=Name *
dataDescriptionLabel=Beschreibung
datatypeLabel=Datentyp
defaultValueLabel=Standardwert
updateConnector=Bearbeiten...
removeConnector=Entfernen
addConnector=Hinzuf\u00fcgen...
removeConnectorConfirmTitle=Diese Konnektoren entfernen?
removeConnectorConfirmMessage=M\u00f6chten Sie die folgenden Konnektoren wirklich l\u00f6schen\:
connectorAdd_tooltip=Zu dieser Aufgabe hinzuf\u00fcgen
createForm_title=Ein neues Formular erstellen
createForm_defaultName=Formular
createForm_noData=Die Aufgaben enth\u00e4lt keine Daten. Klicken Sie auf Fertig stellen, um ein leeres Formular zu erstellen.
error_allreadyExists=Ein Formular mit diesem Namen existiert bereits
error_empty=Das Namensfeld kann nicht leer sein
duplicateForm_desc=Neues Formular erstellen oder eines aus der Liste duplizieren
duplicateForm_title=Neues Formular
duplicateForm_radioCreate=Erstellen Sie ein neues Formular (Klicken Sie auf "n\u00e4chstes >", um die Daten auszuw\u00e4hlen, die bei der Initialisierung des Formulars verwendet werden sollen.)
duplicateForm_radioDuplicate=Formular aus folgender Liste duplizieren
addForm=Hinzuf\u00fcgen...
addFormTitle=Formular hinzuf\u00fcgen...
removeForm=Entfernen
editForm=Bearbeiten
formUp=Nach oben
formDown=Nach unten
selectAll=Selecione todos os campos
formRemoveFormCommand=Ausgew\u00e4hltes Formular l\u00f6schen
FormsSection_wizardVarsGroup_Title=Widgets hinzuf\u00fcgen basierend auf...
FormsSection_wizardVarsGroup_Tooltip=Daten w\u00e4hlen, die im Formular enthalten sein sollen
FormsSection_ConfirmationTemplate=Best\u00e4tigungslayout
subprocess=Teilprozess
connectionConnection=Bedingung
ResourceSection_ProcessTemplate=Prozess-Layout
ResourceSection_PageTemplate=Seiten-Template f\u00fcr Eingabeformular
ResourceSection_ErrorTemplate=Fehler-Layout
ResourceSection_ProcessTemplate_hint=Layout, das f\u00fcr alle Prozessformulare verwendet wird
ResourceSection_PageTemplate_hint=Template, die zur Generierung der Eingabeseiten der Formulare verwendet wird
ResourceSection_ErrorTemplate_hint=Layout, das zur Anzeige von Fehlermeldungen verwendet wird
ResourceSection_ViewTemplate_hint=Template, die zur Generierung der Ansichtsseiten der Formulare verwendet wird
ResourceSection_LoginPage=Anmeldeseite
Browse=Durchsuchen...
Clear=L\u00f6schen
Remove=Entfernen
File=Datei hinzuf\u00fcgen...
Folder=Ordner hinzuf\u00fcgen...
Add=Hinzuf\u00fcgen...
Download=Standard herunterladen...
Error=Fehler
up=Nach oben
down=Nach unten
durationLabel=Dauer
priority=Priorit\u00e4t
assignTo=Zugewiesen zu
sourceParameter=Parent data
messageEventAddWizardPageDesc=Eine Nachricht wird an einen anderen Pool gesendet.\nZu \u00fcbertragende Daten f\u00fcr die Verwendung im Zielpool hier eingeben
messageEventAddWizardPageTitle=Nachricht hinzuf\u00fcgen
messageEventAddWizardPageName=Seitenname f\u00fcr Nachrichtenereignis
removeEventConfirmTitle=Sind Sie sicher?
removeEventConfirmMessage=M\u00f6chten Sie die Ereignisse wirklich l\u00f6schen\:
selectMessageEventLabel=Empfangsnachricht
messageFlowEventChoice=Nachricht w\u00e4hlen
eventType_messageStart=Startnachricht
eventType_messageEnd=Endnachricht
eventType_intermediateCatch=Empfangsnachricht
eventType_intermediateThrow=Sendenachricht
messageEventType=Nachrichtentyp
editCondition=Bearbeiten...
timerCondition=Timer-Bedingung
timerConditionWizardTitle=Timer-Bedingung bearbeiten
eventNameLabel=Zielelement
processNameLabel=Zielpool
isMandatory=ist obligatorisch
addTargetEventDialogTitle=Zielereignis hinzuf\u00fcgen
gotoLabel=Gehe zu
fromLinksLabel=Von den Links
linkType=Linktyp
catchLink=Empfangslink
throwLink=Sendelink
selectSignalEventLabel=Signal
testBeforeLabel=Test vorher
testAfterLabel=Test nachher
loopConditionLabel=Schleife bis
maximumLoopLabel=Maximale Schleife
noneLabel=Keine
optionalLabel=(Optional)
confirmationMessage=Best\u00e4tigungsmeldung
localTemplate=Look-and-Feel anwenden
name=Name
version=Version
selectLocalTemplateWizardPageTitle=Web-Template w\u00e4hlen
selectLocalTemplateWizardPageDescription=Vordefinierte Web-Template aus obiger Liste w\u00e4hlen
webTemplates=Web-Templates
saveAsTemplate_title=Als neues Look-and-Feel speichern
saveAsTemplate_templateLabel=Template-Name
saveAsTemplate_previewPathLabel=Vorschau
ResourceSection_SaveAsTemplate=Als neues Look-and-Feel speichern
Edit=Bearbeiten...
ResourceSection_importTemplate=Importieren...
ResourceSection_export=Exportieren...
ResourceSection_ViewTemplate=Seiten-Template f\u00fcr Anfrageformular
StepSummarySectionContribution_title=Beschreibung nach Fertigstellung
save=Speichern
gatwetypeInclusive=Inklusiv
ResourceSection_AutoLogin=Automatisch anmelden
ResourceSection_AutoLoginTooltip=Aktivieren Sie diese Option, um die Anmeldung f\u00fcr einen bestimmten Benutzer zu \u00fcberspringen (kann f\u00fcr den anonymen Zugriff verwendet werden)
showLabel=Name
errorEvent_error=Zugeh\u00f6riger Fehler
endErrorEvent_error=Fehlercode
mustBeSet=muss gesetzt sein
errorEvent_errorCodeHint=Der Fehlercode, der gesendet wird
errorEvent_errorCodeCatchHint=Der Fehlercode, der empfangen wird, wenn kein Fehlercode gesetzt ist; Fehler aller Art werden empfangen (auch Konnektor-Fehler)
january=Januar
february=Februar
march=M\u00e4rz
april=April
may=Mai
june=Juni
july=Juli
august=August
september=September
october=Oktober
november=November
december=Dezember
monday=Montag
tuesday=Dienstag
wednesday=Mittwoch
thursday=Donnerstag
friday=Freitag
saturday=Samstag
sunday=Sonntag
dynamicLabelHint=Sie k\u00f6nnen das im Portal angezeigte Label f\u00fcr diesen Schritt anpassen
dynamicDescriptionHint=Sie k\u00f6nnen die im Portal angezeigte Beschreibung dieses Schritts anpassen
stepSummaryHint=Sie k\u00f6nnen die Beschreibung nach Abschluss dieses Schritts im Portal anpassen.
executionTimeHint=Die f\u00fcr diesen Schritt festgelegte Zeit. Dient im Portal zur Anzeige der verbleibenden Zeit
targetProcessMessageHint=Vorhandenen Prozess w\u00e4hlen und Namen f\u00fcr den Zielprozess eingeben
targetEventMessageHint=W\u00e4hlen Sie einen vorhandenes "Catch"-Nachrichtenereignis oder erhalten Sie Aufgabe oder geben Sie einen Namen ein
signalEvent_catchHint=Der Code des zu empfangenden Signals
signalEvent_throwHint=Der Code des zu sendenden Signals
confirmDeleteFile_title=Sind Sie sicher?
confirmDeleteFile_msg=Die ausgew\u00e4hlten Dateien werden gel\u00f6scht, m\u00f6chten Sie fortfahren?
pageFlow=Pageflow
skip=\u00dcberspringen
pageFlowTransientDataConnectors=Konnektoren f\u00fcr die Dateninitialisierung
pageFlowTransientData=Transiente Daten
messageEventAddWizardNameAlreadyExists=Dieser Name existiert bereits
formsTabLabel=Formulare
transientDatTabLabel=Transiente Daten
chooseFont=Schrift w\u00e4hlen...
ChooseFigure=Vorhandene Abbildung w\u00e4hlen...
applyStyle=Gleicher Stil wie
activityType_callActivity=Aufruf-Aktivit\u00e4t
skipPageFlowTooltip=Ist diese Aufgabe gew\u00e4hlt, erfolgt eine automatische \u00dcbermittlung, d. h. ein Benutzer muss eine Seite \u00f6ffnen, die automatisch gesendet wird. Nicht identisch mit einer abstrakten Aufgabe.
activityType_abstractTask=Abstrakt
GeneralSection_ActivateValidation=Validierung aktivieren
ResourceSection_OverWrite_title=Sind Sie sicher?
ResourceSection_OverWrite_msg=Die aktuellen, auf den Prozess angewendeten Look-and-Feel-Einstellungen werden verworfen.
saveAsTemplate_error=Das angepasste Look-and-Feel kann nicht gespeichert werden.\nBitte \u00fcberpr\u00fcfen Sie Ihre Protokolle.
saveAsTemplate_import_error=Look-and-Feel kann nicht importiert werden. Bitte \u00fcberpr\u00fcfen Sie Ihre Protokolle.
confirmationPathTooltip=Eine Best\u00e4tigungs-Template kann nur in einem Pageflow verwendet werden.
confirmationMessageTooltip=Eine Best\u00e4tigungsmeldung kann nur in einem Pageflow verwendet werden.
ResourceSection_BasedOnLookAndFeel=Basiert zurzeit auf\:
widgetRemovedWarning_title=Warnung
widgetRemovedWarning_msg=Ihr Widget wird entfernt. \nDenken Sie daran, es auch aus dem angepassten Layout zu entfernen\!
autoMap=Autom. abbilden
autoMap_description=Maps by variable name and data type. Uses the called process contract.
addMessageContent=Inhalt der Nachricht
correlation=Korrelation zwischen den Instanzen
correlationDescription=Korrelation verwenden, wenn Sie bestimmte Instanzen von zwei Prozessen koordinieren wollen.
useCorrelationkeys=Key-basierte Korrelation verwenden
AddCorrelation=Hinzuf\u00fcgen
removeCorrelation=Entfernen
removeMessageContent=Entfernen
addMessageContentButton=Hinzuf\u00fcgen
addMessageContentDescription=Sie k\u00f6nnen den Nachrichteninhalt leer lassen, um Instanzen zwischen zwei Prozessen zu synchonisieren. \nZum Ausw\u00e4hlen bestimmten Instanzen, benutzen Sie "Korrelation zwischen Instanzen-Tab".
autoFillMessageContent=Automatisch ausf\u00fcllen
useExpression=Ausdruck verwenden
useDecisionTable=Entscheidungstabelle verwenden
editDecisionTable=Entscheidungstabelle bearbeiten...
and=AND
takeTransition=\u00dcbergang verwenden
dontTakeTransition=\u00dcbergang nicht verwenden
emptyName=Name ist leer
operationExplanation=Ein Vorgang ist eine Aktion, die den Wert einer Variablen aktualisiert, wenn eine Aufgabe (Task) ausgef\u00fchrt wird. Erstellen Sie eine Liste der Vorg\u00e4nge, die von dieser Aufgabe ausgef\u00fchrt werden. Vorg\u00e4nge werden in der Auflistungsreihenfolge ausgef\u00fchrt.
highestPriority=H\u00f6chste
lowestPriority=Niedrigste
underNormalPriority=Niedrig
aboveNormalPriority=Hoch
normalPriority=Normal
transitionOrderingExplanation=Die \u00dcbergangsreihenfolge bestimmt, welcher Fluss aus dem Gateway aktiviert wird. Jeder \u00dcbergang hat eine Bedingung. Die Bedingungen werden nacheinander ausgewertet. Der erste \u00dcbergang mit einer wahren (true) Bedingung wird verwendet. Wenn keine Bedingung zutrifft, wird der Standard\u00fcbergang verwendet. Um eine \u00dcbergangsbedingung festzulegen, w\u00e4hlen Sie den \u00dcbergang (unter "Details" - Register "Allgemein" - Bereich "Allgemein").
transitionOrderingExplanation_Short=Um festzulegen, welcher ausgehende Sequenzfluss aktiviert werden soll, werden die Bedingungen in der folgenden Reihenfolge evaluiert.
AddSimple=Hinzuf\u00fcgen...
description=Beschreibung
calledProcessVersionHint=Wenn der Ausdruck leer oder der R\u00fcckgabewert null ist, wird die zuletzt eingesetzte Version verwendet
avoidElement=Elemente vermeiden
avoidElementHint=Elemente vermeiden (k\u00fcrzester Pfad)
clearSelection=Auswahl der Select-Box l\u00f6schen
multiInstance_completionConditionLabel=Fr\u00fche Abschlussbedingung
multiInstance_completionConditionDescription=Optional, wenn diese Bedingung erf\u00fcllt wird, werden die verbleibenden Instanzen nicht ausgef\u00fchrt.
dublicateIdErrorMessage={0} ID existiert bereits in Tabelle {1}
messageContentIdExistenceWarning={0} ist nicht in Sendemeldung {1} definiert
NoIncomingMessageWarning=Es befindet sich keine eingehende Nachricht im Repository
correlationKey=Korrelationsschl\u00fcssel
correlationKeyHelp=Sie k\u00f6nnen bis zu 5 Korrelationsschl\u00fcssel definieren. Der Schl\u00fcsselname und Wert werden verkettet und das Ergebnis wird in der DB gespeichert. Das Ergebnis darf 128 Zeichen nicht \u00fcberschreiten.
correlationValue=Korrelationswert
messageContentID=Inhaltselement
expressionName=Wert
generalPropertiesSectionDescription=Namen und Beschreibung f\u00fcr das ausgew\u00e4hlte Diagrammelement eingeben.
diagramSectionDescription=Name, Version und Beschreibung f\u00fcr das Diagramm eingeben
catchMessageContentEventSectionDescription=Eine Nachricht enth\u00e4lt Informationen, die von einer Sendtask oder einem Sendenachricht-Ereignis in einem anderen Pool gesendet wurden. Legen Sie fest, wie die Daten der Nachricht gehandhabt werden sollen. Die Nachricht muss bereits in einer Sendtask oder einem Sendenachricht-Ereignis definiert sein.
catchMessageEventCorrelationSectionDescription=Mit Korrelationsschl\u00fcsseln wird gepr\u00fcft, ob ob die Nachricht einer Sendtask von der Empfangstask derrelevanten Prozessinstanz empfangen wird. Legen Sie fest, wie die Korrelationsschl\u00fcssel in der Empfangsnachricht gehandhabt werden sollen. Die Schl\u00fcssel m\u00fcssen bereits in einer Sendtask definiert sein.
laneSectionDescription=Eine Lane ist eine Unterteilung eines Prozesses. Lanes werden i. d. R. zur Gruppierung von Aufgaben verwendet, die von einer funktionellen Gruppe oder Teil einer Organisation ausgef\u00fchrt werden. Das hei\u00dft, dass alle Aufgaben in einer Lane dem gleichen Akteur zugeordnet werden k\u00f6nnen. Sie sollten der Lane den Namen des Akteurs/der funktionellen Gruppe geben. Sie k\u00f6nnen auch eine Beschreibung eingeben.
looknfeelPropertySectionDescription=Legacy mode for backward compatibility.\nA look'n'feel definition sets the layout and style of forms created with the 6.x form designer.\nYou can modify an existing layout or template by modifying the HTML.
resourcePropertySectionDescription=Legacy mode for backward compatibility.\nThese resources are files used by the user interface to a 6.x process.\nYou can maintain the files used by your 6.x process, but we recommend that you migrate to using UI Designer pages and forms, and define your application in {0}.
parametersMappingSectionDescription=The mapping defines the relationship between variables in the parent process and variables in the called process.\nAuto map maps variables in the parent process to contract inputs of the called process, checking that data types are compatible. It uses variable name and data type to map called process variables to parent process variables.\nYou can update Auto map result. You can also define all the mappings manually, instead of using Auto map.
userXPSectionDescription=Dies sind Informationen, die f\u00fcr eine Aufgabe im Portal angezeigt werden. Die gesch\u00e4tzte Dauer dient zur Berechnung der verbleibenden ben\u00f6tigten Zeit, nachdem mit der Aufgabe begonnen wurde. Wenn Sie keine Portal-Informationen angeben, werden Name und Beschreibung im Bereich "Allgemein" verwendet.
confirmationPropertySectionDescription=Legacy mode for backward compatibility.\nThere is no need for a confirmation message in UI Designer forms, because you define the navigation on success and on failure. You can maintain existing confirmation messages here, for use with 6.x forms.\nA confirmation message is shown at the end of a sequence of steps performed by one user, showing that no further actions are needed.
loopSectionDescription=Iteration bedeutet, dass eine Aufgabe oder Aufruf-Aktivit\u00e4t wiederholt ausgef\u00fchrt wird, bis eine Bedingung erf\u00fcllt ist. Geben Sie die Bedingung als Ausdruck oder als Iterationszahl ein. Um mehrere Instanzen zeitgleich auszuf\u00fchren, w\u00e4hlen Sie "Mehrfach instanziiert". Um mehrere Instanzen nacheinander auszuf\u00fchren, w\u00e4hlen Sie "Standardschleife". W\u00e4hlen Sie "Keine", um die Aufgabe nur einmal (ohne Interation) auszuf\u00fchren. W\u00e4hlen Sie "Parallele Mehrfach-Instanz" oder "Schleife", um mehrere Instanzen nacheinander auszuf\u00fchren.
exportSuccessfullTitle=Exportergebnis
exportSuccessfullMsg=Look-and-Feel erfolgreich exportiert.
exporting=Exportieren...
importResultTitle=Importergebnis
importSuccessMsg=Look-and-Feel erfolgreich importiert.
oneCorrelationAtLeastNeeded=Mindestens eine Korrelationsschl\u00fcssel sollte angegeben werden.
valueShouldBeDefined=Ein Wert sollte f\u00fcr ID {0} definiert werden.
idShouldBeDefined=F\u00fcr den Wert {0} sollte eine ID definiert werden.
conditionExpresssionHelpMessage=Beispiele\: myvariable>500 ; \!isValid ; parameter1\=\=parameter2 ; usw.
messagesSectionDescription=Eine Sendtask oder ein Sendenachricht-Ereignis sendet Nachrichten an Empfangstasks oder Empfangsnachricht-Ereignisse in anderen Pools. Definieren Sie die Nachrichten, die an andere Pools gesendet werden sollen, einschl. Korrelationssschl\u00fcssel und Daten im Nachrichteninhalt.
minutes=Minuten
every=Jede(n)
minuteLabel=Minute(n)
hourly=St\u00fcndlich
daily=T\u00e4glich
weekly=W\u00f6chentlich
monthly=Monatlich
yearly=J\u00e4hrlich
generateCronButtonLabel=Cron-Ausdruck erzeugen
at=Um
hourLabel=Stunde(n)
startTime=Startzeit
everyWeekDay=Jeden Wochentag
dayLabel=Tag(e)
day=Tag
ofEvery=von jeder
monthLabel=Monat(e)
the=Die
first=Erste
second=Zweite
third=Dritte
fourth=Vierte
fifth=F\u00fcnfte
of=von
startTimerConditionDescription=Definieren Sie eine Startbedingung basierend auf einem Zyklus, einem festen Termin oder einer Dauer. Zyklus und Dauer Bewertung beginnen, wenn der Prozess aktiviert wird.
timerConditionDescription=Definieren Sie eine Timer-Bedingung, die auf einem festen Zeitpunkt oder einer Dauer basiert. Zyklus und Dauer Bewertung beginnt, wenn der Prozess aktiviert wird.
startTimerConditionHint=Erwarten Sie einen Cron-Ausdruck (Zyklus), ein java.util.Date (festes Datum) oder ein java.lang.Long (Dauer)
timerConditionHint=Erwarten Sie eine java.util.Date (festes Datum) oder ein java.lang.Long (Dauer)
cronShortDescription=Auf der Basis des Cron-Aussdruck. <A href\="http\://www.quartz-scheduler.org/documentation/quartz-1.x/tutorials/crontrigger">?</A>
invalidCronExpression=Ung\u00fcltiger Cron-Ausdruck
mustBeAnValueBetween=Muss ein Wert zwischen {0} und {1} sein.
notAValidNumber=Keine g\u00fcltige Zahl
mustBeGreaterThan=Muss gr\u00f6sser als {0} sein
cantBeGreaterThan=Darf nicht gr\u00f6sser als {0} sein
cycle=Zyklus
fixedDate=Fester Termin
selectDateLabel=W\u00e4hlen Sie einen festen Termin
basedOn=Timer-Bedingung auf der Grundlage von
generateFixedDateLabel=Generieren eines Ausdrucks f\u00fcr ein festes Datum
selectDurationLabel=W\u00e4hlen Sie eine Dauer
generateDurationLabel=Generieren Sie einen Dauer-Ausdruck
notAValidInput=Wert [{0}] ist keine g\u00fcltige Eingabe
errorDisplayLabelMaxLength=Anzeigetext ist zu lang. Maximale Anzahl der Zeichen ist {0}.
warningDisplayLabelMaxLength=Maximale Anzahl der Zeichen ist {0} f\u00fcr Display-Label, {1} f\u00fcr Beschreibungen.
expressionCantBeEmpty=Inhalt des Ausdrucks darf nicht leer sein
wiget=Widget
mandatory=Obligatorisch
readOnly=Schreibgesch\u00fctzt
renamingDiagram=Diagramm umbenennen...
standardLoop=Standard-Schleife
parallelMultinstantition=Parallele Multi-Instanziierung
sequentialMultinstantition=Sequentielle Multi-Instanziierung
dataBasedInstanceLabel=Erstellen von Instanzen aus einer Liste
definedNumberOfInstanceLabel=Erstellen einer definierten Anzahl von Instanzen
input=Eingabe
output=Ausgabe
numberOfInstancesToCreate=Anzahl der zu erstellenden Instanzen
inputList=Liste
inputListHint=Liste oder "multiple" Variable, aus der Instanzen generiert werden.
outputList=Liste der angef\u00fcgten Ergebnisse
iterator=Iterator
iteratorHint=Referenz, die den Wert jedes einzelnen Elements in der Liste zum Erstellen einer Instanz akzeptiert.
outputData=Ergebnisdaten aus jeder Instanz
storeOutputResult=Speichern der Ausgabeergebnisse
type=Typ
typeHint=Muss mit den Listentyp kompatibel sein.
createForm_desc=Geben Sie den Namen und die Beschreibung des Formulars ein. W\u00e4hlen Sie Daten, die angezeigt werden sollen, und aktualisieren Sie sie im Formular. Klicken Sie auf Tabulatoren, um zwischen Prozessdaten und Gesch\u00e4ftsdaten zu wechseln. W\u00e4hlen Sie den Typ des Widgets, je nach dem Typ des Attributs.
noBusinessDataAvailable=Keine Gesch\u00e4ftsdaten verf\u00fcgbar.
noProcessDataAvailable=Keine Prozessdaten verf\u00fcgbar.
generateInitialValueForBusinessData=Generieren Sie Widget Anfangswerte aus Gesch\u00e4ftsobjekt-Attributen.
generateInitialValueForBusinessDataHint=Die Gesch\u00e4ftsdaten m\u00fcssen initialisiert werden, bevor das Formular angezeigt wird.
processData=Prozessvariablen
businessData=Business variables
assignToContractInput=Assigned to Contract Input
assignToData=Assigned to Data
targetParameterForOutput=Target data in called process
targetParameterForInput=Target in called process
sectionDescriptionOverviewForm=Legacy mode for backward compatibility.\nYou can maintain an existing overview here until it is migrated.\nYou can create an overview using the legacy tooling, but we recommend that you use the UI Designer to create any new overview.\nThere is also a default overview page available if you choose the UI Designer type.If you use a 6.x overview pageflow, go to Execution > Overview page and select the type 6.x
sectionDescriptionEntryForm=Legacy mode for backward compatibility.\nYou can maintain existing forms here until they are migrated.\nYou can create a form using the legacy tooling, but we recommend that you create a contract and use the UI Designer to create any new form. If you use a 6.x form, go to Execution > Form and select the type 6.x
sectionDescriptionProcessEntryForm=Legacy mode for backward compatibility.\nYou can maintain existing forms here until they are migrated.\nYou can create a form using the legacy tooling, but we recommend that you create a contract and use the UI Designer to create any new form. If you use a 6.x form, go to Execution > Instantiation form and select the type 6.x

