#X-Generator: crowdin.net
GeneralSection_Name=Name
GeneralSection_Description=Beschreibung
GeneralSection_Version=Version
defaultFlowLabel=Standardfluss
activityType=Aufgabentyp
activityType_task=Menschlich
activityType_receiveTask=Empfangen
activityType_sendTask=Senden
activityType_serviceTask=Service
activityType_scriptTask=Skript
gatwetypeAnd=Parallel
gatwetypeXor=XOR
gatewayType=Gateway-Typ
newCategory=Neue Kategorie
estimatadExecutionTimeLabel=Gesch\u00e4tzte Ausf\u00fchrungszeit
dynamicLabelLabel=Name
dynamicDescriptionLabel=Dynamische Beschreibung
dataNameLabel=Name *
dataDescriptionLabel=Beschreibung
datatypeLabel=Datentyp
defaultValueLabel=Standardwert
updateConnector=Bearbeiten...
removeConnector=Entfernen
addConnector=Hinzuf\u00fcgen...
removeConnectorConfirmTitle=Diese Konnektoren entfernen?
removeConnectorConfirmMessage=M\u00f6chten Sie die folgenden Konnektoren wirklich l\u00f6schen\:
connectorAdd_tooltip=Zu dieser Aufgabe hinzuf\u00fcgen
createForm_title=Ein neues Formular erstellen
createForm_desc=Formular mit ausgew\u00e4hlten Daten erstellen
createForm_defaultName=Formular
createForm_noData=Die Aufgaben enth\u00e4lt keine Daten. Klicken Sie auf Fertig stellen, um ein leeres Formular zu erstellen.
error_allreadyExists=Ein Formular mit diesem Namen existiert bereits
error_documentAllreadyexist=Ein Dokument mit dem gleichen Namen existiert bereits
error_empty=Das Namensfeld kann nicht leer sein
duplicateForm_desc=Neues Formular erstellen oder eines aus der Liste duplizieren
duplicateForm_title=Neues Formular
duplicateForm_radioCreate=Ein neues Formular erstellen
duplicateForm_radioDuplicate=Formular aus folgender Liste duplizieren
addForm=Hinzuf\u00fcgen...
addFormTitle=Formular hinzuf\u00fcgen...
removeForm=Entfernen
editForm=Bearbeiten
formUp=Nach oben
formDown=Nach unten
selectAll=Alle w\u00e4hlen
unselectAll=Alle entw\u00e4hlen
formAddFormCommandDescription=Ein Formular hinzuf\u00fcgen
formAddFormCommandLabel=Ein Formular hinzuf\u00fcgen
formRemoveFormCommand=Ausgew\u00e4hltes Formular l\u00f6schen
FormsSection_widgetTypeDate=Datum
FormsSection_widgetTypeText=Text
FormsSection_widgetTypeFile=Datei
FormsSection_widgetTypeCheckBox=Checkbox
FormsSection_widgetTypeRadio=Optionsfelder
FormsSection_wizardVarsGroup_Title=Widgets hinzuf\u00fcgen basierend auf...
FormsSection_wizardVarsGroup_Tooltip=Daten w\u00e4hlen, die im Formular enthalten sein sollen
FormsSection_ConfirmationTemplate=Best\u00e4tigungslayout
subprocess=Teilprozess
connectionConnection=Bedingung
ResourceSection_ProcessTemplate=Prozess-Layout
ResourceSection_PageTemplate=Seiten-Template f\u00fcr Eingabeformular
ResourceSection_ErrorTemplate=Fehler-Layout
ResourceSection_ProcessTemplate_hint=Layout, das f\u00fcr alle Prozessformulare verwendet wird
ResourceSection_PageTemplate_hint=Template, die zur Generierung der Eingabeseiten der Formulare verwendet wird
ResourceSection_ErrorTemplate_hint=Layout, das zur Anzeige von Fehlermeldungen verwendet wird
ResourceSection_HostPageTemplate_hint=Prozessbeh\u00e4lter zum Hinzuf\u00fcgen von Inhalten im Prozesslayout und einiger Ressourcen (Javascript...)
ResourceSection_ViewTemplate_hint=Template, die zur Generierung der Ansichtsseiten der Formulare verwendet wird
ResourceSection_LoginPage=Anmeldeseite
Browse=Durchsuchen...
Clear=L\u00f6schen
Remove=Entfernen
File=Datei hinzuf\u00fcgen...
Folder=Ordner hinzuf\u00fcgen...
Add=Hinzuf\u00fcgen...
Download=Standard herunterladen...
Error=Fehler
Internal=Intern
External=Extern
up=Nach oben
down=Nach unten
durationLabel=Dauer
priority=Priorit\u00e4t
isMultiInstantiated=ist mehrfach instanziiert
assignTo=Zugewiesen zu
sourceParameter=Quelldaten
targetParameter=Teilprozessdaten
messageEventAddWizardPageDesc=Eine Nachricht wird an einen anderen Pool gesendet.\nZu \u00fcbertragende Daten f\u00fcr die Verwendung im Zielpool hier eingeben
messageEventAddWizardPageTitle=Nachricht hinzuf\u00fcgen
messageEventAddWizardPageName=Seitenname f\u00fcr Nachrichtenereignis
removeEventConfirmTitle=Sind Sie sicher?
removeEventConfirmMessage=M\u00f6chten Sie die Ereignisse wirklich l\u00f6schen\:
selectMessageEventLabel=Empfangsnachricht
messageFlowEventChoice=Nachricht w\u00e4hlen
eventType_messageStart=Startnachricht
eventType_messageEnd=Endnachricht
eventType_intermediateCatch=Empfangsnachricht
eventType_intermediateThrow=Sendenachricht
messageEventType=Nachrichtentyp
editCondition=Bearbeiten...
timerCondition=Timer-Bedingung
timerConditionWizardTitle=Timer-Bedingung bearbeiten
eventNameLabel=Zielelement
processNameLabel=Zielpool
isMandatory=ist obligatorisch
addTargetEventDialogTitle=Zielereignis hinzuf\u00fcgen
gotoLabel=Gehe zu
fromLinksLabel=Von den Links
linkType=Linktyp
catchLink=Empfangslink
throwLink=Sendelink
selectSignalEventLabel=Signal
isLoopLabel=ist Standardschleife
testBeforeLabel=Test vorher
testAfterLabel=Test nachher
loopConditionLabel=Schleife bis
maximumLoopLabel=Maximale Schleife
noneLabel=Keine
optionalLabel=(Optional)
confirmationMessage=Best\u00e4tigungsmeldung
localTemplate=Look-and-Feel anwenden
name=Name
version=Version
selectLocalTemplateWizardPageTitle=Web-Template w\u00e4hlen
selectLocalTemplateWizardPageDescription=Vordefinierte Web-Template aus obiger Liste w\u00e4hlen
webTemplates=Web-Templates
saveAsTemplate_title=Als neues Look-and-Feel speichern
saveAsTemplate_templateLabel=Template-Name
saveAsTemplate_previewPathLabel=Vorschau
ResourceSection_SaveAsTemplate=Als neues Look-and-Feel speichern
Edit=Bearbeiten
ResourceSection_importTemplate=Importieren...
ResourceSection_export=Exportieren...
ResourceSection_ViewTemplate=Seiten-Template f\u00fcr Anfrageformular
StepSummarySectionContribution_title=Beschreibung nach Fertigstellung
save=Speichern
gatwetypeInclusive=Inklusiv
ResourceSection_AutoLogin=Automatisch anmelden
ResourceSection_AutoLoginTooltip=Aktivieren Sie diese Option, um die Anmeldung f\u00fcr einen bestimmten Benutzer zu \u00fcberspringen (kann f\u00fcr den anonymen Zugriff verwendet werden)
showLabel=Name
errorEvent_error=Zugeh\u00f6riger Fehler
endErrorEvent_error=Fehlercode
mustBeSet=muss gesetzt sein
errorEvent_errorCodeHint=Der Fehlercode, der gesendet wird
errorEvent_errorCodeCatchHint=Der Fehlercode, der empfangen wird, wenn kein Fehlercode gesetzt ist; Fehler aller Art werden empfangen (auch Konnektor-Fehler)
january=Januar
february=Februar
march=M\u00e4rz
april=April
may=Mai
june=Juni
july=Juli
august=August
september=September
october=Oktober
november=November
december=Dezember
monday=Montag
tuesday=Dienstag
wednesday=Mittwoch
thursday=Donnerstag
friday=Freitag
saturday=Samstag
sunday=Sonntag
dynamicLabelHint=Sie k\u00f6nnen das im Portal angezeigte Label f\u00fcr diesen Schritt anpassen
dynamicDescriptionHint=Sie k\u00f6nnen die im Portal angezeigte Beschreibung dieses Schritts anpassen
stepSummaryHint=Sie k\u00f6nnen die Beschreibung nach Abschluss dieses Schritts im Portal anpassen.
executionTimeHint=Die f\u00fcr diesen Schritt festgelegte Zeit. Dient im Portal zur Anzeige der verbleibenden Zeit
targetProcessMessageHint=Vorhandenen Prozess w\u00e4hlen und Namen f\u00fcr den Zielprozess eingeben
targetEventMessageHint=W\u00e4hlen Sie einen vorhandenes "Catch"-Nachrichtenereignis oder erhalten Sie Aufgabe oder geben Sie einen Namen ein
signalEvent_catchHint=Der Code des zu empfangenden Signals
signalEvent_throwHint=Der Code des zu sendenden Signals
confirmDeleteFile_title=Sind Sie sicher?
confirmDeleteFile_msg=Die ausgew\u00e4hlten Dateien werden gel\u00f6scht, m\u00f6chten Sie fortfahren?
multipleWidget=Mehrere
pageFlow=Pageflow
skip=\u00dcberspringen
pageFlowTransientDataConnectors=Konnektoren f\u00fcr die Dateninitialisierung
pageFlowTransientData=Transiente Daten
messageEventAddWizardNameAlreadyExists=Dieser Name existiert bereits
formsTabLabel=Formulare
transientDatTabLabel=Transiente Daten
chooseFont=Schrift w\u00e4hlen...
ChooseFigure=Vorhandene Abbildung w\u00e4hlen...
applyStyle=Gleicher Stil wie
activityType_callActivity=Aufruf-Aktivit\u00e4t
skipPageFlowTooltip=Ist diese Aufgabe gew\u00e4hlt, erfolgt eine automatische \u00dcbermittlung, d. h. ein Benutzer muss eine Seite \u00f6ffnen, die automatisch gesendet wird. Nicht identisch mit einer abstrakten Aufgabe.
activityType_abstractTask=Abstrakt
ResourceSection_HostPageTemplate=Anwendungsbeh\u00e4lter
GeneralSection_ActivateValidation=Validierung aktivieren
ResourceSection_OverWrite_title=Sind Sie sicher?
ResourceSection_OverWrite_msg=Die aktuellen, auf den Prozess angewendeten Look-and-Feel-Einstellungen werden verworfen.
saveAsTemplate_error=Das angepasste Look-and-Feel kann nicht gespeichert werden.\nBitte \u00fcberpr\u00fcfen Sie Ihre Protokolle.
saveAsTemplate_import_error=Look-and-Feel kann nicht importiert werden. Bitte \u00fcberpr\u00fcfen Sie Ihre Protokolle.
confirmationPathTooltip=Eine Best\u00e4tigungs-Template kann nur in einem Pageflow verwendet werden.
confirmationMessageTooltip=Eine Best\u00e4tigungsmeldung kann nur in einem Pageflow verwendet werden.
ResourceSection_BasedOnLookAndFeel=Basiert zurzeit auf\:
widgetRemovedWarning_title=Warnung
widgetRemovedWarning_msg=Ihr Widget wird entfernt. \nDenken Sie daran, es auch aus dem angepassten Layout zu entfernen\!
autoMap=Autom. abbilden
autoMap_description=f\u00fcr Variablen mit dem gleichen Namen oder mit dem Pr\u00e4fix "sub_"
addMessageContent=Inhalt der Nachricht
correlation=Korrelation zwischen den Instanzen
correlationDescription=Korrelation verwenden, wenn Sie bestimmte Instanzen von zwei Prozessen koordinieren wollen.
useCorrelationkeys=Key-basierte Korrelation verwenden
AddCorrelation=Hinzuf\u00fcgen
removeCorrelation=Entfernen
removeMessageContent=Entfernen
addMessageContentButton=Hinzuf\u00fcgen
addMessageContentDescription=Sie k\u00f6nnen den Nachrichteninhalt leer lassen, um Instanzen zwischen zwei Prozessen zu synchonisieren. \nZum Ausw\u00e4hlen bestimmten Instanzen, benutzen Sie "Korrelation zwischen Instanzen-Tab".
autoFillMessageContent=Automatisch ausf\u00fcllen
useExpression=Ausdruck verwenden
useDecisionTable=Entscheidungstabelle verwenden
editDecisionTable=Entscheidungstabelle bearbeiten...
and=AND
takeTransition=\u00dcbergang verwenden
dontTakeTransition=\u00dcbergang nicht verwenden
emptyName=Name ist leer
operationExplanation=Ein Vorgang ist eine Aktion, die den Wert einer Variablen aktualisiert, wenn eine Aufgabe (Task) ausgef\u00fchrt wird. Erstellen Sie eine Liste der Vorg\u00e4nge, die von dieser Aufgabe ausgef\u00fchrt werden. Vorg\u00e4nge werden in der Auflistungsreihenfolge ausgef\u00fchrt.
highestPriority=H\u00f6chste
lowestPriority=Niedrigste
underNormalPriority=Niedrig
aboveNormalPriority=Hoch
normalPriority=Normal
transitionOrderingExplanation=Die \u00dcbergangsreihenfolge bestimmt, welcher Fluss aus dem Gateway aktiviert wird. Jeder \u00dcbergang hat eine Bedingung. Die Bedingungen werden nacheinander ausgewertet. Der erste \u00dcbergang mit einer wahren (true) Bedingung wird verwendet. Wenn keine Bedingung zutrifft, wird der Standard\u00fcbergang verwendet. Um eine \u00dcbergangsbedingung festzulegen, w\u00e4hlen Sie den \u00dcbergang (unter "Details" - Register "Allgemein" - Bereich "Allgemein").
transitionOrderingExplanation_Short=Um festzulegen, welcher ausgehende Sequenzfluss aktiviert werden soll, werden die Bedingungen in der folgenden Reihenfolge evaluiert.
documentDefaultName=Dokument
remove=Entfernen
selectDocumentDescription=Bitte w\u00e4hlen Sie ein Dokument aus dem {0} Dokumenten-Repository
explanationExternalDocument=Das Dokument wird von einer Fremdanbieter-Komponente verarbeitet. Bitte geben Sie die URL f\u00fcr den Zugriff ein.
explanationInternalDocument=Das Dokument wird direkt von {0} gehandhabt. Sie k\u00f6nnen eine Datei zur Initialisierung bereitstellen.
selectDocumentDialogTitle=W\u00e4hlen Sie ein Dokument aus dem {0} Repository
importEtc=Importieren...
AddSimple=Hinzuf\u00fcgen
description=Beschreibung
mimeType=MIME-Typ
hintExternalUrl=Beispiel\: http\://myGED.com
hintMimeTypeDocument=Beispiele\: application/octet-stream, image/ico
calledProcessVersionHint=Wenn der Ausdruck leer oder der R\u00fcckgabewert null ist, wird die zuletzt eingesetzte Version verwendet
avoidElement=Elemente vermeiden
avoidElementHint=Elemente vermeiden (k\u00fcrzester Pfad)
multiInstance_useCollection=Sammlung verwenden
multiInstance_useCardinality=Kardinalit\u00e4t verwenden
multiInstance_inputData=Eingabedaten
multiInstance_outputData=Ausgabedaten
clearSelection=Auswahl der Select-Box l\u00f6schen
multiInstance_inputDataDescription=Daten aus dieser Sammlung abbilden, um diese Instanz auf die angegebenen Daten in der Instanz zu instanziieren.
multiInstance_sequentialDescription=Pr\u00e4zise, wenn Aktivit\u00e4ten sequenziell oder parallel ausgef\u00fchrt werden
multiInstance_completionConditionLabel=Abschlussbedingung
multiInstance_completionConditionDescription=Booleschen Wert ausgeben, wenn die Mehrfach-Instanziierung beendet ist.
multiInstance_sequentialButton=Sequenziell
multiInstance_useCollectionDescription=Geben Sie eine Sammlung an. F\u00fcr jedes Element der Sammlung wird eine Instanz erstellt.
multiInstance_outputDataDescription=Die lokalen Daten der Instanz zur Sammlung abgeschlossener Instanzen hinzuf\u00fcgen.
multiInstance_useCardinalityDescription=Genaue Anzahl der ben\u00f6tigten Instanzen festlegen.
multiInstance_listOutputDataDescription=Pr\u00e4zisierte Ausgabedaten werden in dieser Liste gespeichert.
multiInstance_listOutputDataLabel=Liste der Ausgabeergebnisse
dublicateIdErrorMessage={0} ID existiert bereits in Tabelle {1}
messageContentIdExistenceWarning={0} ist nicht in Sendemeldung {1} definiert
NoIncomingMessageWarning=Es befindet sich keine eingehende Nachricht im Repository
throwMessageExpressionTypeWarning=Stellen Sie sicher, dass das Ergebnis des Ausdrucks in der Sendenachricht-Definition definiert ist
correlationKey=Korrelationsschl\u00fcssel
correlationKeyHelp=Sie k\u00f6nnen bis zu 5 Korrelationsschl\u00fcssel definieren. Der Schl\u00fcsselname und Wert werden verkettet und das Ergebnis wird in der DB gespeichert. Das Ergebnis darf 128 Zeichen nicht \u00fcberschreiten.
correlationValue=Korrelationswert
messageContentID=Inhaltselement
expressionName=Wert
generalPropertiesSectionDescription=Namen und Beschreibung f\u00fcr das ausgew\u00e4hlte Diagrammelement eingeben.
diagramSectionDescription=Name, Version und Beschreibung f\u00fcr das Diagramm eingeben
catchMessageContentEventSectionDescription=Eine Nachricht enth\u00e4lt Informationen, die von einer Sendtask oder einem Sendenachricht-Ereignis in einem anderen Pool gesendet wurden. Legen Sie fest, wie die Daten der Nachricht gehandhabt werden sollen. Die Nachricht muss bereits in einer Sendtask oder einem Sendenachricht-Ereignis definiert sein.
catchMessageEventCorrelationSectionDescription=Mit Korrelationsschl\u00fcsseln wird gepr\u00fcft, ob ob die Nachricht einer Sendtask von der Empfangstask derrelevanten Prozessinstanz empfangen wird. Legen Sie fest, wie die Korrelationsschl\u00fcssel in der Empfangsnachricht gehandhabt werden sollen. Die Schl\u00fcssel m\u00fcssen bereits in einer Sendtask definiert sein.
documentPropertySectionDescription=Ein Dokument ist eine Anlage mit Informationen \u00fcber den Prozess. Legen Sie fest, welche Dokumente an den Prozess angeh\u00e4ngt werden sollen.
laneSectionDescription=Eine Lane ist eine Unterteilung eines Prozesses. Lanes werden i. d. R. zur Gruppierung von Aufgaben verwendet, die von einer funktionellen Gruppe oder Teil einer Organisation ausgef\u00fchrt werden. Das hei\u00dft, dass alle Aufgaben in einer Lane dem gleichen Akteur zugeordnet werden k\u00f6nnen. Sie sollten der Lane den Namen des Akteurs/der funktionellen Gruppe geben. Sie k\u00f6nnen auch eine Beschreibung eingeben.
looknfeelPropertySectionDescription=Eine Look-and-Feel-Definition enth\u00e4lt das Layout und den Stil der Formulare in einer Webanwendung. Sie k\u00f6nnen ein vorhandenes Layout oder eine Template \u00e4ndern, indem Sie den HTML-Code \u00e4ndern. Sie k\u00f6nnen auch eine neue HTML-Datei hochladen. Dies ist jedoch nicht empfehlenswert, da Sie die urspr\u00fcngliche Template \u00fcberschreiben k\u00f6nnten.
resourcePropertySectionDescription=Eine Ressource ist eine Datei, die von der Prozessanwendung verwendet wird. Diese Dateien werden in Ordnern gespeichert. F\u00fcgen Sie die f\u00fcr die Prozessanwendung ben\u00f6tigten Dateien hinzu. Sie k\u00f6nnen Ressourcendateien auch bearbeiten und die Anmeldeseite konfigurieren, indem sie die JSP(JavaServer Page)-Datei \u00e4ndern oder direkt eine neue hochladen. Achten Sie darauf, dass Sie keine ben\u00f6tigten Dateien entfernen.
parametersMappingSectionDescription=Dieses Mapping definiert die Beziehungen zwischen Variablen in einem \u00fcbergeordneten und einem untergeordneten Prozess. Sie k\u00f6nnen konfigurieren, welche Variablenwerte automatisch abgebildet werden sollen und explizite Abbildungen zwischen Prozessvariablen und Teilprozessvariablen festlegen.
userXPSectionDescription=Dies sind Informationen, die f\u00fcr eine Aufgabe im Portal angezeigt werden. Die gesch\u00e4tzte Dauer dient zur Berechnung der verbleibenden ben\u00f6tigten Zeit, nachdem mit der Aufgabe begonnen wurde. Wenn Sie keine Portal-Informationen angeben, werden Name und Beschreibung im Bereich "Allgemein" verwendet.
confirmationPropertySectionDescription=Eine Best\u00e4tigungsmeldung wird angezeigt, nachdem ein Benutzer das Ende eine Abfolge von Schritten erreicht hat und keine weiteren Ma\u00dfnahmen erforderlich sind. Legen Sie Layout und Inhalt der Nachricht fest.
loopSectionDescription=Iteration bedeutet, dass eine Aufgabe oder Aufruf-Aktivit\u00e4t wiederholt ausgef\u00fchrt wird, bis eine Bedingung erf\u00fcllt ist. Geben Sie die Bedingung als Ausdruck oder als Iterationszahl ein. Um mehrere Instanzen zeitgleich auszuf\u00fchren, w\u00e4hlen Sie "Mehrfach instanziiert". Um mehrere Instanzen nacheinander auszuf\u00fchren, w\u00e4hlen Sie "Standardschleife". W\u00e4hlen Sie "Keine", um die Aufgabe nur einmal (ohne Interation) auszuf\u00fchren. W\u00e4hlen Sie "Parallele Mehrfach-Instanz" oder "Schleife", um mehrere Instanzen nacheinander auszuf\u00fchren.
correlationHelp=Ein Korrelationsschl\u00fcssel ist ein Identifier, der zum Senden oder Empfangen einer Nachricht verwendet wird, um diese an die richtigen Prozessinstanzen weiterzuleiten.
exportSuccessfullTitle=Exportergebnis
exportSuccessfullMsg=Look-and-Feel erfolgreich exportiert.
exporting=Exportieren...
importResultTitle=Importergebnis
importSuccessMsg=Look-and-Feel erfolgreich importiert.
oneCorrelationAtLeastNeeded=Mindestens eine Korrelationsschl\u00fcssel sollte angegeben werden.
valueShouldBeDefined=Ein Wert sollte f\u00fcr ID {0} definiert werden.
idShouldBeDefined=F\u00fcr den Wert {0} sollte eine ID definiert werden.
conditionExpresssionHelpMessage=Beispiele\: myvariable>500 ; \!isValid ; parameter1\=\=parameter2 ; usw.
errorOutputDataMultiInstanceCollection=Eine Liste der Ausgabeergebnisse muss festgelegt werden
errorInputDataMultiInstanceCollection=Eine Sammlung muss festgelegt werden
messagesSectionDescription=Eine Sendtask oder ein Sendenachricht-Ereignis sendet Nachrichten an Empfangstasks oder Empfangsnachricht-Ereignisse in anderen Pools. Definieren Sie die Nachrichten, die an andere Pools gesendet werden sollen, einschl. Korrelationssschl\u00fcssel und Daten im Nachrichteninhalt.
minutes=Minuten
every=Jede(n)
minuteLabel=Minute(n)
hourly=St\u00fcndlich
daily=T\u00e4glich
weekly=W\u00f6chentlich
monthly=Monatlich
yearly=J\u00e4hrlich
generateCronButtonLabel=Cron-Ausdruck erzeugen
at=Um
hourLabel=Stunde(n)
startTime=Startzeit
everyWeekDay=Jeden Wochentag
dayLabel=Tag(e)
day=Tag
ofEvery=von jeder
monthLabel=Monat(e)
the=Die
first=Erste
second=Zweite
third=Dritte
fourth=Vierte
fifth=F\u00fcnfte
of=von
startTimerConditionDescription=Definieren Sie eine Startbedingung basierend auf einem Zyklus, einem festen Termin oder einer Dauer. Zyklus und Dauer Bewertung beginnen, wenn der Prozess aktiviert wird.
timerConditionDescription=Definieren Sie eine Timer-Bedingung, die auf einem festen Zeitpunkt oder einer Dauer basiert. Zyklus und Dauer Bewertung beginnt, wenn der Prozess aktiviert wird.
startTimerConditionHint=Erwarten Sie einen Cron-Ausdruck (Zyklus), ein java.util.Date (festes Datum) oder ein java.lang.Long (Dauer)
timerConditionHint=Erwarten Sie eine ava.util.Date (festes Datum) oder ein java.lang.Long (Dauer)
cronShortDescription=Auf der Basis des Cron-Aussdruck. <A href\="http\://www.quartz-scheduler.org/documentation/quartz-1.x/tutorials/crontrigger">?</A>
invalidCronExpression=Ung\u00fcltiger Cron-Ausdruck
mustBeAnValueBetween=Muss ein Wert zwischen {0} und {1} sein.
notAValidNumber=Keine g\u00fcltige Zahl
mustBeGreaterThan=Muss gr\u00f6sser als {0} sein
cantBeGreaterThan=Darf nicht gr\u00f6sser als {0} sein
cycle=Zyklus
fixedDate=Fester Termin
selectDateLabel=W\u00e4hlen Sie einen festen Termin
basedOn=Timer-Bedingung auf der Grundlage von
generateFixedDateLabel=Generieren eines Ausdrucks f\u00fcr ein festes Datum
selectDurationLabel=W\u00e4hlen Sie eine Dauer
generateDurationLabel=Generieren Sie einen Dauer-Ausdruck
notAValidInput=Wert [{0}] ist keine g\u00fcltige Eingabe
transientDataWarning=Please note that transient data in activity operations will not be supported in future versions. 
errorDisplayLabelMaxLength=Display text is too long. Maximum number of characters is {0}.
warningDisplayLabelMaxLength=Maximum number of characters is {0} for display label, {1} for descriptions.
