#X-Generator: crowdin.com
find=\u041d\u0430\u0439\u0442\u0438...
exportAsPdf=\u042d\u043a\u0441\u043f\u043e\u0440\u0442 \u0432 PDF...
completeImport=\u0412\u044b\u0445\u043e\u0434 \u0438\u0437 \u0440\u0435\u0436\u0438\u043c\u0430 \u0438\u043c\u043f\u043e\u0440\u0442\u0430
unknown=\u041d\u0435\u0438\u0437\u0432\u0435\u0441\u0442\u043d\u043e
name=\u0418\u043c\u044f
elementType=\u0422\u0438\u043f \u044d\u043b\u0435\u043c\u0435\u043d\u0442\u0430
property=\u0421\u0432\u043e\u0439\u0441\u0442\u0432\u043e
reviewed=\u041f\u0440\u043e\u0441\u043c\u043e\u0442\u0440\u0435\u043d\u043e
information=\u041e\u043f\u0438\u0441\u0430\u043d\u0438\u0435
status=\u0421\u0442\u0430\u0442\u0443\u0441
currentVersion=\u0442\u0435\u043a\u0443\u0449\u0430\u044f \u0432\u0435\u0440\u0441\u0438\u044f
migrationReportOf=\u0418\u043c\u043f\u043e\u0440\u0442\u0438\u0440\u043e\u0432\u0430\u0442\u044c \u043e\u0442\u0447\u0435\u0442 \u0434\u043b\u044f {0}
hideValidStatusAction=\u0421\u043a\u0440\u044b\u0442\u044c \u0434\u0435\u0439\u0441\u0442\u0432\u0438\u0442\u0435\u043b\u044c\u043d\u044b\u0439 \u0438\u0437\u043c\u0435\u043d\u0435\u043d\u0438\u044f
hideReviewedAction=\u0421\u043a\u0440\u044b\u0442\u044c \u043e\u0431\u0437\u043e\u0440 \u0438\u0437\u043c\u0435\u043d\u0435\u043d\u0438\u0439
description=\u041e\u043f\u0438\u0441\u0430\u043d\u0438\u0435
okStatusTooltip=\u041d\u0438\u043a\u0430\u043a\u0438\u0445 \u0434\u0435\u0439\u0441\u0442\u0432\u0438\u0439 \u043d\u0435 \u0442\u0440\u0435\u0431\u0443\u0435\u0442\u0441\u044f.
warningStatusTooltip=\u041e\u0431\u0437\u043e\u0440 \u0442\u0440\u0435\u0431\u0443\u0435\u0442\u0441\u044f\: \u0441\u043c\u043e\u0442\u0440\u0438\u0442\u0435 \u043f\u0430\u043d\u0435\u043b\u044c \u043e\u043f\u0438\u0441\u0430\u043d\u0438\u044f.
errorStatusTooltip=\u0422\u0440\u0435\u0431\u0443\u0435\u0442\u0441\u044f \u0434\u0435\u0439\u0441\u0442\u0432\u0438\u0435\: \u0441\u043c\u043e\u0442\u0440\u0438\u0442\u0435 \u043f\u0430\u043d\u0435\u043b\u044c \u043e\u043f\u0438\u0441\u0430\u043d\u0438\u044f.
yes=\u0414\u0430
no=\u043d\u0435\u0442
noActionRequired=\u041d\u0438\u043a\u0430\u043a\u0438\u0445 \u0434\u0435\u0439\u0441\u0442\u0432\u0438\u0439 \u043d\u0435 \u0442\u0440\u0435\u0431\u0443\u0435\u0442\u0441\u044f.
reviewRequired=\u041e\u0431\u0437\u043e\u0440 \u0442\u0440\u0435\u0431\u0443\u0435\u0442\u0441\u044f.
actionRequired=\u0422\u0440\u0435\u0431\u0443\u0435\u0442\u0441\u044f \u0434\u0435\u0439\u0441\u0442\u0432\u0438\u0435.
completeImportMessage=\u0412\u044b \u0441\u043e\u0431\u0438\u0440\u0430\u0435\u0442\u0435\u0441\u044c \u0432\u044b\u0439\u0442\u0438 \u0438\u0437 \u0438\u043c\u043f\u043e\u0440\u0442\u0438\u0440\u0443\u0435\u043c\u043e\u0433\u043e \u043e\u0442\u0447\u0435\u0442\u0430 \u0434\u043b\u044f \u044d\u0442\u043e\u0439 \u0434\u0438\u0430\u0433\u0440\u0430\u043c\u043c\u044b \u043f\u0440\u043e\u0446\u0435\u0441\u0441\u0430.  \u0412\u044b \u043d\u0435 \u0441\u043c\u043e\u0436\u0435\u0442\u0435 \u0432\u0435\u0440\u043d\u0443\u0442\u044c\u0441\u044f \u043a \u044d\u0442\u043e\u043c\u0443 \u043e\u0442\u0447\u0435\u0442\u0443.  \u041d\u0430\u0436\u043c\u0438\u0442\u0435 \u043a\u043d\u043e\u043f\u043a\u0443 \u041e\u041a, \u0447\u0442\u043e\u0431\u044b \u0432\u044b\u0439\u0442\u0438, \u0438\u043b\u0438 \u041e\u0442\u043c\u0435\u043d\u0430, \u0447\u0442\u043e\u0431\u044b \u0441\u043e\u0445\u0440\u0430\u043d\u0438\u0442\u044c \u043e\u0442\u0447\u0435\u0442.
completeImportToggleMessage=\u042d\u043a\u0441\u043f\u043e\u0440\u0442\u0438\u0440\u043e\u0432\u0430\u0442\u044c \u043e\u0442\u0447\u0435\u0442 \u043e \u0441\u0442\u0430\u0442\u0443\u0441\u0435 \u0438\u043c\u043f\u043e\u0440\u0442\u0430
migrationWarningTitle=\u0418\u043c\u043f\u043e\u0440\u0442 \u0438\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0438\u0438
doNotDisplayAtNextImport=\u041d\u0435 \u043e\u0442\u043e\u0431\u0440\u0430\u0436\u0430\u0442\u044c \u043f\u0440\u0438 \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0435\u043c \u0438\u043c\u043f\u043e\u0440\u0442\u0435
migrationWizardTitle=\u0438\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0438\u044f \u0438\u043c\u043f\u043e\u0440\u0442\u0430 \u0432\u0435\u0440\u0441\u0438\u0438 5.9 \u0438\u043b\u0438 \u0431\u043e\u043b\u0435\u0435 \u043f\u043e\u0437\u0434\u043d\u0438\u0439 .bar 
migrationWizardDescription=\u0418\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0438\u044f \u043e\u0431 \u0438\u043c\u043f\u043e\u0440\u0442\u0435 \u0432\u0435\u0440\u0441\u0438\u0438 Bonita Open Studio 5.9 \u0438\u043b\u0438 \u0441\u0442\u0430\u0440\u0448\u0435 ( .bar)
importWarningMessageContent=\u0418\u043c\u043f\u043e\u0440\u0442 \u0438\u0437 .bar \u0444\u0430\u0439\u043b\u0430 \u0432\u0435\u0440\u0441\u0438\u0438 5.9 \u043f\u043e\u043c\u043e\u0436\u0435\u0442 \u0432\u0430\u043c \u043e\u0431\u043d\u043e\u0432\u0438\u0442\u044c \u0432\u0430\u0448\u0435 \u043f\u0440\u0438\u043b\u043e\u0436\u0435\u043d\u0438\u0435 \u0434\u043b\u044f \u0438\u0441\u043f\u043e\u043b\u044c\u0437\u043e\u0432\u0430\u043d\u0438\u044f \u0441 \u0432\u0435\u0440\u0441\u0438\u0435\u0439 {0} 6.0. \u041e\u0442\u0447\u0435\u0442 \u043f\u043e\u0441\u043b\u0435 \u043e\u0431\u0440\u0430\u0431\u043e\u0442\u043a\u0438  \u0438\u043c\u043f\u043e\u0440\u0442\u0430 \u0434\u0430\u0441\u0442 \u0432\u0430\u043c \u0441\u0442\u0430\u0442\u0443\u0441 \u0438 \u043e\u043f\u0438\u0441\u0430\u043d\u0438\u0435 \u043a\u0430\u0436\u0434\u043e\u0433\u043e \u044d\u043b\u0435\u043c\u0435\u043d\u0442\u0430 \u043f\u0440\u0438\u043b\u043e\u0436\u0435\u043d\u0438\u044f. \u041e\u043f\u0440\u0435\u0434\u0435\u043b\u0435\u043d\u0438\u044f\u043c\u0438 \u0441\u043e\u0441\u0442\u043e\u044f\u043d\u0438\u044f \u044f\u0432\u043b\u044f\u044e\u0442\u0441\u044f\:
importWarningMessageContentAfterPart=\u0427\u0442\u043e\u0431\u044b \u043e\u0442\u0441\u043b\u0435\u0436\u0438\u0432\u0430\u0442\u044c \u044d\u043b\u0435\u043c\u0435\u043d\u0442\u044b, \u043a\u043e\u0442\u043e\u0440\u044b\u0435 \u0432\u044b \u0440\u0430\u0441\u0441\u043c\u043e\u0442\u0440\u0435\u043b\u0438, \u043c\u043e\u0436\u043d\u043e \u0438\u0441\u043f\u043e\u043b\u044c\u0437\u043e\u0432\u0430\u0442\u044c \u0441\u0442\u043e\u043b\u0431\u0435\u0446 \u00ab\u041e\u0431\u0437\u043e\u0440\u00bb. \u041a\u043e\u0433\u0434\u0430 \u0432\u044b \u0437\u0430\u0432\u0435\u0440\u0448\u0438\u043b\u0438 \u043d\u0435\u043e\u0431\u0445\u043e\u0434\u0438\u043c\u044b\u0435 \u043e\u0431\u0437\u043e\u0440\u044b \u0438 \u043f\u0440\u0435\u043e\u0431\u0440\u0430\u0437\u043e\u0432\u0430\u043d\u0438\u044f, \u0438\u043b\u0438 \u043a\u043e\u0433\u0434\u0430 \u0432\u0430\u043c \u0431\u043e\u043b\u044c\u0448\u0435 \u043d\u0435 \u043d\u0443\u0436\u043d\u043e \u043e\u0442\u0441\u043b\u0435\u0436\u0438\u0432\u0430\u0442\u044c \u0441\u043e\u0441\u0442\u043e\u044f\u043d\u0438\u0435 \u0438\u043c\u043f\u043e\u0440\u0442\u0430, \u043d\u0430\u0436\u043c\u0438\u0442\u0435 \u043a\u043d\u043e\u043f\u043a\u0443 \u00ab\u0418\u043c\u043f\u043e\u0440\u0442\u0438\u0440\u043e\u0432\u0430\u0442\u044c \u0432\u044b\u0445\u043e\u0434\u0430\u00bb.
noActionRequiredHelp=\u044d\u043b\u0435\u043c\u0435\u043d\u0442 \u0431\u044b\u043b \u0430\u0432\u0442\u043e\u043c\u0430\u0442\u0438\u0447\u0435\u0441\u043a\u0438 \u043f\u0440\u0435\u043e\u0431\u0440\u0430\u0437\u043e\u0432\u0430\u043d, \u0438 \u043e\u043d \u043e\u043f\u0435\u0440\u0430\u0431\u0435\u043b\u0435\u043d
actionRequiredHelp=\u044d\u043b\u0435\u043c\u0435\u043d\u0442 \u0435\u0449\u0435 \u043d\u0435 \u043c\u043e\u0436\u0435\u0442 \u0431\u044b\u0442\u044c \u043f\u0440\u0435\u043e\u0431\u0440\u0430\u0437\u043e\u0432\u0430\u043d \u0432 \u044d\u0442\u043e\u0439 \u0432\u0435\u0440\u0441\u0438\u0438. \u0412\u0430\u043c \u043d\u0443\u0436\u043d\u043e \u0432\u043e\u0441\u0441\u0442\u0430\u043d\u043e\u0432\u0438\u0442\u044c \u0435\u0433\u043e.
reviewRequiredHelp=\u044d\u043b\u0435\u043c\u0435\u043d\u0442 \u0431\u044b\u043b \u0447\u0430\u0441\u0442\u0438\u0447\u043d\u043e \u043f\u0440\u0435\u043e\u0431\u0440\u0430\u0437\u043e\u0432\u0430\u043d \u0438 \u043e\u043d \u043d\u0435 \u0444\u0443\u043d\u043a\u0446\u0438\u043e\u043d\u0438\u0440\u0443\u0435\u0442, \u043a\u0430\u043a \u043d\u0443\u0436\u043d\u043e. \u0412\u044b \u0434\u043e\u043b\u0436\u043d\u044b \u043f\u0440\u043e\u0432\u0435\u0440\u0438\u0442\u044c \u043f\u043e\u0432\u0435\u0434\u0435\u043d\u0438\u0435.
migrating=\u041f\u0435\u0440\u0435\u043d\u043e\u0441...
