userDefinedCatLabel=Utilisateur
stringCatLabel=Chaines
numberCatLabel=Num\u00e9riques
otherCatLabel=Autres
collectionCatLabel=Collections
groovyScriptRepository=Scripts Groovy
groovyProvidedScriptRepository=Groovy scripts fournis
noDocumentationAvailable = Aucune documentation n'est disponible
errorBuildingJarForGroovyScriptsForProcess=Erreur pendant la g\u00e9n\u00e9ration des Jars pour les scripts Groovy des d\u00e9pendances de processus.  V\u00e9rifiez les scripts dans le menu d\u00e9veloppement-> G\u00e9rer les scripts Groovy...
errorBuildingJarForProvidedGroovyScriptsForProcess=Erreur pendant la g\u00e9n\u00e9ration des Jars pour les scripts Groovy fournis par {0}.
errorBuildingJarForGroovyScriptsFor6xApplication=Erreur pendant la g\u00e9n\u00e9ration des Jars pour les scripts Groovy des d\u00e9pendances d'application 6.x.  V\u00e9rifiez les scripts dans le menu D\u00e9veloppement-> G\u00e9rer les scripts Groovy...
multiInstanceIteratorDescription=La variable d'it\u00e9rateur pour cette t\u00e2che multi-instanci\u00e9e.
apiAccessorDescription=Variable d'acc\u00e8s aux API Bonita.<br/>&\#9888; Malgr\u00e9 l'homog\u00e9n\u00e9it\u00e9 avec l'API du client Bonita, toutes les expressions des processus sont ex\u00e9cut\u00e9es c\u00f4t\u00e9 serveur.
activityInstanceIdDescription=L'<code>id</code> de l'instance d'activit\u00e9 courante. 
loopCounterDescription=Le compteur de boucle pour l'activit\u00e9 courante.
nbActiveInstancesDescription=Le nombre d'instances qui sont actuellement actives, c'est-\u00e0-dire qui ne sont pas encore termin\u00e9es (pour une t\u00e2che s\u00e9quentielle multi-instances, ce sera toujours 1)
nbCompletedInstancesDescription=Le nombre d'instances termin\u00e9s avec succ\u00e8s.
nbInstancesDescription=Le nombre total d'instances
nbTerminatedInstancesDescription=Le nombre d'instances termin\u00e9es, avec succ\u00e8s ou non.
processDefinitionIdDescription=L' <code>id</code> de la d\u00e9finition du processus courant. 
processInstanceIdDescription=L' <code>id</code> de l'instance de processus courante. 
rootProcessInstanceIdDescription=L'<code>id</code> de l'instance de processus racine courant. Si l'instance du processus en cours a \u00e9t\u00e9 instanci\u00e9e par une activit\u00e9 d'appel, l'identifiant de l'instance du processus parent est retourn\u00e9 (r\u00e9cursivement jusqu'\u00e0 l'instance du processus racine).
taskAssigneeIdDescription=The <code>id</code> of the Bonita user assign to the current task.<br/>&\#9888; Warning\: depending on the context a user might not be assigned to the task yet and therefore this variable will return <code>0</code>, which doesn't match to any user. 