userDefinedCatLabel=Utilizador
stringCatLabel=String
numberCatLabel=N\u00famero
otherCatLabel=Outros
collectionCatLabel=Cole\u00e7\u00e3o
groovyScriptRepository=Scripts Groovy
groovyProvidedScriptRepository=Scripts Groovy fornecidos
noDocumentationAvailable = N\u00e3o h\u00e1 documenta\u00e7\u00e3o dispon\u00edvel
errorBuildingJarForGroovyScriptsForProcess=Erro ao construir Jar para scripts Groovy em depend\u00eancias do processo. \nPor favor, verifique os scripts em Desenvolvimento -> Gerenciar scripts Groovy...
errorBuildingJarForProvidedGroovyScriptsForProcess=Erro ao construir Jar para scripts Groovy fornecidos por {0}.
errorBuildingJarForGroovyScriptsFor6xApplication=Erro ao construir Jar para scripts Groovy em depend\u00eancias da Aplica\u00e7\u00e3o 6.x. \nVerifique os scripts em Desenvolvimento -> Groovy...
multiInstanceIteratorDescription=A vari\u00e1vel do iterador para esta tarefa multi-instanciada.
apiAccessorDescription=Vari\u00e1vel Acessor para Bonita APIs.<br/>&\#9888; Apesar da homogeneidade com o Bonita Cliente API, todas as express\u00f5es em processos s\u00e3o executadas no lado do servidor.
activityInstanceIdDescription=O <code>id</code> da inst\u00e2ncia atual da atividade. 
loopCounterDescription=O contador de loop para a atividade do la\u00e7o atual.
nbActiveInstancesDescription=O n\u00famero de inst\u00e2ncias que est\u00e3o atualmente ativas, ou seja, ainda n\u00e3o terminadas (para uma tarefa multi-inst\u00e2ncia sequencial, esta ser\u00e1 sempre 1)
nbCompletedInstancesDescription=O n\u00famero de inst\u00e2ncias terminado com sucesso.
nbInstancesDescription=O n\u00famero total de inst\u00e2ncias
nbTerminatedInstancesDescription=O n\u00famero de inst\u00e2ncias terminou, com sucesso ou n\u00e3o.
processDefinitionIdDescription=A defini\u00e7\u00e3o do processo <code>id</code> do processo atual. 
processInstanceIdDescription=A inst\u00e2ncia de processo <code>id</code> da inst\u00e2ncia atual. 
rootProcessInstanceIdDescription=A inst\u00e2ncia do processo raiz <code>id</code> do processo atual. Se a inst\u00e2ncia do processo atual tiver sido instanciada por uma atividade de chamada, o id de inst\u00e2ncia do processo pai \u00e9 retornado (recursivamente at\u00e9 a inst\u00e2ncia do processo raiz).
taskAssigneeIdDescription=O <code>id</code> do usu\u00e1rio Bonita \u00e9 atribu\u00eddo \u00e0 tarefa atual.<br/>&\#9888; Aviso\: dependendo do contexto um usu\u00e1rio pode n\u00e3o ser atribu\u00eddo \u00e0 tarefa ainda, e portanto esta vari\u00e1vel ir\u00e1 retornar <code>0</code>, que n\u00e3o corresponde a qualquer usu\u00e1rio. 