#X-Generator: crowdin.com
invalidURLTitle=URL inv\u00e1lida
invalidURLMsg=Ha ocurrido un error al abrir el navegador web.
formRepository=P\u00e1ginas
fragmentRepository=Fragmentos
widgetRepository=Widgets personalizados
externalURL=URL externa
targetForm=Formulario de destino
url=URL
pageDoesntExist=Page with id "{0}" does not exist.
formDoesntExist=Form with id "{0}" does not exist.
caseStartFormMappingDescription=Seleccione el tipo de formulario utilizado para crear una instancia del proceso. Edici\u00f3n de suscripci\u00f3n\: con "Live Update", podr\u00e1 actualizar su proceso en caliente para asignar un formulario diferente despu\u00e9s del despliegue.
entryFormMappingDescription=Seleccione el tipo de formulario utilizado para cumplir con el contrato. Edici\u00f3n de suscripci\u00f3n\: con "Live Update", podr\u00e1 actualizar su proceso en caliente para asignar un formulario diferente despu\u00e9s del despliegue.
caseOverviewFormMappingDescription=La p\u00e1gina de resumen aparece en Bonita BPM Portal cuando hace clic en el bot\u00f3n Resumen en la p\u00e1gina Detalles del caso. No hay restricciones sobre la informaci\u00f3n que puede incluir esta p\u00e1gina. Si no se especifica una p\u00e1gina, se proporciona una p\u00e1gina de Resumen de forma predeterminada.
newFormTooltipForPool=Crear o editar un formulario basado en el contrato. Se mapear\u00e1 autom\u00e1ticamente a este proceso.
newFormTooltipForTask=Crear o editar un formulario basado en el contrato. Se mapear\u00e1 autom\u00e1ticamente a esta tarea.
legacyForm=6.x
openUIDesigner=Open UI Designer
uiDesignerLabel=UI Designer
creatingNewForm=Creando nuevo formulario...
switchTypeOfFormQuestionTitle=Formulario incompatible
switchTypeOfFormQuestion=The current form type for this task is {0}. A contract has been defined so you can use the UI Designer to create a form that automatically contains the relevant widgets for the contract inputs. Do you want to use the UI Designer to create a new form?
internalFormMappingUndefined=La asignaci\u00f3n de formulario no se ha definido para {0}.
urlNotDefined=Asignaci\u00f3n de formulario por URL externa se ha definido para {0}.
formDoesntExistAnymoreMessage=The form {0} does not exist anymore. It may have been deleted from UI Designer.
formDoesntExistAnymoreTitle=La formulario {0} ya no existe.
stepUIDesignerInfo=Si a\u00fan no se ha creado el formulario, se recomienda definir el contrato primero. Esto permitir\u00e1 la generaci\u00f3n de un formulario con los widgets relevantes y datos pertinentes para las entradas de contrato. Si no se especifica un formulario, se proporcionar\u00e1 un formulario predeterminado basado en el contrato para fines de desarrollo. Haga clic en el icono de l\u00e1piz para editar el formulario, o utilizar la lista desplegable para asignar un formulario diferente.
processUIDesignerInfo=Si a\u00fan no se ha creado el formulario, se recomienda definir el contrato primero. Esto permitir\u00e1 la generaci\u00f3n de un formulario con los widgets relevantes y datos pertinentes para las entradas de contrato. Si no se especifica un formulario, se proporcionar\u00e1 un formulario predeterminado basado en el contrato para fines de desarrollo. Haga clic en el icono de l\u00e1piz para editar el formulario, o utilizar la lista desplegable para asignar un formulario diferente.
overviewUIDesignerInfo=Haga clic en el icono de l\u00e1piz para crear o editar la p\u00e1gina de Resumen, o utilizar la lista desplegable para asignar una p\u00e1gina diferente.
overviewURLInfo=Especificar la direcci\u00f3n URL de la p\u00e1gina.\nEl processInstanceID se proporciona en la cadena de consulta. Es el valor del par\u00e1metro <id>que se agrega a las URL externas cuando se redirecciona. Otros recursos de la API REST est\u00e1n disponibles para llenar la p\u00e1gina con los valores, en particular un "contexto" (API/bpm/caso/<processInstanceId>/context y API/bpm/archivedCase/<archivedProcessInstanceId>/context) incluyendo referencias a los datos de negocio y documentos.
stepURLInfo=Especificar la direcci\u00f3n URL del formulario. Deber\u00e1 enviar la informaci\u00f3n que cumpla con el contrato llamando a la API/bpm/userTask/<taskInstanceId>/execution. El taskInstanceID se proporciona en la cadena de consulta. Ll valor del par\u00e1metro <id> se agrega a las URL externas cuando se redireciona. Otros recursos de la API REST est\u00e1n disponibles para llenar el formulario con los valores iniciales, en particular un "contexto" (API/bpm/userTask/<taskInstanceId>/context) que incluye un "contrato" (API/bpm/userTask/<taskInstanceId>/contrat) que describe el formato del contrato a cumplir cuando se ejecuta la tarea y referencias de documentos y datos del negocio.
processURLInfo=Especificar la direcci\u00f3n URL del formulario. Se debe devolver la informaci\u00f3n que cumpla con el contrato llamando al API/bpm/process/<processDefinitionId>/instantiation. El processDefinitionID se proporciona en la cadena de consulta. Es el valor del par\u00e1metro <id> que se agrega a las URL externas cuando se redirecciona. Otros recursos de la API REST est\u00e1n disponibles para llenar el formulario con los valores iniciales, en particular un "contexto" (API/bpm/proceso/<processDefinitionId>/context) que incluye un "contrato" (API/bpm/proceso/<processDefinitionId>/contrat) que describe el formato del contrato a cumplir para instanciar el proceso y referencias a documentos y datos del negocio.
overviewLegacyInfo=Ir a la pesta\u00f1a de Aplicaciones 6.x para definir la p\u00e1gina de Resumen.
stepLegacyInfo=Ir a la pesta\u00f1a Aplicaciones 6.x para definir el formulario. El contrato debe estar vac\u00edo.
processLegacyInfo=Ir a la pesta\u00f1a Aplicaciones 6.x para definir el formulario de instanciaci\u00f3n. El contrato debe estar vac\u00edo.
openUiDesignerInformationWindowTitle=UI Designer information
openUiDesignerInformationMessage=You can use the UI Designer to create and modify forms. To create a new form, we recommend that you first create a contract and then use the automatically generated form as your starting point, instead of creating the form from scratch.\nYou can also use the UI Designer to create application pages and custom application layouts.
openUiDesignerInformationToggleMessage=No volver a mostrar este cuadro de di\u00e1logo.
hideEmptyContractDialogTitle=Contrato vac\u00edo
hideEmptyContractDialogMessage=This button generates a form with the relevant widgets and data bindings for the contract inputs. The mapping between the form is and this (task or process \=> 0) is done once for all. It is not updated when you update the contract. We recommend you create your contract before clicking on this button.\nDo you still want to open the UI Designer?
hideEmptyContractDialogToggleMessage=No volver a mostrar este cuadro de di\u00e1logo.
waitingForTomcatServer=El servidor Tomcat est\u00e1 arrancando en segundo plano (esto puede tardar unos segundos)...
noForm=Sin formulario
noFormMessageOnTask=Una tarea humana sin formulario y sin contrato representa una tarea manual, terminada fuera de Bonita BPM. Se indicar\u00e1 el usuario de la aplicaci\u00f3n o Portal que la tarea manual est\u00e1 completa. Una tarea humana con un contrato pero sin formulario espera la informaci\u00f3n necesaria para cumplir con el contrato que se proporcionar\u00e1 mediante programaci\u00f3n (API).
noFormMessageOnProcess=This process will be instantiated programmatically (by a call activity or by an API call from an application, for example), so no form is necessary.\nWhen "No form" is selected, no default instantiation form is generated for testing.\nIf you have defined a contract and want to use the default form for testing, choose the UI Designer option but do not specify a form.

