#X-Generator: crowdin.com
find=Rechercher...
exportAsPdf=Exporter en PDF...
completeImport=Quitter le mode d'import
unknown=Inconnu
name=Nom
elementType=Type d'\u00e9l\u00e9ment
property=Propri\u00e9t\u00e9
reviewed=Revu
information=Description
status=Statut
currentVersion=version actuelle
migrationReportOf=Rapport d''import pour {0}
hideValidStatusAction=Masquer les modifications valides
hideReviewedAction=Masquer les modifications examin\u00e9es
description=Description
okStatusTooltip=Aucune action requise.
warningStatusTooltip=V\u00e9rification requise \: voir description.
errorStatusTooltip=Action requise \: voir description.
yes=Oui
no=Non
noActionRequired=Aucune action requise.
reviewRequired=V\u00e9rification requise.
actionRequired=Actions requises.
completeImportMessage=Vous allez quitter le mode avec rapport d'import. Vous ne serez plus en mesure de le r\u00e9activer. Cliquez sur OK pour quitter, ou annuler pour conserver le rapport d'import.
completeImportToggleMessage=Exporter le rapport d'import
migrationWarningTitle=Informations \u00e0 propos de l'import
doNotDisplayAtNextImport=Ne plus afficher au prochain import
migrationWizardTitle=Informations \u00e0 propos de l'import 5.9/5.10
migrationWizardDescription=Informations concernant l'import de fichiers .bar g\u00e9n\u00e9r\u00e9s avec Bonita Open Studio 5.9/5.10
importWarningMessageContent=La fonction d''import d''un .bar 5.9/5.10 vous aide \u00e0 mettre \u00e0 niveau votre application pour {0} 6.0. Une fois l''import effectu\u00e9, le rapport de situation vous donne l''\u00e9tat et la description de chaque \u00e9l\u00e9ment de votre application. Les d\u00e9finitions de l''\u00e9tat sont \:
importWarningMessageContentAfterPart=La fonction d'importation de processus con\u00e7us avec Bonita 5.9/5.10 (.bar) sera bient\u00f4t am\u00e9lior\u00e9e afin de minimiser l'effort manuel. Pour suivre les \u00e9l\u00e9ments en cours, utilisez la colonne \u00ab Review \u00bb. Lorsque vous avez termin\u00e9 les v\u00e9rifications requises et les modifications, ou lorsque vous n'avez plus besoin de suivre l'\u00e9tat de l'op\u00e9ration d'importation, cliquez sur \u00ab Quitter le mode importation \u00bb.
noActionRequiredHelp=l'\u00e9l\u00e9ment a \u00e9t\u00e9 converti automatiquement et il est op\u00e9rationnel.
actionRequiredHelp=l'\u00e9l\u00e9ment ne peut pas encore \u00eatre converti dans cette version. Vous devez le r\u00e9tablir.
reviewRequiredHelp=l'\u00e9l\u00e9ment a \u00e9t\u00e9 partiellement converti et il n'est pas op\u00e9rationnel en l'\u00e9tat. Vous devez v\u00e9rifier le comportement.
migrating=Migration en cours...

