find=Buscar...
exportAsPdf=Exportar como PDF...
completeImport=Sair do modo de importa\u00e7\u00e3o
unknown=Desconhecido
name=Name
elementType=Tipo de elemento
property=Propriedade
reviewed=Revisado
information=Description
status=Status
currentVersion=vers\u00e3o atual
migrationReportOf=Import report for {0}
hideValidStatusAction=Ocultar altera\u00e7\u00f5es v\u00e1lidas
hideReviewedAction=Ocultar altera\u00e7\u00f5es 
description=Description
okStatusTooltip=Nenhuma a\u00e7\u00e3o necess\u00e1ria.
warningStatusTooltip=Revis\u00e3o necess\u00e1ria\: consulte o painel de descri\u00e7\u00e3o.
errorStatusTooltip=A\u00e7\u00e3o necess\u00e1ria\: consulte o painel de descri\u00e7\u00e3o.
yes=Yes
no=No
noActionRequired=No action required.
reviewRequired=Revis\u00e3o necess\u00e1ria.
actionRequired=A\u00e7\u00e3o necess\u00e1ria.
completeImportMessage=Voc\u00ea est\u00e1 prestes a sair do relat\u00f3rio de importa\u00e7\u00e3o para este diagrama de processo.\nVoc\u00ea n\u00e3o ser\u00e1 capaz de retornar para o relat\u00f3rio de importa\u00e7\u00e3o.\nClique em OK para sair ou cancelar para manter o relat\u00f3rio.
completeImportToggleMessage=Exportar o relat\u00f3rio de status de importa\u00e7\u00e3o
migrationWarningTitle=Importar informa\u00e7\u00f5es
doNotDisplayAtNextImport=N\u00e3o exibir na pr\u00f3xima importa\u00e7\u00e3o
migrationWizardTitle=informa\u00e7\u00f5es de importa\u00e7\u00e3o de arquivo .bar 5.9 ou posterior
migrationWizardDescription=Informa\u00e7\u00f5es sobre importa\u00e7\u00e3o de .bar Bonita Open Studio 5.9 ou posterior
importWarningMessageContent=O recurso de importa\u00e7\u00e3o de arquivo .bar 5.9 ajuda voc\u00ea a atualizar seu aplicativo para ser usado com {0} 6.0. Uma vez que a importa\u00e7\u00e3o \u00e9 processada, o relat\u00f3rio de status lhe d\u00e1 o status e a descri\u00e7\u00e3o de cada elemento do seu aplicativo. As defini\u00e7\u00f5es de status s\u00e3o\:
importWarningMessageContentAfterPart=O recurso de importa\u00e7\u00e3o de 5.9 .bar ser\u00e1 melhorado em breve a fim de minimizar o esfor\u00e7o manual e acelerar a opera\u00e7\u00e3o.Para controlar o elemento que voc\u00ea revisou, voc\u00ea pode usar a coluna "Revis\u00e3o". Quando voc\u00ea tiver conclu\u00eddo as avalia\u00e7\u00f5es necess\u00e1rias e convers\u00f5es, ou quando voc\u00ea n\u00e3o precisa mais acompanhar o status da importa\u00e7\u00e3o, clique em "Sa\u00edr da Importa\u00e7\u00e3o".
noActionRequiredHelp=o elemento foi automaticamente convertido e est\u00e1 operacional.
actionRequiredHelp=o elemento ainda n\u00e3o pode ser convertido nesta vers\u00e3o. Voc\u00ea precisa restabelecer ele.
reviewRequiredHelp=o elemento foi parcialmente convertido e n\u00e3o est\u00e1 completamente operacional. Voc\u00ea deve validar o funcionamento.
migrating=Migrando...

