applicationStoreName=Descritor de Aplica\u00e7\u00e3o
create=Criar
newApplicationDescriptorTitle=Novo Arquivo de Aplicativo
newApplicationDescription=Escolha um nome de arquivo para criar um novo cont\u00eainer de descritor de aplicativo
applicationTokenMessage=Um identificador \u00fanico usado como url ponto de extremidade da aplica\u00e7\u00e3o (../apps/<token>)
alphaNumericOnly=Apenas alfanum\u00e9ricos
deployingLivingApplication=Implantando descritor de aplica\u00e7\u00e3o...
deletingApplication=Excluindo descritor de aplicativo...
open=Abrir
openExistingApplication=Abrir um arquivo de aplicativo existente
openExistingApplicationDescription=Abrir um arquivo de aplicativo existente no seu projeto atual
deleteExistingApplication=Excluir arquivos de aplicativos existentes
deleteExistingApplicationDescription=Excluir arquivos de aplicativos existentes do seu projeto atual
deleteSingleDoneMessage=Arquivos foram apagados.
delete=Excluir
url=URL
export=Exportar
exportApplicationDescriptor=Exportar um arquivo de aplicativo
exportDoneMessage=O arquivo de aplicativo foi exportado com sucesso para '%s'.
importApplicationDescriptorLabel=Selecione um arquivo de aplicativo
importApplicationDescriptor=Importar arquivo do aplicativo
browse=Procurar...
importConflictWarning=Um arquivo com o mesmo nome j\u00e1 existe
importLabel=Importar
notAnApplicationError=Arquivo de aplicativo inv\u00e1lido
importApplicationDescriptorDesc=Selecione um arquivo de aplicativo v\u00e1lido para importar.\nVoc\u00ea pode exportar o arquivo de aplicativo do Portal ou do Studio.
exportOperation=Exportar opera\u00e7\u00e3o
exporting=Exportando %s...
deleteDescriptor='%s' descritor de aplica\u00e7\u00e3o ser\u00e1 removido deste arquivo e exclu\u00eddo do portal.\nConfirmar exclus\u00e3o ? 
deleteDescriptorDone='%s' foi exclu\u00eddo
deleteContainer=Excluir o arquivo %s, com todos os descritores da aplica\u00e7\u00e3o 
applicationInfo=Um arquivo de aplicativo cont\u00e9m um ou v\u00e1rios descritores de aplica\u00e7\u00e3o.\nUma vez que cada aplica\u00e7\u00e3o \u00e9 dedicado a um perfil \u00fanico de usu\u00e1rio, voc\u00ea pode usar este arquivo para agrupar aplica\u00e7\u00f5es no mesmo t\u00f3pico.\n\nExemplo\:\nGerenciar pedidos de licen\u00e7a com Bonita pode ser tratado com um arquivo deste tipo, contendo um descritor da aplica\u00e7\u00e3o para os funcion\u00e1rios, um para gerentes, um para funcion\u00e1rios da HR e um para administradores
applicationDetails=As descri\u00e7\u00f5es da aplica\u00e7\u00e3o possuem meta dados sobre o aplica\u00e7\u00e3o (token de url, nome, vers\u00e3o, perfil do usu\u00e1rio), mas tamb\u00e9m sua navega\u00e7\u00e3o,, bem como links para as p\u00e1ginas que ele precisa acessar.\nEles foram criados no Portal antes de Bonita 7.5 e agora s\u00e3o tratados no Studio para facilitar o empacotamento e implanta\u00e7\u00e3o.\nO Studio n\u00e3o est\u00e1 ciente do que \u00e9 criado no Portal, ent\u00e3o a implanta\u00e7\u00e3o de um descritor de aplica\u00e7\u00e3o pode sobrescrever algum conte\u00fado de Portal.
exportApplicationDescriptorTitle=Exportar
exportApplicationDescriptorMessage=Voc\u00ea est\u00e1 prestes a exportar um arquivo descritor de aplica\u00e7\u00e3o.\nAplica\u00e7\u00e3o(s) Extens\u00f5es REST API, p\u00e1ginas e perfis n\u00e3o fazem parte do arquivo. \nCertifique-se de que j\u00e1 est\u00e3o instalados antes de importar este arquivo no Portal.
menuLevelWarning=Menus de 2+ n\u00edvel n\u00e3o s\u00e3o suportados pela p\u00e1gina de layout padr\u00e3o
applicationDescriptorDeployed='%s' Descritor de Aplica\u00e7\u00e3o implementado
deployExistingApplication=Implantar um descritor de aplica\u00e7\u00e3o existente
selectApplicationToDeploy=Selecione um descritor de aplica\u00e7\u00e3o para implantar.
deployDoneTitle=Status da implanta\u00e7\u00e3o
deployDoneMessage=Status da implanta\u00e7\u00e3o abaixo\:
deployFailedTitle=A implanta\u00e7\u00e3o falhou
deploy=Implantado
nothingToDeploy=Este arquivo de descritor de aplica\u00e7\u00e3o n\u00e3o cont\u00e9m qualquer aplica\u00e7\u00e3o para implantar.
applicationWithoutHomepage=A aplica\u00e7\u00e3o %s n\u00e3o tem uma p\u00e1gina inicial, n\u00e3o pode ser implantado.
applicationWithUnknownHomepage=A aplica\u00e7\u00e3o %s faz refer\u00eancia a uma p\u00e1gina inicial desconhecida, ele n\u00e3o pode ser implantado.
profileNotFound=%s\: Perfil '%s' n\u00e3o encontrado.
layoutNotFound=%s\: Layout '%s' n\u00e3o encontrado.
themeNotFound=%s\: Tema '%s' n\u00e3o encontrado.
applicationPageNotFound=%s\: P\u00e1gina da aplica\u00e7\u00e3o '%s' n\u00e3o encontrada.
appPageTokenNotFound=%s\: Token da p\u00e1gina da aplica\u00e7\u00e3o '%s' n\u00e3o encontrado.
add=Add
addApplicationDescriptorTitle=Add an application descriptor
addApplicationDescriptor=Add an application descriptor
addApplicationDescriptorDesc=Add an application descriptor at the end of the current application file
menu=Menu
applicationPageToken=Token
displayName=Display name
unknownApplicationPage=This application page does not exist in the UI Designer
invalidPageNameFormat=Must be prefixed with 'custompage_' and contains alphanumerics only
applicationPageTokenMustBeUnique=Application page token must be unique
applicationToken=Token da aplica\u00e7\u00e3o
reservedToken='%s' is reserved for internal use
newApplicationDescriptorToken=New application descriptor token
existingApplicationDescriptors=Existing application descriptors
displayNameMessage=Um nome de exibi\u00e7\u00e3o usado no portal de administrador e no layout padr\u00e3o da aplica\u00e7\u00e3o.
version=Version
addNew=Create a new application descriptor
addFromExistingAppDescriptor=Duplicate an existing application descriptor
retrieveBonitaPages=Retrieving default Bonita pages...
deployContributionLabel=Deploy
deployTooltip=Deploy all the application descriptors of this file.
duplicateApplicationDescriptor=Duplicate application descriptor
deleteApplicationDescriptor=Delete application descriptor
deleteFailed=An error occurred while deleting application descriptor '%s'
overview=Overview
navigation=Navigation
navigationSectionDescription=Bind menu to your application pages. Each page must be attached to a unique URL token.
lookNFeel=Look and Feel
previewWarning=This URL is valid only if a home page has been defined
openInWebBrowser=Open in web browser
unknownPageDeployStatus=%s is unknown, it hasn't been deployed
deployingTheme=Deploying theme %s...
description=Description (optional)
profile=Profile
layout=Layout
layoutMessage=You can manually enter a custom layout
theme=Theme
themeMessage=You can manually enter a custom theme id
messageProfile=The required profile to access to this application
redeployAfterRenameTitle=Deploy application descriptor ? 
redeployAfterRenameMessages=You changed the URL of %s. Do you want to re-deploy this application descriptor ? 
undeployFailed=Remove deployed instance failed
emptyProfile=You should bind a profile to your application
unknownProfile=The profile '%s' is unknown.
profileWithSeveralDefinition=The profile %s is defined in several files of profiles. Make sure that the right definition of the profile %s is deployed.
redeployDoneTitle=Deployed instance updated
redeployDoneMessage=The deployed instance of %s has been updated with the new URL.
warningNoTheme=Default theme will be applied if empty
warningNoLayout=Default layout will be applied if empty
unknownCustomLayout=This layout does not exist in the UI Designer. Make sure it will be deployed on the production platform.
unknownCustomTheme=Make sure this custom theme will be deployed on the production platform
orphanPage=Orphan pages
orphanPagesDescription=Not mapped to a menu entry. Navigation to such pages is made through a link from other pages, or an application logo (home page)
homePage=Home page
homePageToken=Home page token
homePageDetails=Token of a page defined above
homePageWarning=Must be defined to enable the application preview
unknownToken=Unknown token
addOrphanPage=Add
remove=Remove
addOnePageMenu=Add one-page menu
setAsHomePage=Set as Home Page
addMultiPageMenu=Add multi-page menu
defaultMenuLabel=My menu
applicationPage=Application Page
addChild= Add submenu
up=\u25b2
down=\u25bc
deployFailed=Deploy application descriptor operation failed, check logs for more details.