#X-Generator: crowdin.com
applicationStoreName=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3
create=\u65b0\u898f\u4f5c\u6210
newApplicationDescriptorTitle=\u65b0\u898f\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3 \u30d5\u30a1\u30a4\u30eb
newApplicationDescription=\u65b0\u3057\u3044\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u8a18\u8ff0\u5b50\u306e\u30b3\u30f3\u30c6\u30ca\u3092\u4f5c\u6210\u3059\u308b\u30d5\u30a1\u30a4\u30eb\u540d\u3092\u9078\u629e\u3057\u307e\u3059\u3002
applicationTokenMessage=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e URL \u30a8\u30f3\u30c9\u30dd\u30a4\u30f3\u30c8\u3068\u3057\u3066\u4f7f\u7528\u3055\u308c\u308b\u30e6\u30cb\u30fc\u30af\u306a\u8b58\u5225\u5b50 (../apps/<token>)
applicationToken=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3 \u30c8\u30fc\u30af\u30f3
version=\u30d0\u30fc\u30b8\u30e7\u30f3
displayName=\u8868\u793a\u540d
displayNameMessage=\u7ba1\u7406\u30dd\u30fc\u30bf\u30eb\u3067\u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3 \u30ec\u30a4\u30a2\u30a6\u30c8\u306b\u4f7f\u7528\u3055\u308c\u308b\u8868\u793a\u540d\u3002
required=\u5fc5\u9808
alphaNumericOnly=\u82f1\u6570\u5b57\u306e\u307f
deployingLivingApplication=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u8a18\u8ff0\u5b50\u3092\u30c7\u30d7\u30ed\u30a4\u4e2d...
deletingApplication=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u8a18\u8ff0\u5b50\u3092\u524a\u9664\u4e2d...
open=\u958b\u304f
openExistingApplication=\u65e2\u5b58\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3 \u30d5\u30a1\u30a4\u30eb\u3092\u958b\u304f
openExistingApplicationDescription=\u73fe\u5728\u306e\u30ea\u30dd\u30b8\u30c8\u30ea\u306e\u65e2\u5b58\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3 \u30d5\u30a1\u30a4\u30eb\u3092\u958b\u304f
deleteExistingApplication=\u65e2\u5b58\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3 \u30d5\u30a1\u30a4\u30eb\u3092\u524a\u9664
deleteExistingApplicationDescription=\u73fe\u5728\u306e\u30ea\u30dd\u30b8\u30c8\u30ea\u304b\u3089\u65e2\u5b58\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3 \u30d5\u30a1\u30a4\u30eb\u3092\u524a\u9664
deleteConfirmation=\u524a\u9664\u306e\u78ba\u8a8d
deleteConfirmationMessage=\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u304b\u3089\u30d5\u30a1\u30a4\u30eb\u3092\u524a\u9664\u3057\u3088\u3046\u3068\u3057\u3066\u3044\u307e\u3059\uff1a\n%s\n\n\u3088\u308d\u3057\u3044\u3067\u3059\u304b\uff1f
deleteDoneMessage=\u30d5\u30a1\u30a4\u30eb\u3092\u524a\u9664\u3057\u307e\u3057\u305f\u3002
deleteSingleDoneMessage=\u30d5\u30a1\u30a4\u30eb\u3092\u524a\u9664\u3057\u307e\u3057\u305f\u3002
deleteDoneTitle=\u524a\u9664\u304c\u5b8c\u4e86
delete=\u524a\u9664
url=URL
export=\u30a8\u30af\u30b9\u30dd\u30fc\u30c8
exportApplicationDescriptor=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3 \u30d5\u30a1\u30a4\u30eb\u3092\u30a8\u30af\u30b9\u30dd\u30fc\u30c8
exportDoneTitle=\u30a8\u30af\u30b9\u30dd\u30fc\u30c8\u5b8c\u4e86
exportDoneMessage=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3 \u30d5\u30a1\u30a4\u30eb\u304c '%s' \u306b\u6b63\u5e38\u306b\u30a8\u30af\u30b9\u30dd\u30fc\u30c8\u3055\u308c\u307e\u3057\u305f\u3002
importApplicationDescriptorLabel=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3 \u30d5\u30a1\u30a4\u30eb\u3092\u9078\u629e
importApplicationDescriptor=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3 \u30d5\u30a1\u30a4\u30eb\u3092\u30a4\u30f3\u30dd\u30fc\u30c8
browse=\u53c2\u7167...
filePathNotEmpty=\u30a4\u30f3\u30dd\u30fc\u30c8\u3059\u308b\u30d5\u30a1\u30a4\u30eb\u3092\u9078\u629e\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
fileDoesntExist=\u3053\u306e\u30d5\u30a1\u30a4\u30eb\u306f\u5b58\u5728\u3057\u307e\u305b\u3093\u3002
failToDeleteFile=\u30d5\u30a1\u30a4\u30eb\u306e\u524a\u9664\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
importConflictWarning=\u540c\u3058\u30d5\u30a1\u30a4\u30eb\u540d\u3092\u6301\u3064\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3 \u30d5\u30a1\u30a4\u30eb\u304c\u65e2\u306b\u5b58\u5728\u3057\u307e\u3059
importLabel=\u30a4\u30f3\u30dd\u30fc\u30c8
notAnApplicationError=\u7121\u52b9\u306a\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3 \u30d5\u30a1\u30a4\u30eb
importApplicationDescriptorDesc=\u30a4\u30f3\u30dd\u30fc\u30c8\u3059\u308b\u6709\u52b9\u306a\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3 \u30d5\u30a1\u30a4\u30eb\u3092\u9078\u629e\u3057\u307e\u3059\u3002\n\u30dd\u30fc\u30bf\u30eb\u3084 Studio \u304b\u3089\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3 \u30d5\u30a1\u30a4\u30eb\u3092\u30a8\u30af\u30b9\u30dd\u30fc\u30c8\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002
fileName=\u30d5\u30a1\u30a4\u30eb\u540d
invalidCharFileName=\u30d5\u30a1\u30a4\u30eb\u540d\u306b '%s' \u306e\u4f7f\u7528\u306f\u8a31\u53ef\u3055\u308c\u3066\u3044\u307e\u305b\u3093
invalidFileName='%s' \u306f\u6709\u52b9\u306a\u30d5\u30a1\u30a4\u30eb\u540d\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002
exportFailedTitle=\u30a8\u30af\u30b9\u30dd\u30fc\u30c8\u306b\u5931\u6557\u3057\u307e\u3057\u305f
exportOperation=\u30a8\u30af\u30b9\u30dd\u30fc\u30c8\u64cd\u4f5c
exporting=%s \u3092\u30a8\u30af\u30b9\u30dd\u30fc\u30c8\u4e2d...
deleteDescriptor='%s' \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u8a18\u8ff0\u5b50\u306f\u3053\u306e\u30d5\u30a1\u30a4\u30eb\u304b\u3089\u524a\u9664\u3055\u308c\u3001\u30dd\u30fc\u30bf\u30eb\u304b\u3089\u3082\u524a\u9664\u3055\u308c\u307e\u3059\u3002\n\u524a\u9664\u3057\u3066\u3044\u3044\u3067\u3059\u304b\uff1f
deleteDescriptorDone='%s' \u306f\u524a\u9664\u3055\u308c\u307e\u3057\u305f\u3002
deleteContainer=\u3059\u3079\u3066\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u8a18\u8ff0\u5b50\u3092\u3067\u30d5\u30a1\u30a4\u30eb %s \u3092\u524a\u9664\u3057\u307e\u3059\u3002
applicationInfo=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3 \u30d5\u30a1\u30a4\u30eb\u306b\u306f\u30011 \u3064\u307e\u305f\u306f\u8907\u6570\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u8a18\u8ff0\u5b50\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002\n\u5404\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306f\u30e6\u30cb\u30fc\u30af\u306a\u30e6\u30fc\u30b6\u30fc \u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u306b\u7279\u5316\u3057\u3066\u3044\u308b\u306e\u3067\u3001\u540c\u3058\u30c6\u30fc\u30de\u3092\u6301\u3064\u8907\u6570\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u675f\u306d\u308b\u306e\u306b\u3053\u306e\u30d5\u30a1\u30a4\u30eb\u3092\u4f7f\u7528\u3067\u304d\u307e\u3059\u3002 \n\n\u305f\u3068\u3048\u3070\uff1a\nBonita BPM \u3092\u4f7f\u7528\u3057\u305f\u4f11\u6687\u7533\u8acb\u306e\u7ba1\u7406\u306f\u3001\u5f93\u696d\u54e1\u7528\u3001\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u7528\u3001\u4eba\u4e8b\u5f79\u54e1\u7528\u3001\u304a\u3088\u3073\u30b7\u30b9\u30c6\u30e0\u7ba1\u7406\u8005\u7528\u3001\u305d\u308c\u305e\u308c\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u8a18\u8ff0\u5b50\u3092\u542b\u3080\uff11\u3064\u306e\u30d5\u30a1\u30a4\u30eb\u3067\u51e6\u7406\u3067\u304d\u307e\u3059\u3002
applicationDetails=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u8a18\u8ff0\u5b50\u306f\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\uff08URL \u30c8\u30fc\u30af\u30f3\u3001\u540d\u524d\u3001\u30d0\u30fc\u30b8\u30e7\u30f3\u3001\u30e6\u30fc\u30b6\u30fc \u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\uff09\u307e\u305f\u305d\u306e\u30ca\u30d3\u30b2\u30fc\u30b7\u30e7\u30f3\u304a\u3088\u3073\u305d\u308c\u306b\u30a2\u30af\u30bb\u30b9\u3059\u308b\u5fc5\u8981\u304c\u3042\u308b\u30da\u30fc\u30b8\u3078\u306e\u30ea\u30f3\u30af\u306b\u3064\u3044\u3066\u306e\u30e1\u30bf \u30c7\u30fc\u30bf\u3092\u4fdd\u6301\u3057\u307e\u3059\u3002\n\u30d1\u30c3\u30b1\u30fc\u30b8\u5316\u3068\u30c7\u30d7\u30ed\u30a4\u3092\u5bb9\u6613\u306b\u3059\u308b\u305f\u3081\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u8a18\u8ff0\u5b50\u3092Bonita BPM 7.5 \u4ee5\u524d\u306b\u30dd\u30fc\u30bf\u30eb\u3067\u4f5c\u6210\u3057\u3001\u73fe\u5728\u3082 Studio \u3067\u51e6\u7406\u3057\u3066\u3044\u308b\u5834\u5408\u3001Studio \u306f\u30dd\u30fc\u30bf\u30eb\u3067\u4f5c\u6210\u3055\u308c\u3066\u3044\u305f\u3053\u3068\u304c\u8a8d\u8b58\u3067\u304d\u306a\u3044\u306e\u3067\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u8a18\u8ff0\u5b50\u3092\u30c7\u30d7\u30ed\u30a4\u3059\u308b\u6642\u306b\u3001\u305d\u308c\u3089\u306e\u3044\u304f\u3064\u304b\u306e\u30dd\u30fc\u30bf\u30eb\u306e\u30b3\u30f3\u30c6\u30f3\u30c4\u306f\u4e0a\u66f8\u304d\u3055\u308c\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
doNotShowMeAgain=\u4eca\u5f8c\u3001\u3053\u306e\u30c0\u30a4\u30a2\u30ed\u30b0\u306f\u8868\u793a\u3057\u306a\u3044
exportApplicationDescriptorTitle=\u30a8\u30af\u30b9\u30dd\u30fc\u30c8
exportApplicationDescriptorMessage=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u8a18\u8ff0\u5b50\u30d5\u30a1\u30a4\u30eb\u3092\u30a8\u30af\u30b9\u30dd\u30fc\u30c8\u3057\u3088\u3046\u3068\u3057\u3066\u3044\u307e\u3059\u3002\n\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3 REST API \u62e1\u5f35\u3001\u30da\u30fc\u30b8\u304a\u3088\u3073\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u306f\u3001\u30d5\u30a1\u30a4\u30eb\u306e\u4e00\u90e8\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002\n\u3053\u306e\u30d5\u30a1\u30a4\u30eb\u3092\u30dd\u30fc\u30bf\u30eb\u306b\u30a4\u30f3\u30dd\u30fc\u30c8\u3059\u308b\u524d\u306b\u3001\u305d\u308c\u3089\u304c\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u6e08\u307f\u3067\u3042\u308b\u304b\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
unparsableXmlFile=Xml \u3092\u89e3\u6790\u3067\u304d\u307e\u305b\u3093\u3002
rename=\u540d\u524d\u3092\u5909\u66f4
renameFile=\u30d5\u30a1\u30a4\u30eb\u540d\u3092\u5909\u66f4
menuLevelWarning=\u30ec\u30d9\u30eb 2 + \u30e1\u30cb\u30e5\u30fc\u306f\u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u30ec\u30a4\u30a2\u30a6\u30c8 \u30da\u30fc\u30b8\u3067\u306f\u30b5\u30dd\u30fc\u30c8\u3057\u3066\u3044\u307e\u305b\u3093\u3002
exportProfile=\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u3092\u30a8\u30af\u30b9\u30dd\u30fc\u30c8
exportProfileDescription=\u73fe\u5728\u306e\u30ea\u30dd\u30b8\u30c8\u30ea\u304b\u3089\u30ab\u30b9\u30bf\u30e0\u307e\u305f\u306f\u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u3092\u30a8\u30af\u30b9\u30dd\u30fc\u30c8

