applicationStoreName=Descripteurs d'application
create=Cr\u00e9er
newApplicationDescriptorTitle=Nouveau fichier d'applications
newApplicationDescription=Choisissez un nom de fichier pour cr\u00e9er un nouveau conteneur de descripteurs d\u2019application
applicationTokenMessage=Un identifiant unique utilis\u00e9 en fin d'URL pour l\u2019application (../apps/<token>)
alphaNumericOnly=Caract\u00e8res alphanum\u00e9riques seulement
deployingLivingApplication=D\u00e9ploiement du descripteur d\u2019application ...
deletingApplication=Suppression du descripteur d\u2019application ...
open=Ouvrir
openExistingApplication=Ouvrir un fichier d\u2019application existant
openExistingApplicationDescription=Ouvrir un fichier d\u2019applications existant dans votre projet courant
deleteExistingApplication=Supprimer un/des fichier(s) d\u2019application existant(s)
deleteExistingApplicationDescription=Supprimer un ou plusieurs fichiers d\u2019applications existants dans votre projet courant
deleteSingleDoneMessage=Le fichier a \u00e9t\u00e9 supprim\u00e9.
delete=Supprimer
url=URL
export=Exporter
exportApplicationDescriptor=Exporter un fichier d\u2019application
exportDoneMessage=Le fichier d\u2019application a \u00e9t\u00e9 export\u00e9 avec succ\u00e8s vers '%s'.
importApplicationDescriptorLabel=S\u00e9lectionnez un fichier d'application
importApplicationDescriptor=Importer un fichier d\u2019application
browse=Parcourir ...
importConflictWarning=Un fichier avec le m\u00eame nom existe d\u00e9j\u00e0
importLabel=Importer
notAnApplicationError=Fichier d\u2019application non valide
importApplicationDescriptorDesc=S\u00e9lectionnez un fichier d'application \u00e0 importer valide. \nVous pouvez exporter un fichier d\u2019application \u00e0 partir du portail ou du studio.
exportOperation=Op\u00e9ration d\u2019exportation
exporting=Exportation de %s ...
deleteDescriptor=Le descripteur d\u2019application %s sera retir\u00e9 de ce fichier et supprim\u00e9 du portail. \nEtes-vous s\u00fbr(e) ? 
deleteDescriptorDone=%s a \u00e9t\u00e9 supprim\u00e9
deleteContainer=Supprimer le fichier %s, avec tous ses descripteurs d'application 
applicationInfo=Un fichier d\u2019application contient un ou plusieurs descripteurs d'applications. \nChaque application \u00e9tant d\u00e9di\u00e9e \u00e0 un unique profil utilisateur, vous pouvez utiliser ce fichier pour grouper des applications appartenant \u00e0 un m\u00eame projet. \n\nExemple\u00a0\: \nCe fichier peut contenir les descripteurs de 4 applications m\u00e9tier de gestion de cong\u00e9s \: salari\u00e9s, managers, ressources humaines et administrateurs
applicationDetails=Le descripteur d\u2019application contient les m\u00e9ta-donn\u00e9es de l\u2019application (token d\u2019url, nom, version, profil utilisateur), mais aussi sa navigation, ainsi que des liens vers les pages qu'elle utilise. \nAvant Bonita 7.5, leur cr\u00e9ation se faisait depuis Bonita Portal. \nDepuis Bonita 7.5, pour faciliter le packaging et le d\u00e9ploiement, elle est possible et recommand\u00e9e dans Bonita Studio.\nD\u00e9ployer des descripteurs depuis le studio \u00e9crase les m\u00eames descripteurs existant sur le portail.
exportApplicationDescriptorTitle=Exporter
exportApplicationDescriptorMessage=Vous allez exporter un fichier de descripteurs d\u2019application. Les profils, les pages et les extensions d\u2019API REST des applications ne font pas partie du fichier. Assurez-vous qu\u2019elles sont d\u00e9j\u00e0 install\u00e9es avant d\u2019importer ce fichier dans le portail.
menuLevelWarning=Les menus de niveau 2 et + ne sont pas support\u00e9s dans le layout par d\u00e9faut
applicationDescriptorDeployed=Le descripteur d'application '%s' a \u00e9t\u00e9 d\u00e9ploy\u00e9
deployExistingApplication=D\u00e9ployer un descripteur d'application existant
selectApplicationToDeploy=S\u00e9lectionner un descripteur d'application \u00e0 d\u00e9ployer.
deployDoneTitle=Statut du d\u00e9ploiement
deployDoneMessage=Statut du d\u00e9ploiement ci-dessous\u00a0\:
deployFailedTitle=Echec du d\u00e9ploiement
deploy=D\u00e9ployer
nothingToDeploy=Ce descripteur d'applications ne contient aucune application \u00e0 d\u00e9ployer.
applicationWithoutHomepage=L'application %s n'a pas de page d'accueil, elle ne peut pas \u00eatre d\u00e9ploy\u00e9e.
applicationWithUnknownHomepage=L'application %s fait r\u00e9f\u00e9rence \u00e0 une page d'accueil inconnue, elle ne peut pas \u00eatre d\u00e9ploy\u00e9e.
profileNotFound=%s \: Profile '%s' introuvable.
layoutNotFound=%s \: Layout '%s' introuvable.
themeNotFound=%s \: Th\u00e8me '%s' introuvable.
applicationPageNotFound=%s \: La page d'application '%s' est introuvable.
appPageTokenNotFound=%s\u00a0\: Token de la page d'application '%s' introuvable.
add=Ajouter
addApplicationDescriptorTitle=Ajouter un descripteur d\u2019application
addApplicationDescriptor=Ajouter un descripteur d\u2019application
addApplicationDescriptorDesc=Ajouter un descripteur d\u2019application \u00e0 la fin du fichier d'application courant
menu=Menu
applicationPageToken=Token
displayName=Nom affich\u00e9
unknownApplicationPage=Cette page d\u2019application n\u2019existe pas dans le UI Designer
invalidPageNameFormat=Doit \u00eatre pr\u00e9fix\u00e9 par 'custompage_' et contenir uniquement des caract\u00e8res alphanum\u00e9riques
applicationPageTokenMustBeUnique=Un Jeton de page d\u2019application doit \u00eatre unique
applicationToken=Token URL de l'application
reservedToken=\u00ab\u00a0%s\u00a0\u00bb est r\u00e9serv\u00e9 \u00e0 un usage interne
newApplicationDescriptorToken=Nouveau token de descripteur d\u2019application
existingApplicationDescriptors=Descripteurs d\u2019application existants
displayNameMessage=Un nom d\u2019affichage, utilis\u00e9 dans le portail administrateur et dans le layout d\u2019application par d\u00e9faut.
version=Version
addNew=Cr\u00e9er un descripteur d\u2019application
addFromExistingAppDescriptor=Dupliquer un descripteur d\u2019application existant
retrieveBonitaPages=R\u00e9cup\u00e9ration des pages Bonita par d\u00e9faut ...
deployContributionLabel=D\u00e9ployer
deployTooltip=D\u00e9ployer tous les descripteurs d'application de ce fichier.
duplicateApplicationDescriptor=Dupliquer le descripteur d\u2019application
deleteApplicationDescriptor=Supprimer le descripteur d\u2019application
deleteFailed=Une erreur s\u2019est produite lors de la suppression du descripteur d\u2019application %s
overview=G\u00e9n\u00e9ral
navigation=Navigation
navigationSectionDescription=Liez le menu aux pages de l'application. Chaque page doit correspondre \u00e0 un token d\u2019URL unique.
lookNFeel=Look and Feel
previewWarning=Valide seulement lorsqu'une page d\u2019accueil est d\u00e9finie
openInWebBrowser=Ouvrir dans le navigateur
unknownPageDeployStatus=%s est inconnue ; elle n\u2019a pas \u00e9t\u00e9 d\u00e9ploy\u00e9e
deployingTheme=D\u00e9ploiement du th\u00e8me %s en cours ...
description=Description (optionnel)
profile=Profils
layout=Layout
layoutMessage=Vous pouvez aussi saisir un layout personnalis\u00e9
theme=\u00a0Th\u00e8me
themeMessage=Vous pouvez aussi saisir l'Id d'un th\u00e8me personnalis\u00e9
messageProfile=Le profil requis pour acc\u00e9der \u00e0 cette application
redeployAfterRenameTitle=D\u00e9ployer le descripteur d\u2019application\u00a0? 
redeployAfterRenameMessages=Vous avez chang\u00e9 l\u2019URL de %s. Vous voulez red\u00e9ployer ce descripteur d\u2019application\u00a0? 
undeployFailed=Echec de la suppression de l'instance d\u00e9ploy\u00e9e
emptyProfile=Vous devriez associer un profil \u00e0 votre application
unknownProfile=Le profil '%s' est inconnu.
profileWithSeveralDefinition=Le profil %s est d\u00e9fini dans plusieurs fichiers de profils. Assurez-vous que la bonne d\u00e9finition du profil %s est d\u00e9ploy\u00e9e.
redeployDoneTitle=L'instance d\u00e9ploy\u00e9e a \u00e9t\u00e9 mise \u00e0 jour
redeployDoneMessage=L\u2019instance d\u00e9ploy\u00e9e de %s a \u00e9t\u00e9 mis \u00e0 jour avec la nouvelle URL.
warningNoTheme=Le th\u00e8me par d\u00e9faut sera appliqu\u00e9 si ce champ est vide
warningNoLayout=Le layout par d\u00e9faut sera appliqu\u00e9 si ce champ est vide
unknownCustomLayout=Ce layout n\u2019existe pas dans le UI Designer. Assurez-vous de sa pr\u00e9sence sur la plate-forme de production.
unknownCustomTheme=Assurez-vous que ce th\u00e8me personnalis\u00e9 sera pr\u00e9sent sur la plate-forme de production
orphanPage=Pages orphelines
orphanPagesDescription=Non r\u00e9f\u00e9renc\u00e9es dans le menu. La navigation vers ces pages se fait par un lien depuis d\u2019autres pages, ou par le logo du layout (page d\u2019accueil)
homePage=Page d'accueil
homePageToken=Token de la page d\u2019accueil
homePageDetails=Token d\u2019une page d\u00e9finie ci-dessus
homePageWarning=Doit \u00eatre d\u00e9finie pour acc\u00e9der \u00e0 l\u2019aper\u00e7u de l\u2019application
unknownToken=Token inconnu
addOrphanPage=Ajout en cours
remove=Supprimer
addOnePageMenu=Ajouter menu \u00e0 page unique
setAsHomePage=D\u00e9finir en tant que page d'accueil
addMultiPageMenu=Ajouter un menu mutli-pages
defaultMenuLabel=Mon menu
applicationPage=Page d'application
addChild= Ajouter un sous-menu
up=\u25b2
down=\u25bc
deployFailed=Le d\u00e9ploiement du descripteur d'application a \u00e9chou\u00e9, consultez les logs pour plus de d\u00e9tails.
preparingThemeUpdate=Preparing theme update...
themeUpdatePreview=Theme update preview...
themeRemovedPreviewMessage=The theme %s (%s) has been removed. 
updatingApplications=Updating applications...
updateApplicationTitle=Application update preview
applicationUpateMessage=Theme has been updated or removed and some applications require to be updated accordingly. You can\:\n  \u2022 Abort\: the extension will be reverted to its previous state\n  \u2022 Ignore the changes. The applications will not be changed and manual update is required\n  \u2022 Proceed with the applications update
themeUpdatePreviewMessage=The theme name has been updated (%s \u2192 %s). 
application=Application
dashboardApplicationDescription=An application is a collection of pages and processes that meets a business need.
applicationZoomHint=Overview of all the application descriptors in the current project.