applicationStoreName=Descripteurs d'application
create=Cr\u00e9er
newApplicationDescriptorTitle=Nouveau fichier d'applications
newApplicationDescription=Choisissez un nom de fichier pour cr\u00e9er un nouveau conteneur de descripteurs d\u2019application
applicationTokenMessage=Un identifiant unique utilis\u00e9 en fin d'URL pour l\u2019application (../apps/<token>)
alphaNumericOnly=Caract\u00e8res alphanum\u00e9riques seulement
deployingLivingApplication=D\u00e9ploiement du descripteur d\u2019application ...
deletingApplication=Suppression du descripteur d\u2019application ...
open=Ouvrir
openExistingApplication=Ouvrir un fichier d\u2019application existant
openExistingApplicationDescription=Ouvrir un fichier d\u2019applications existant dans votre projet courant
deleteExistingApplication=Supprimer un/des fichier(s) d\u2019application existant(s)
deleteExistingApplicationDescription=Supprimer un ou plusieurs fichiers d\u2019applications existants dans votre projet courant
deleteSingleDoneMessage=Le fichier a \u00e9t\u00e9 supprim\u00e9.
delete=Supprimer
url=URL
export=Exporter
exportApplicationDescriptor=Exporter un fichier d\u2019application
exportDoneMessage=Le fichier d\u2019application a \u00e9t\u00e9 export\u00e9 avec succ\u00e8s vers '%s'.
importApplicationDescriptorLabel=S\u00e9lectionnez un fichier d'application
importApplicationDescriptor=Importer un fichier d\u2019application
browse=Parcourir ...
importConflictWarning=Un fichier avec le m\u00eame nom existe d\u00e9j\u00e0
importLabel=Importer
notAnApplicationError=Fichier d\u2019application non valide
importApplicationDescriptorDesc=S\u00e9lectionnez un fichier d'application \u00e0 importer valide. \nVous pouvez exporter un fichier d\u2019application \u00e0 partir du portail ou du studio.
exportOperation=Op\u00e9ration d\u2019exportation
exporting=Exportation de %s ...
deleteDescriptor=Le descripteur d\u2019application %s sera retir\u00e9 de ce fichier et supprim\u00e9 du portail. \nEtes-vous s\u00fbr(e) ? 
deleteDescriptorDone=%s a \u00e9t\u00e9 supprim\u00e9
deleteContainer=Supprimer le fichier %s, avec tous ses descripteurs d'application 
applicationInfo=Un fichier d\u2019application contient un ou plusieurs descripteurs d'applications. \nChaque application \u00e9tant d\u00e9di\u00e9e \u00e0 un unique profil utilisateur, vous pouvez utiliser ce fichier pour grouper des applications appartenant \u00e0 un m\u00eame projet. \n\nExemple\u00a0\: \nCe fichier peut contenir les descripteurs de 4 applications m\u00e9tier de gestion de cong\u00e9s \: salari\u00e9s, managers, ressources humaines et administrateurs
applicationDetails=Le descripteur d\u2019application contient les m\u00e9ta-donn\u00e9es de l\u2019application (token d\u2019url, nom, version, profil utilisateur), mais aussi sa navigation, ainsi que des liens vers les pages qu'elle utilise. \nAvant Bonita 7.5, leur cr\u00e9ation se faisait depuis Bonita Portal. \nDepuis Bonita 7.5, pour faciliter le packaging et le d\u00e9ploiement, elle est possible et recommand\u00e9e dans Bonita Studio.\nD\u00e9ployer des descripteurs depuis le studio \u00e9crase les m\u00eames descripteurs existant sur le portail.
exportApplicationDescriptorTitle=Exporter
exportApplicationDescriptorMessage=Vous allez exporter un fichier de descripteurs d\u2019application. Les profils, les pages et les extensions d\u2019API REST des applications ne font pas partie du fichier. Assurez-vous qu\u2019elles sont d\u00e9j\u00e0 install\u00e9es avant d\u2019importer ce fichier dans le portail.
menuLevelWarning=Les menus de niveau 2 et + ne sont pas support\u00e9s dans le layout par d\u00e9faut
applicationDescriptorDeployed=Le descripteur d'application '%s' a \u00e9t\u00e9 d\u00e9ploy\u00e9
deployExistingApplication=D\u00e9ployer un descripteur d'application existant
selectApplicationToDeploy=S\u00e9lectionner un descripteur d'application \u00e0 d\u00e9ployer.
deployDoneTitle=Statut du d\u00e9ploiement
deployDoneMessage=Statut du d\u00e9ploiement ci-dessous\u00a0\:
deployFailedTitle=Echec du d\u00e9ploiement
deploy=D\u00e9ployer
nothingToDeploy=Ce descripteur d'applications ne contient aucune application \u00e0 d\u00e9ployer.
applicationWithoutHomepage=L'application %s n'a pas de page d'accueil, elle ne peut pas \u00eatre d\u00e9ploy\u00e9e.
applicationWithUnknownHomepage=L'application %s fait r\u00e9f\u00e9rence \u00e0 une page d'accueil inconnue, elle ne peut pas \u00eatre d\u00e9ploy\u00e9e.
profileNotFound=%s \: Profile '%s' introuvable.
layoutNotFound=%s \: Layout '%s' introuvable.
themeNotFound=%s \: Th\u00e8me '%s' introuvable.
applicationPageNotFound=%s \: La page d'application '%s' est introuvable.
appPageTokenNotFound=%s\u00a0\: Token de la page d'application '%s' introuvable.
add=Add
addApplicationDescriptorTitle=Add an application descriptor
addApplicationDescriptor=Add an application descriptor
addApplicationDescriptorDesc=Add an application descriptor at the end of the current application file
menu=Menu
applicationPageToken=Token
displayName=Nom affich\u00e9
unknownApplicationPage=This application page does not exist in the UI Designer
invalidPageNameFormat=Must be prefixed with 'custompage_' and contains alphanumerics only
applicationPageTokenMustBeUnique=Application page token must be unique
applicationToken=Token URL de l'application
reservedToken='%s' is reserved for internal use
newApplicationDescriptorToken=New application descriptor token
existingApplicationDescriptors=Existing application descriptors
displayNameMessage=Un nom d\u2019affichage, utilis\u00e9 dans le portail administrateur et dans le layout d\u2019application par d\u00e9faut.
version=Version
addNew=Create a new application descriptor
addFromExistingAppDescriptor=Duplicate an existing application descriptor
retrieveBonitaPages=Retrieving default Bonita pages...
deployContributionLabel=Deploy
deployTooltip=Deploy all the application descriptors of this file.
duplicateApplicationDescriptor=Duplicate application descriptor
deleteApplicationDescriptor=Delete application descriptor
deleteFailed=An error occurred while deleting application descriptor '%s'
overview=Overview
navigation=Navigation
navigationSectionDescription=Bind menu to your application pages. Each page must be attached to a unique URL token.
lookNFeel=Look and Feel
previewWarning=This URL is valid only if a home page has been defined
openInWebBrowser=Open in web browser
unknownPageDeployStatus=%s is unknown, it hasn't been deployed
deployingTheme=Deploying theme %s...
description=Description (optional)
profile=Profile
layout=Layout
layoutMessage=You can manually enter a custom layout
theme=Theme
themeMessage=You can manually enter a custom theme id
messageProfile=The required profile to access to this application
redeployAfterRenameTitle=Deploy application descriptor ? 
redeployAfterRenameMessages=You changed the URL of %s. Do you want to re-deploy this application descriptor ? 
undeployFailed=Remove deployed instance failed
emptyProfile=You should bind a profile to your application
unknownProfile=The profile '%s' is unknown.
profileWithSeveralDefinition=The profile %s is defined in several files of profiles. Make sure that the right definition of the profile %s is deployed.
redeployDoneTitle=Deployed instance updated
redeployDoneMessage=The deployed instance of %s has been updated with the new URL.
warningNoTheme=Default theme will be applied if empty
warningNoLayout=Default layout will be applied if empty
unknownCustomLayout=This layout does not exist in the UI Designer. Make sure it will be deployed on the production platform.
unknownCustomTheme=Make sure this custom theme will be deployed on the production platform
orphanPage=Orphan pages
orphanPagesDescription=Not mapped to a menu entry. Navigation to such pages is made through a link from other pages, or an application logo (home page)
homePage=Home page
homePageToken=Home page token
homePageDetails=Token of a page defined above
homePageWarning=Must be defined to enable the application preview
unknownToken=Unknown token
addOrphanPage=Add
remove=Remove
addOnePageMenu=Add one-page menu
setAsHomePage=Set as Home Page
addMultiPageMenu=Add multi-page menu
defaultMenuLabel=My menu
applicationPage=Application Page
addChild= Add submenu
up=\u25b2
down=\u25bc