applicationStoreName=Descriptores de aplicaci\u00f3n
create=Crear
newApplicationDescriptorTitle=Nuevo archivo de aplicaci\u00f3n
newApplicationDescription=Elija un nombre de archivo para crear un nuevo contenedor de descriptores de aplicaci\u00f3n
applicationTokenMessage=Un identificador \u00fanico utilizado como punto final de la url de la aplicaci\u00f3n (.../apps/<token>)
alphaNumericOnly=S\u00f3lo caracteres alfanum\u00e9ricos
deployingLivingApplication=Desplegando el descriptor de aplicaci\u00f3n...
deletingApplication=Eliminando el descriptor de aplicaci\u00f3n...
open=Abrir
openExistingApplication=Abrir un archivo de aplicaci\u00f3n existente
openExistingApplicationDescription=Abrir un archivo de aplicaci\u00f3n existente en el proyecto actual
deleteExistingApplication=Eliminar los archivos de aplicaci\u00f3n existentes
deleteExistingApplicationDescription=Eliminar los archivos de aplicaci\u00f3n existentes del proyecto actual
deleteSingleDoneMessage=El archivo ha sido borrado.
delete=Eliminar
url=URL
export=Exportar
exportApplicationDescriptor=Exportar un archivo de aplicaci\u00f3n
exportDoneMessage=El archivo de la aplicaci\u00f3n ha sido exportado exitosamente a %s.
importApplicationDescriptorLabel=Seleccione un archivo de aplicaci\u00f3n
importApplicationDescriptor=Importar un archivo de aplicaci\u00f3n
browse=Examinar...
importConflictWarning=Ya existe un archivo con el mismo nombre
importLabel=Importar
notAnApplicationError=Archivo de aplicaci\u00f3n inv\u00e1lido
importApplicationDescriptorDesc=Seleccione un archivo de aplicaci\u00f3n v\u00e1lido para importar.\nPuede exportar un archivo de aplicaci\u00f3n desde el Portal o desde el Studio.
exportOperation=Operaci\u00f3n de exportaci\u00f3n
exporting=Exportando %s...
deleteDescriptor=El descriptor de aplicaci\u00f3n '%s' se eliminar\u00e1 de este archivo y ser\u00e1 suprimido del portal. \u00bfConfirmar supresi\u00f3n? 
deleteDescriptorDone='%s' ha sido borrado
deleteContainer=Eliminar el archivo %s, con todos sus descriptores de aplicaci\u00f3n 
applicationInfo=Un archivo de aplicaci\u00f3n contiene uno o varios descriptores de aplicaci\u00f3n.\nPuesto que cada aplicaci\u00f3n est\u00e1 dedicada a un perfil de usuario \u00fanico, puede utilizar este archivo para agrupar aplicaciones sobre el mismo tema.\n\nEjemplo\:\nUn archivo de este tipo puede contener 4 descriptores de aplicaci\u00f3n para gestionar las vacaciones de los distintos tipos de trabajadores de una empresa\: uno para los empleados, uno para los gerentes, uno para los recursos humanos y uno para los administradores
applicationDetails=Los descriptores de aplicaci\u00f3n contienen metadatos acerca de la aplicaci\u00f3n (token url, nombre, versi\u00f3n, perfil de usuario), pero tambi\u00e9n su navegaci\u00f3n, as\u00ed como enlaces a las p\u00e1ginas a las que necesita acceder.\nFueron creados en el Portal antes de Bonita 7.5 y ahora se gestionan en el Studio para facilitar el empaquetado y el despliegue.\nEl Studio no lee lo que se crea en el Portal, por lo que el despliegue de un descriptor de aplicaci\u00f3n puede sobrescribir algunos contenidos del Portal.
exportApplicationDescriptorTitle=Exportar
exportApplicationDescriptorMessage=Est\u00e1 a punto de exportar un archivo de descriptor de aplicaci\u00f3n. \nLos perfiles, p\u00e1ginas y extensiones de API REST de las aplicaciones no forman parte del archivo. Aseg\u00farese de que ya est\u00e9n instalados antes de importar este archivo en el Portal.
menuLevelWarning=Los men\u00fas de nivel 2+ no est\u00e1n soportados en la p\u00e1gina de layout por defecto
applicationDescriptorDeployed=Descriptor de aplicaci\u00f3n '%s' desplegado
deployExistingApplication=Desplegar un descriptor de aplicaci\u00f3n existente
selectApplicationToDeploy=Seleccione un descriptor de aplicaci\u00f3n para desplegar.
deployDoneTitle=Estado del despliegue
deployDoneMessage=Estado del despliegue aqu\u00ed abajo\:
deployFailedTitle=El despliegue ha fallecido
deploy=Desplegar
nothingToDeploy=Este archivo descriptor de la aplicaci\u00f3n no contiene ninguna aplicaci\u00f3n para desplegar.