applicationStoreName=Descriptores de aplicaci\u00f3n
create=Crear
newApplicationDescriptorTitle=Nuevo archivo de aplicaci\u00f3n
newApplicationDescription=Elija un nombre de archivo para crear un nuevo contenedor de descriptores de aplicaci\u00f3n
applicationTokenMessage=Un identificador \u00fanico utilizado como punto final de la url de la aplicaci\u00f3n (.../apps/<token>)
alphaNumericOnly=S\u00f3lo caracteres alfanum\u00e9ricos
deployingLivingApplication=Desplegando el descriptor de aplicaci\u00f3n...
deletingApplication=Eliminando el descriptor de aplicaci\u00f3n...
open=Abrir
openExistingApplication=Abrir un archivo de aplicaci\u00f3n existente
openExistingApplicationDescription=Abrir un archivo de aplicaci\u00f3n existente en el proyecto actual
deleteExistingApplication=Eliminar los archivos de aplicaci\u00f3n existentes
deleteExistingApplicationDescription=Eliminar los archivos de aplicaci\u00f3n existentes del proyecto actual
deleteSingleDoneMessage=El archivo ha sido borrado.
delete=Eliminar
url=URL
export=Exportar
exportApplicationDescriptor=Exportar un archivo de aplicaci\u00f3n
exportDoneMessage=El archivo de la aplicaci\u00f3n ha sido exportado exitosamente a %s.
importApplicationDescriptorLabel=Seleccione un archivo de aplicaci\u00f3n
importApplicationDescriptor=Importar un archivo de aplicaci\u00f3n
browse=Examinar...
importConflictWarning=Ya existe un archivo con el mismo nombre
importLabel=Importar
notAnApplicationError=Archivo de aplicaci\u00f3n inv\u00e1lido
importApplicationDescriptorDesc=Seleccione un archivo de aplicaci\u00f3n v\u00e1lido para importar.\nPuede exportar un archivo de aplicaci\u00f3n desde el Portal o desde el Studio.
exportOperation=Operaci\u00f3n de exportaci\u00f3n
exporting=Exportando %s...
deleteDescriptor=El descriptor de aplicaci\u00f3n '%s' se eliminar\u00e1 de este archivo y ser\u00e1 suprimido del portal. \u00bfConfirmar supresi\u00f3n? 
deleteDescriptorDone='%s' ha sido borrado
deleteContainer=Eliminar el archivo %s, con todos sus descriptores de aplicaci\u00f3n 
applicationInfo=Un archivo de aplicaci\u00f3n contiene uno o varios descriptores de aplicaci\u00f3n.\nPuesto que cada aplicaci\u00f3n est\u00e1 dedicada a un perfil de usuario \u00fanico, puede utilizar este archivo para agrupar aplicaciones sobre el mismo tema.\n\nEjemplo\:\nUn archivo de este tipo puede contener 4 descriptores de aplicaci\u00f3n para gestionar las vacaciones de los distintos tipos de trabajadores de una empresa\: uno para los empleados, uno para los gerentes, uno para los recursos humanos y uno para los administradores
applicationDetails=Los descriptores de aplicaci\u00f3n contienen metadatos acerca de la aplicaci\u00f3n (token url, nombre, versi\u00f3n, perfil de usuario), pero tambi\u00e9n su navegaci\u00f3n, as\u00ed como enlaces a las p\u00e1ginas a las que necesita acceder.\nFueron creados en el Portal antes de Bonita 7.5 y ahora se gestionan en el Studio para facilitar el empaquetado y el despliegue.\nEl Studio no lee lo que se crea en el Portal, por lo que el despliegue de un descriptor de aplicaci\u00f3n puede sobrescribir algunos contenidos del Portal.
exportApplicationDescriptorTitle=Exportar
exportApplicationDescriptorMessage=Est\u00e1 a punto de exportar un archivo de descriptor de aplicaci\u00f3n. \nLos perfiles, p\u00e1ginas y extensiones de API REST de las aplicaciones no forman parte del archivo. Aseg\u00farese de que ya est\u00e9n instalados antes de importar este archivo en el Portal.
menuLevelWarning=Los men\u00fas de nivel 2+ no est\u00e1n soportados en la p\u00e1gina de layout por defecto
applicationDescriptorDeployed=Descriptor de aplicaci\u00f3n '%s' desplegado
deployExistingApplication=Desplegar un descriptor de aplicaci\u00f3n existente
selectApplicationToDeploy=Seleccione un descriptor de aplicaci\u00f3n para desplegar.
deployDoneTitle=Estado del despliegue
deployDoneMessage=Estado del despliegue aqu\u00ed abajo\:
deployFailedTitle=El despliegue ha fallecido
deploy=Desplegar
nothingToDeploy=Este archivo descriptor de la aplicaci\u00f3n no contiene ninguna aplicaci\u00f3n para desplegar.
applicationWithoutHomepage=La aplicaci\u00f3n %s no tiene una p\u00e1gina de inicio, no puede ser desplegada.
applicationWithUnknownHomepage=La aplicaci\u00f3n %s hace referencia a una p\u00e1gina de inicio desconocida, no puede ser desplegada.
profileNotFound=%s\: Perfil '%s' no encontrado.
layoutNotFound=%s\: Layout '%s' no encontrado.
themeNotFound=%s\: Tema '%s' no encontrado.
applicationPageNotFound=%s\: P\u00e1gina de aplicaci\u00f3n '%s' no encontrada.
appPageTokenNotFound=%s\: Token de p\u00e1gina de aplicaci\u00f3n '%s' no encontrado.
add=A\u00f1adir
addApplicationDescriptorTitle=A\u00f1adir un descriptor de aplicaci\u00f3n
addApplicationDescriptor=A\u00f1adir un descriptor de aplicaci\u00f3n
addApplicationDescriptorDesc=A\u00f1adir un descriptor de aplicaci\u00f3n al final del archivo de aplicaci\u00f3n actual
menu=Men\u00fa
applicationPageToken=Token
displayName=T\u00edtulo din\u00e1mico
unknownApplicationPage=Esta p\u00e1gina de aplicaci\u00f3n no existe en el UI Designer
invalidPageNameFormat=Debe ser precedido de 'custompage_' y contiene s\u00f3lo caracteres alfanum\u00e9ricos
applicationPageTokenMustBeUnique=El token de la p\u00e1gina de aplicaci\u00f3n debe ser \u00fanico
applicationToken=Token de la aplicaci\u00f3n
reservedToken='%s' est\u00e1 reservado para uso interno
newApplicationDescriptorToken=Nuevo token del descriptor de aplicaci\u00f3n
existingApplicationDescriptors=Descriptores de aplicaci\u00f3n existentes
displayNameMessage=Un nombre a mostrar, utilizado en el portal de administraci\u00f3n y en el layout de aplicaci\u00f3n por defecto.
version=Versi\u00f3n
addNew=Crear un nuevo descriptor de aplicaci\u00f3n
addFromExistingAppDescriptor=Duplicar un descriptor de aplicaci\u00f3n existente
retrieveBonitaPages=Recuperando p\u00e1ginas de Bonita por defecto...
deployContributionLabel=Desplegar
deployTooltip=Desplegar todos los descriptores de aplicaci\u00f3n de este archivo.
duplicateApplicationDescriptor=Duplicar el descriptor de aplicaci\u00f3n
deleteApplicationDescriptor=Eliminar un descriptor de aplicaci\u00f3n
deleteFailed=Se ha producido un error al eliminar el descriptor de la aplicaci\u00f3n '%s'
overview=Formulario Resumen
navigation=Navegaci\u00f3n
navigationSectionDescription=Enlazar men\u00fa a las p\u00e1ginas de su aplicaci\u00f3n. Cada p\u00e1gina debe estar adjunta a un token de URL \u00fanico.
lookNFeel=Look and Feel
previewWarning=Esta URL es v\u00e1lida s\u00f3lo si se ha definido una p\u00e1gina de inicio
openInWebBrowser=Abrir en el navegador
unknownPageDeployStatus=%s es desconocido, no ha sido desplegado
deployingTheme=Desplegando tema %s...
description=Descripci\u00f3n (opcional)
profile=Perfil
layout=Layout
layoutMessage=Puede introducir manualmente un layout personalizado
theme=Tema
themeMessage=Puede introducir manualmente un id de tema personalizado
messageProfile=El perfil requerido para acceder a esta aplicaci\u00f3n
redeployAfterRenameTitle=\u00bfDesplegar el descriptor de aplicaci\u00f3n? 
redeployAfterRenameMessages=Ha cambiado la URL de %s. \u00bfDesea volver a desplegar este descriptor de aplicaci\u00f3n? 
undeployFailed=Error al eliminar la instancia desplegada
emptyProfile=Debes vincular un perfil a tu aplicaci\u00f3n
unknownProfile=El perfil '%s' es desconocido.
profileWithSeveralDefinition=El perfil %s est\u00e1 definido en varios archivos de perfiles. Aseg\u00farese de que la definici\u00f3n del perfil %s desplegada es la correcta.
redeployDoneTitle=Instancia desplegada actualizada
redeployDoneMessage=La instancia desplegada de %s ha sido actualizada con la nueva direcci\u00f3n URL.
warningNoTheme=Si este campo est\u00e1 vac\u00edo, se aplicar\u00e1 el tema por defecto
warningNoLayout=Si este campo est\u00e1 vac\u00edo, se aplicar\u00e1 el layout por defecto
unknownCustomLayout=Este layout no existe en el UI Designer. Aseg\u00farese de que est\u00e9 desplegado en la plataforma de producci\u00f3n.
unknownCustomTheme=Aseg\u00farese de que este tema personalizado est\u00e9 desplegado en la plataforma de producci\u00f3n
orphanPage=P\u00e1ginas hu\u00e9rfanas
orphanPagesDescription=No mapeado a ninguna entrada de men\u00fa. La navegaci\u00f3n a este tipo de p\u00e1ginas se realiza a trav\u00e9s de un enlace desde otras p\u00e1ginas, o un logotipo de la aplicaci\u00f3n (p\u00e1gina de inicio)
homePage=P\u00e1gina de inicio
homePageToken=Token de la p\u00e1gina de inicio
homePageDetails=Token de una p\u00e1gina definida anteriormente
homePageWarning=Debe definirse para habilitar la vista previa de la aplicaci\u00f3n
unknownToken=Token desconocido
addOrphanPage=A\u00f1adir
remove=Suprimir
addOnePageMenu=A\u00f1adir men\u00fa de una p\u00e1gina
setAsHomePage=Establecer como p\u00e1gina de inicio
addMultiPageMenu=A\u00f1adir men\u00fa de varias p\u00e1ginas
defaultMenuLabel=Mi men\u00fa
applicationPage=P\u00e1gina de aplicaci\u00f3n
addChild= Agregar submen\u00fa
up=\u25b2
down=\u25bc
deployFailed=Error al desplegar la operaci\u00f3n del descriptor de la aplicaci\u00f3n, compruebe el fichero de log para m\u00e1s detalles.
preparingThemeUpdate=Preparando actualizaci\u00f3n del tema...
themeUpdatePreview=Vista previa de actualizaci\u00f3n de tema...
themeRemovedPreviewMessage=El tema %s (%s) ha sido eliminado. 
updatingApplications=Actualizando aplicaciones...
updateApplicationTitle=Vista previa de actualizaci\u00f3n de la aplicaci\u00f3n
applicationUpateMessage=El tema ha sido actualizado o eliminado y algunas aplicaciones necesitan ser actualizadas en consecuencia. Puedes\:\n  \u2022 Abortar\: la extensi\u00f3n ser\u00e1 revertida a su estado anterior\n  \u2022 Ignorar los cambios. Las aplicaciones no se cambiar\u00e1n y la actualizaci\u00f3n manual es necesaria\n  \u2022 Proceda con la actualizaci\u00f3n de las aplicaciones
themeUpdatePreviewMessage=El nombre del tema ha sido actualizado (%s \u2192 %s). 
application=Aplicaci\u00f3n
overviewApplicationDescription=Una aplicaci\u00f3n es una colecci\u00f3n de p\u00e1ginas y procesos que satisfacen las necesidades de negocio.
applicationZoomHint=Resumen de todos los descriptores de la aplicaci\u00f3n en el proyecto actual.
applicationDescriptorCardTitle=Descriptor de la aplicaci\u00f3n