#X-Generator: crowdin.com
invalidURLTitle=URL invalide
invalidURLMsg=Une erreur s'est produite \u00e0 l'ouverture d'un navigateur web.
formRepository=Pages
fragmentRepository=Fragments
widgetRepository=Widgets personnalis\u00e9s
externalURL=URL externe
targetForm=Formulaire cible
url=URL
pageDoesntExists=La page \u00ab{0} \u00bb n'existe pas.
caseStartFormMappingDescription=S\u00e9lectionnez le type de formulaire utilis\u00e9 pour instancier le processus.
entryFormMappingDescription=S\u00e9lectionnez le type de formulaire utilis\u00e9 pour remplir le contrat.
caseOverviewFormMappingDescription=La page de synth\u00e8se s'affiche dans le Bonita BPM Portal lorsque vous cliquez sur le bouton Page de synth\u00e8se dans la page de d\u00e9tails du cas. Il n'y a aucune restriction sur les informations que cette page peut contenir. Si vous ne sp\u00e9cifiez pas de page, une page de synth\u00e8se par d\u00e9faut est fournie.
newFormTooltipForPool=Cr\u00e9ez ou modifiez un formulaire bas\u00e9 sur le contrat. Il sera automatiquement associ\u00e9 \u00e0 ce pool.
newFormTooltipForTask=Cr\u00e9ez ou modifiez un formulaire bas\u00e9 sur le contrat. Il sera automatiquement associ\u00e9 \u00e0 cette t\u00e2che.
legacyForm=Formulaire 6.x
openUIDesigner=Ouvrir le UI designer
uiDesignerLabel=UI designer
creatingNewForm=Cr\u00e9ation d'un nouveau formulaire...
switchTypeOfFormQuestionTitle=Incompatibilit\u00e9 de type de formulaire
switchTypeOfFormQuestion=Le type de formulaire actuel pour cette t\u00e2che est {0}. Un contrat a \u00e9t\u00e9 d\u00e9fini de sorte que vous puissiez utiliser le UI Designer pour cr\u00e9er un formulaire qui contient automatiquement les widgets et variables en lien avec les inputs de contrat. Voulez-vous utiliser le UI Designer pour cr\u00e9er un formulaire ?
internalFormMappingUndefined=Le mapping des formulaires internes n'est pas d\u00e9fini pour {0}.
formDoesntExistAnymoreMessage=Le formulaire {0} n'existe plus. Il a peut-\u00eatre \u00e9t\u00e9 supprim\u00e9 du UI Designer.
formDoesntExistAnymoreTitle=Le formulaire {0} n'existe plus.
stepUIDesignerInfo=Si le formulaire n'a pas encore \u00e9t\u00e9 cr\u00e9\u00e9, d\u00e9finissez d'abord le contrat de la t\u00e2che. Cela permettra de g\u00e9n\u00e9rer un formulaire contenant les widgets et donn\u00e9es en lien avec le contrat. Si vous ne cr\u00e9ez pas de formulaire, un formulaire par d\u00e9faut bas\u00e9 sur le contrat est fourni \u00e0 des fins de d\u00e9veloppement. Cliquez sur l'icon crayon pour modifier le formulaire, ou utilisez la liste d\u00e9roulante pour associer un autre formulaire.
processUIDesignerInfo=Si le formulaire n'a pas encore \u00e9t\u00e9 cr\u00e9\u00e9, d\u00e9finissez d'abord le contrat du processus. Cela permettra de g\u00e9n\u00e9rer un formulaire contenant les widgets et les donn\u00e9es en lien avec le contrat. Si vous ne cr\u00e9ez pas de formulaire, un formulaire par d\u00e9faut bas\u00e9 sur le contrat est fourni \u00e0 des fins de d\u00e9veloppement. Cliquez sur l'icon crayon pour modifier le formulaire, ou utilisez la liste d\u00e9roulante pour associer un autre formulaire.
overviewUIDesignerInfo=Cliquez sur l'icon crayon pour cr\u00e9er ou modifier la page de synth\u00e8se, ou utilisez la liste d\u00e9roulante pour associer une autre page.
overviewURLInfo=Sp\u00e9cifiez l'URL de la page. \nLe processInstanceID est fourni dans la cha\u00eene de requ\u00eate. C'est la valeur du param\u00e8tre <id>qui est ajout\u00e9e \u00e0 l'URL externe lors de la redirection. D'autres ressources de l'API REST sont disponibles pour remplir la page avec des valeurs, notamment un "contexte" (API/bpm/case/<processInstanceId>/context et API/bpm/archivedCase/<archivedProcessInstanceId>/contexte) qui contient les r\u00e9f\u00e9rences des donn\u00e9es m\u00e9tier et des documents.
stepURLInfo=Sp\u00e9cifiez l'URL du formulaire. \nElle doit envoyer des informations qui remplissent le contrat en appelant API/bpm/userTask/<taskInstanceId>/execution. La taskInstanceID est fournie dans la cha\u00eene de la requ\u00eate. C'est la valeur du param\u00e8tre <id> qui est ajout\u00e9 \u00e0 l'URL externe lors de la redirection. D'autres ressources de l'API REST sont disponibles pour remplir le formulaire avec des valeurs initiales, notamment un "contexte" (API/bpm/userTask/<taskInstanceId>/context) qui comprend les r\u00e9f\u00e9rences des donn\u00e9es m\u00e9tiers et des documents, et un "contrat" (API/bpm/userTask/<taskInstanceId>/contract) qui d\u00e9crit le format du contrat \u00e0 remplir lors de l'ex\u00e9cution de la t\u00e2che.
processURLInfo=Sp\u00e9cifiez l'URL du formulaire. \nElle doit renvoyer des informations qui remplissent le contrat en appelant l'API/bpm/processus/<processDefinitionId>/instanciation. La processDefinitionID est fournie dans la cha\u00eene de la requ\u00eate. C'est la valeur du param\u00e8tre <id> qui est ajout\u00e9e \u00e0 l'URL externe lors de la redirection. D'autres ressources de l'API REST sont disponibles pour remplir le formulaire avec des valeurs initiales, notamment un "contexte" (API/bpm/processus/<processDefinitionId>/context) qui comprend les r\u00e9f\u00e9rences des donn\u00e9es m\u00e9tiers et  des documents et un "contrat" (API/bpm/processus/<processDefinitionId>/contract) qui d\u00e9crit le format du contrat \u00e0 remplir lors de l'instanciation du processus.
overviewLegacyInfo=Consultez l'onglet 6.x Application pour d\u00e9finir la page d'aper\u00e7u.
stepLegacyInfo=Consultez l'onglet 6.x Application pour d\u00e9finir le formulaire de la t\u00e2che. Le contrat doit \u00eatre vide.
processLegacyInfo=Consultez l'onglet 6.x Application pour d\u00e9finir le pageflow de r\u00e9sum\u00e9. Le contrat doit \u00eatre vide.
openUiDesignerInformationWindowTitle=UI Designer \: Informations
openUiDesignerInformationMessage=Vous pouvez utiliser le UI Designer pour cr\u00e9er et modifier vos formulaires. Pour cr\u00e9er un nouveau formulaire, cr\u00e9ez d'abord un contrat puis utilisez le formulaire g\u00e9n\u00e9r\u00e9 comme base, plut\u00f4t que de d\u00e9marrer de z\u00e9ro. Vous pouvez \u00e9galement utiliser le UI Designer pour cr\u00e9er les pages et les layouts de vos applications m\u00e9tier.
openUiDesignerInformationToggleMessage=Ne plus afficher ce dialogue.
hideEmptyContractDialogTitle=Contrat vide
hideEmptyContractDialogMessage=Ce bouton g\u00e9n\u00e8re un formulaire contenant les widgets associ\u00e9s aux inputs du contrat, dont les valeurs sont d\u00e9j\u00e0 bind\u00e9es \u00e0 des variables par d\u00e9faut. Le mapping entre le formulaire et ce(te) (t\u00e2che ou processus \=> 0) est fait une fois pour toutes. Il n'est pas mis \u00e0 jour lorsque vous modifiez le contrat. Donc il vaut mieux cr\u00e9er votre contrat avant de cliquer sur ce bouton.
Do=voulez-vous toujours ouvrir le UI Designer ?
hideEmptyContractDialogToggleMessage=Ne plus afficher ce dialogue.

