#X-Generator: crowdin.com
invalidURLTitle=URL inv\u00e1lida
invalidURLMsg=Ocorreu um erro ao abrir um navegador web.
formRepository=P\u00e1ginas
fragmentRepository=Fragmentos
widgetRepository=Widgets personalizadas
externalURL=URL externa
targetForm=Formul\u00e1rio destino
url=URL
pageDoesntExist=Page with id "{0}" does not exist.
formDoesntExist=Form with id "{0}" does not exist.
caseStartFormMappingDescription=Selecione o tipo de formul\u00e1rio utilizado para instanciar o processo. Edi\u00e7\u00e3o de assinatura\: com "Live Update", \u00e9 poss\u00edvel atualizar o formul\u00e1rio utilizado pelo processo ap\u00f3s a sua implanta\u00e7\u00e3o.
entryFormMappingDescription=Selecione o tipo de formul\u00e1rio utilizado para cumprir o contrato. Edi\u00e7\u00e3o de assinatura\: com "Live Update", \u00e9 poss\u00edvel atualizar o formul\u00e1rio utilizado pelo processo ap\u00f3s a sua implanta\u00e7\u00e3o.
caseOverviewFormMappingDescription=A p\u00e1gina de s\u00edntese \u00e9 exibida no Bonita BPM Portal ao clicar no bot\u00e3o S\u00edntese na p\u00e1gina de detalhes do caso. N\u00e3o existem restri\u00e7\u00f5es quanto \u00e0s informa\u00e7\u00f5es que esta p\u00e1gina pode  incluir. Caso nenhuma p\u00e1gina espec\u00edfica seja definida, uma p\u00e1gina de s\u00edntese padr\u00e3o \u00e9 fornecida.
newFormTooltipForPool=Criar ou editar um formul\u00e1rio com base no contrato. Ele ser\u00e1 automaticamente mapeado para este processo.
newFormTooltipForTask=Criar ou editar um formul\u00e1rio com base no contrato. Ele ser\u00e1 automaticamente associado a esta tarefa.
legacyForm=6.x
openUIDesigner=Open UI Designer
uiDesignerLabel=UI Designer
creatingNewForm=Criando novo formul\u00e1rio ...
switchTypeOfFormQuestionTitle=Tipo de formul\u00e1rio incompat\u00edvel
switchTypeOfFormQuestion=The current form type for this task is {0}. A contract has been defined so you can use the UI Designer to create a form that automatically contains the relevant widgets for the contract inputs. Do you want to use the UI Designer to create a new form?
internalFormMappingUndefined=A associa\u00e7\u00e3o de formul\u00e1rio n\u00e3o est\u00e1 definida para {0}.
urlNotDefined=Um mapeamento de formul\u00e1rio externo est\u00e1 definido para {0}.
formDoesntExistAnymoreMessage=The form {0} does not exist anymore. It may have been deleted from UI Designer.
formDoesntExistAnymoreTitle=O formul\u00e1rio {0} n\u00e3o existe mais.
stepUIDesignerInfo=Se o formul\u00e1rio ainda n\u00e3o foi criado, recomendado-se definir o contrato primeiro. Isto permitir\u00e1 a gera\u00e7\u00e3o autom\u00e1tica de um formul\u00e1rio com os campos relevantes e com as associa\u00e7\u00f5es com os dados de entrada do contrato. Caso nenhum formul\u00e1rio seja definido, um formul\u00e1rio padr\u00e3o com base no contrato \u00e9 fornecido para fins de desenvolvimento. Clique no \u00edcone de l\u00e1pis para editar o formul\u00e1rio, ou use a lista de op\u00e7\u00f5es para escolher um formul\u00e1rio diferente.
processUIDesignerInfo=Se o formul\u00e1rio ainda n\u00e3o foi criado, recomendado-se definir o contrato primeiro. Isto permitir\u00e1 a gera\u00e7\u00e3o autom\u00e1tica de um formul\u00e1rio com os campos relevantes e com as associa\u00e7\u00f5es com os dados de entrada do contrato. Caso nenhum formul\u00e1rio seja definido, um formul\u00e1rio padr\u00e3o com base no contrato \u00e9 fornecido para fins de desenvolvimento. Clique no \u00edcone de l\u00e1pis para editar o formul\u00e1rio, ou use a lista de op\u00e7\u00f5es para escolher um formul\u00e1rio diferente.
overviewUIDesignerInfo=Clique no \u00edcone de l\u00e1pis para criar ou editar a p\u00e1gina de s\u00edntese, ou use a lista de op\u00e7\u00f5es para escolher uma p\u00e1gina diferente.
overviewURLInfo=Especifique a URL da p\u00e1gina. O processInstanceID \u00e9 fornecido como par\u00e2metro de consulta da URL (query string). \u00c9 o valor do par\u00e2metro <id> que \u00e9 adicionado \u00e0 URL externa durante a redire\u00e7\u00e3o. Outros recursos da API REST est\u00e3o dispon\u00edveis para preencher a p\u00e1gina com valores, especialmente  um "contexto" (API/bpm/case/<processInstanceId>/context e API/bpm/archivedCase/<archivedProcessInstanceId>/context) incluindo refer\u00eancias de dados de neg\u00f3cio e documentos.
stepURLInfo=Especifique a URL do formul\u00e1rio. \nEle deve enviar informa\u00e7\u00f5es que cumprem o contrato ao chamar API/bpm/userTask/<taskInstanceId>/execution. \nO taskInstanceID \u00e9 fornecido como par\u00e2metro de consulta da URL (query string). \u00c9 o valor do par\u00e2metro <id> que \u00e9 adicionado \u00e0 URL externa durante a redire\u00e7\u00e3o. \nOutros recursos da API REST est\u00e3o dispon\u00edveis para preencher o formul\u00e1rio com os valores iniciais, especialmente um "contexto" (API/bpm/userTask/<taskInstanceId>/context) que inclui refer\u00eancias de dados de neg\u00f3cio e de documentos e um "contrato" (API/bpm/userTask/<taskInstanceId>/contract) que descreve o formato do contrato que deve ser cumprido ao executar a tarefa.
processURLInfo=Especifique a URL do formul\u00e1rio. \nEle deve enviar informa\u00e7\u00f5es que cumprem o contrato na chamado a API/bpm/process/<processDefinitionId>/instantiation. \nO processDefinitionID \u00e9 fornecido como par\u00e2metro de consulta da URL (query string). \u00c9 o valor do par\u00e2metro <id> que adicionado \u00e0 URL externa durante a redire\u00e7\u00e3o. \nOutros recursos da API REST est\u00e3o dispon\u00edveis para preencher o formul\u00e1rio com os valores iniciais, especialmente um "contexto" (API/bpm/process/<processDefinitionId>/context) que inclui refer\u00eancias de dados de neg\u00f3cio e de documentos e um "contrato" (API/bpm/process/<processDefinitionId>/contract) que descreve o formato do contrato que deve ser cumprido ao instanciar o processo.
overviewLegacyInfo=V\u00e1 para a aba aplica\u00e7\u00e3o 6. x para definir a p\u00e1gina de s\u00edntese.
stepLegacyInfo=V\u00e1 para a aba aplica\u00e7\u00e3o 6. x para definir o formul\u00e1rio da tarefa. O contrato deve ser vazio.
processLegacyInfo=V\u00e1 para a aba aplica\u00e7\u00e3o 6. x para definir o formul\u00e1rio de instancia\u00e7\u00e3o. O contrato deve ser vazio.
openUiDesignerInformationWindowTitle=UI Designer information
openUiDesignerInformationMessage=You can use the UI Designer to create and modify forms. To create a new form, we recommend that you first create a contract and then use the automatically generated form as your starting point, instead of creating the form from scratch.\nYou can also use the UI Designer to create application pages and custom application layouts.
openUiDesignerInformationToggleMessage=N\u00e3o mostrar este di\u00e1logo novamente.
hideEmptyContractDialogTitle=Contrato vazio
hideEmptyContractDialogMessage=This button generates a form with the relevant widgets and data bindings for the contract inputs. The mapping between the form is and this (task or process \=> 0) is done once for all. It is not updated when you update the contract. We recommend you create your contract before clicking on this button.\nDo you still want to open the UI Designer?
hideEmptyContractDialogToggleMessage=N\u00e3o mostrar este di\u00e1logo novamente.
waitingForTomcatServer=The Tomcat server is starting in the background. This takes a few seconds.\nThe {0} will open when Tomcat has started.\nClick Cancel to close this popup.
noForm=Nenhum formul\u00e1rio
noFormMessageOnTask=Uma tarefa humana sem formul\u00e1rio e sem contrato representa uma tarefa manual, realizada fora do Bonita BPM. O usu\u00e1rio indicar\u00e1 no aplicativo ou no Portal que a tarefa manual foi realizada. \nUma tarefa humana com contrato e sem formul\u00e1rio sup\u00f5e que as informa\u00e7\u00f5es necess\u00e1rias para cumprir o contrato ser\u00e3o fornecidas programaticamente.
noFormMessageOnProcess=This process will be instantiated programmatically (by a call activity or by an API call from an application, for example), so no form is necessary.\nWhen "No form" is selected, no default instantiation form is generated for testing.\nIf you have defined a contract and want to use the default form for testing, choose the UI Designer option but do not specify a form.

