restApiExtensionRepositoryName=Extensions des API REST
defaultAPIDisplayName=API REST de NomdeRessource
defaultAPIDisplayDescription=API REST qui g\u00e8re NomdeRessource
create=Cr\u00e9er
newRestApiExtensionTitle=Nouvelle extension d'API REST
artifactConfigurationPageTitle=Configurer un nouveau projet
artifactConfigurationPageDescription=Remplissez les informations pour ce nouveau projet
advancedConfigurationPageTitle=Configuration avanc\u00e9e
advancedConfigurationPageDescription=Entrez les informations pour d\u00e9crire ce nouveau projet d'extension de l'API REST
description=Description
name=Nom
version=Version
errorDuringProjectCreation=Erreur \u00e0 la cr\u00e9ation du nouveau projet.
errorTitle=Erreur
artifactId=Identifiant de l'artefact
groupId=Identifiant du groupe
creatingRestAPIExtensionProject=Cr\u00e9ation du projet d'extension ...
pathTemplate=Path template
permissions=Autorisations\u00a0
add=Ajouter
remove=Supprimer
urlParameters=Param\u00e8tres d'URL
urlParametersPageTile=Param\u00e8tres d'URL
urlParametersPageDescription=D\u00e9finissez un ou plusieurs param\u00e8tres d'URL \u00e0 envoyer dans la requ\u00eate pour cette extension.
emptyPermissionsError=Au moins une autorisation doit \u00eatre d\u00e9clar\u00e9e.
building=G\u00e9n\u00e9ration de {0} ...
addBDMDependencies=Ajouter les d\u00e9pendances BDM
buildLabel=G\u00e9n\u00e9rer
selectRestAPIExtensionTitle=S\u00e9lectionnez une extension
selectThemeDescription=S\u00e9lectionnez un th\u00e8me \u00e0 g\u00e9n\u00e9rer et un emplacement cible.
selectThemeTitle=S\u00e9lectionner un th\u00e8me
selectRestAPIExtensionDescription=S\u00e9lectionnez une extension ainsi que le chemin cible o\u00f9 la construire.
selectRestAPIExtensionToOpenTitle=S\u00e9lectionnez une extension
selectRestAPIExtensionToOpenDescription=S\u00e9lectionnez une extension \u00e0 ouvrir
errorDuringProjectBuild=Une erreur s'est produite \u00e0 la g\u00e9n\u00e9ration du projet.
buildFailure=Echec de la g\u00e9n\u00e9ration
buildSuccess=G\u00e9n\u00e9ration r\u00e9ussie
buildRestApiExtensionTitle=G\u00e9n\u00e9rer l'extension
selectRestAPIExtensionToDeleteDescription=S\u00e9lectionnez une extension \u00e0 supprimer
targetLocation=Emplacement cible
browse=Parcourir...
emptySelectionErrorMessage=Aucun \u00e9l\u00e9ment s\u00e9lectionn\u00e9.
deploy=D\u00e9ployer
deployRestApiExtensionTitle=D\u00e9ployer une extension
selectThemeToDeployDescription=S\u00e9lectionnez un th\u00e8me \u00e0 d\u00e9ployer.
selectThemeToDeleteDescription=S\u00e9lectionnez un th\u00e8me \u00e0 supprimer.
selectRestAPIExtensionToDeployDescription=S\u00e9lectionnez une extension \u00e0 d\u00e9ployer.
deployFailedMessage=Une erreur s''est produite au d\u00e9ploiement de {0}.
deploySuccessTitle=D\u00e9ploiement r\u00e9alis\u00e9 avec succ\u00e8s
deploySuccessMessage={0} a \u00e9t\u00e9 d\u00e9ploy\u00e9 avec succ\u00e8s.
deployingCustomPage=D\u00e9ploiement de {0} ...
pathTemplateAlreadyExists=Le path template (URI) {0} est d\u00e9j\u00e0 utilis\u00e9 par l''extension {1} .
pagePropertyKeyMissing=La propri\u00e9t\u00e9 "{0}" n''est pas d\u00e9fini.
pagePropertyValueMissing=Aucune valeur d\u00e9fini pour la propri\u00e9t\u00e9 "{0}".
invalidMethodName="{0}" n''est pas une m\u00e9thode HTTP valide (valeurs possibles\: {1}).
invalidRestAPIContentType=Le type de contenu pour une extension d'API REST doit \u00eatre "apiExtension".
pagePropertyFileIsMissing=%s n'existe pas.
useGETMethodWarning=GET est la valeur recommand\u00e9e. Une extension d'API REST doit seulement effectuer des op\u00e9rations en lecture seule.
openRestApiExtensionTitle=Ouvrir une extension d'API REST
importingRestAPIExtensionProject=Import du projet de l''extension d''API REST {0}...
delete=Supprimer
doNotShowThisDialogAgain=Ne plus afficher ce dialogue
extensionPoint=Point d'extension\:
classFileNotFound=Le RestAPIController {0} n''existe pas.
classNotFound=Le RestAPIController {0} n''existe pas.
bdmDependenciesHint=Disponible lorsqu'un mod\u00e8le d'objet m\u00e9tier est d\u00e9fini. Ajoute les d\u00e9pendances sur ce dernier dans le fichier pom.xml g\u00e9n\u00e9r\u00e9.
projectName=Nom de projet
projectNameHint=Le nom du projet, utilis\u00e9 en tant qu'identifiant d\u2019artefact Maven et nom technique de l'extension (supporte uniquement des caract\u00e8res alphanum\u00e9rique).
groupIdHint=Le namespace de cette page personnalis\u00e9e, aussi utilis\u00e9 comme Maven group id.
portalDescription=Propri\u00e9t\u00e9s affich\u00e9es \u00e0 l\u2019ex\u00e9cution aux administrateurs du portail.
portal=Portail
project=Projet
emptyProjectName=Nom de projet vide
emptyPackage=Package vide
projectNameContainSpaces=Nom du projet ne peut pas contenir d'espaces
packageContainsSpaces=Le paquetage ne peut pas contenir d'espaces
alphanumericCharactersOnly=Le nom du projet supporte uniquement des caract\u00e8res alphanum\u00e9riques.
address=Adresse
pathTemplateHint=Le path template \u00e0 utiliser pour appeler cette API une fois d\u00e9ploy\u00e9e. L'adresse compl\u00e8te est affich\u00e9 ci-dessous.
permissionsDesciption=L'acc\u00e8s aux extensions d'API REST est prot\u00e9g\u00e9 par un syst\u00e8me d'autorisations. D\u00e9clarez une ou plusieurs autorisations propres \u00e0 cette API. Pour chaque autorisation, un mapping doit \u00eatre d\u00e9fini entre une autorisation et un profil ou un nom d'utilisateur. Pour modifier les mappings, cliquez sur D\u00e9veloppement > Extension d'API REST > Modifier le mapping des autorisations. 
urlParametersDesciption=La plupart du temps, une API retourne un r\u00e9sultat multiple. Il est recommand\u00e9 d''utiliser les param\u00e8tres "p" (page index) et "c" (count, qui est le nombre de r\u00e9sultat par page) comme pour les API REST de {0}. Utilisez ces param\u00e8tres pour r\u00e9cup\u00e9rer les r\u00e9sultats page par page. Vous pourrez ajouter/supprimer des param\u00e8tres d''URL ult\u00e9rieurement dans le code source.
applySecurityChangesMsg=Afin d'appliquer les modifications d'association d'autorisations dans le portail, vous devez vous d\u00e9connecter de la session courante et vous reconnecter.
applySecurityChangesTitle=Appliquer les changements
dependenciesInstallation=Installation des d\u00e9pendances Maven
dependenciesInstallationMsg=L'installation des d\u00e9pendances \u00e0 partir du d\u00e9p\u00f4t Maven central a \u00e9chou\u00e9. Vous ne serez pas en mesure d'utiliser l'outil de d\u00e9veloppement des extensions de l'API REST.\nUn acc\u00e8s Internet au d\u00e9p\u00f4t Maven central est n\u00e9cessaire \u00e0 l'activation de cette fonctionnalit\u00e9.\nSi votre fournisseur d'acc\u00e8s restreint votre acc\u00e8s vous pouvez configurer les r\u00e9glages du proxy ou cr\u00e9er un d\u00e9p\u00f4t miroir. Pour plus d'information, v\u00e9rifiez le site de documentation (mot-cl\u00e9 \: Creating a REST API extension).
installingDependencies=Installation des d\u00e9pendances en cours ...
validatingRestAPIExtension=Validation de l'extension de la REST API \u00ab%s \u00bb ...
missingDependency=%s \: la d\u00e9pendance %s est manquante
olderVersionToUpdateWarning=Extension d'API REST \: vous pouvez mettre \u00e0 jour la version %s vers %s dans le pom.xml, pour b\u00e9n\u00e9ficier des derni\u00e8res valeurs ajout\u00e9es dans les API.
todoUpdateVersion=Extension d'API REST \: A faire - La version de '%s' doit \u00eatre mise \u00e0 jour vers '%s' dans le pom.xml.
importProjectExists=Le projet "{0}" existe d\u00e9j\u00e0.
restApiActionMenu=Extension d'API REST
newMenu=Nouveau
exportDoneTitle=L'exportation s'est termin\u00e9e avec succ\u00e8s
exportDoneMessage=L'extension d'API REST '%s' a \u00e9t\u00e9 export\u00e9e avec succ\u00e8s
exportFailedTitle=L'exportation a \u00e9chou\u00e9
exportRestApiTitle=Exporter une extension d'API REST
importFailedTitle=La conversion du dossier en projet a \u00e9chou\u00e9
importFailedMsg=Une erreur s'est produite en convertissant ce dossier en projet d'extension d'API REST.
rightClickToConvert=(Clic droit pour convertir)
updateVersionForJava11Compliance=Pour garantir la conformit\u00e9 avec Java 11, la version de '%s' devrait \u00eatre mise \u00e0 jour vers '%s'
updateVersionForBCDCompliance=Pour assurer la conformit\u00e9 des modules BCD, la version de '%s' doit \u00eatre mise \u00e0 jour vers '%s'
restApiExtension=Extension d'API REST \: 
inPomFile=dans le fichier 'pom.xml'
errorsOnRestApi=Des erreurs ont \u00e9t\u00e9 d\u00e9tect\u00e9es dans le fichier '%s' de l'extension d'API REST '%s'.
warningsOnRestApi=Des alertes ont \u00e9t\u00e9 d\u00e9tect\u00e9es sur le fichier '%s' de l'extension d'API REST '%s'.
updateDependency=Mettre \u00e0 jour vers %s
themesRepositoryName=Th\u00e8mes
defaultThemeDisplayName=Mon th\u00e8me personnalis\u00e9
defaultThemeDescription=Ma description personnalis\u00e9e du th\u00e8me
newThemeTitle=Nouveau th\u00e8me
invalidContentType=Le type de contenu doit \u00eatre '%s'
deployWizardTitle=D\u00e9ployer
buildWizardTitle=G\u00e9n\u00e9rer
getMoreInfoInDocumentation=Obtenez plus d'informations sur les projets de %s sur le <a>site de documentation</a>.
updateBonitaVersionMarkerMessage=Pour b\u00e9n\u00e9ficier des derni\u00e8res fonctionnalit\u00e9 des API, la propri\u00e9t\u00e9 <bonita.version> devrait \u00eatre mise \u00e0 jour \u00e0 %s.
buildHasFailed=La construction de %s a \u00e9chou\u00e9.
formPermissionNotConfigured=Le formulaire '%s' d\u00e9pend des autorisations personnalis\u00e9es non mapp\u00e9es suivantes \: %s. Mapper ces permissions personnalis\u00e9es \u00e0 un profil en utilisant l'action 'Modifier le mapping des autorisations' sur les extensions de l'API REST.
recommendNodeVersionForBCD=Pour \u00eatre compatible avec le module BCD %s, vous devez utiliser NodeJS avec la version '%s'.
recommendNpmVersionForBCD=Pour \u00eatre compatible avec le module BCD %s, vous devez utiliser NPM avec la version %s.
bdmVersionNotMatching=Cette version ne correspond pas \u00e0 la version actuelle du BDM.
bdmGroupIdNotMatching=Ce groupId ne correspond pas au groupId du BDM actuel.
buildFailureMessage=Une erreur est survenue lors de la compilation.
buildSuccessMessage=Tous les artefacts ont \u00e9t\u00e9 construits et export\u00e9s vers %s.
customPageBuildSuccess='%s' a \u00e9t\u00e9 compil\u00e9 avec succ\u00e8s.
customPageBuildFailure=Une erreur est survenue lors de la compilation de '%s'. Essayez de compiler cet artefact individuellement et allez voir la console pour plus de d\u00e9tails.
selectRestAPIExtensionsTitle=S\u00e9lectionnez une extension
buildCancel=La compilation de '%s' a \u00e9t\u00e9 annul\u00e9e.
buildCancelTitle=Annuler la compilation
buildCancelMessage=At list one of the custom page build has been cancelled.
language=Langues
java=Java
groovy=Groovy
