restApiExtensionRepositoryName=Extensiones API REST
defaultAPIDisplayName=ResourceName REST API
defaultAPIDisplayDescription=API REST para administrar resourceName
create=Crear
newRestApiExtensionTitle=Nueva extensi\u00f3n de la API REST
artifactConfigurationPageTitle=Configurar un nuevo proyecto
artifactConfigurationPageDescription=Rellene la informaci\u00f3n de este nuevo proyecto
advancedConfigurationPageTitle=Configuraci
advancedConfigurationPageDescription=Rellene la informaci\u00f3n para este nuevo proyecto de extensi\u00f3n de la API REST
description=Descripci\u00f3n
name=Nombre
version=Versi\u00f3n
errorDuringProjectCreation=Se ha producido un error al crear un nuevo proyecto.
errorTitle=Error
artifactId=Id del artefacto
groupId=Id del grupo
creatingRestAPIExtensionProject=Creando proyecto de extensi\u00f3n del API REST...
pathTemplate=Ruta de la Plantilla
permissions=Permisos
add=A\u00f1adir
remove=Eliminar
urlParameters=Par\u00e1metros de URL
urlParametersPageTile=Par\u00e1metros de URL
urlParametersPageDescription=Definie uno o varios par\u00e1metros de URL para ser enviados en la solicitud de esta extensi\u00f3n de la API REST.
emptyPermissionsError=Por lo menos un permiso debe ser declarado.
building=Construyendo {0}...
addBDMDependencies=A\u00f1ade dependencias del BDM
buildLabel=Compilar
selectRestAPIExtensionTitle=Seleccione una extensi\u00f3n API REST
selectThemeDescription=Seleccione un tema para construir y una ubicaci\u00f3n destino.
selectThemeTitle=Selecciona un tema
selectRestAPIExtensionDescription=Selecciona una extensi\u00f3n del API REST que construir y una ubicaci\u00f3n de destino.
selectRestAPIExtensionToOpenTitle=Seleccione una extensi\u00f3n API REST
selectRestAPIExtensionToOpenDescription=Selecciona una extensi\u00f3n de la API REST para abrir
errorDuringProjectBuild=Se ha producido un error al construir el proyecto.
buildFailure=Fallo de construcci\u00f3n
buildSuccess=Construcci\u00f3n satisfactoria
buildRestApiExtensionTitle=Generar la extensi\u00f3n API REST
selectRestAPIExtensionToDeleteDescription=Seleccione una extensi\u00f3n API REST para eliminar
targetLocation=Ubicaci\u00f3n de destino
browse=Buscar...
emptySelectionErrorMessage=Ning\u00fan elemento seleccionado.
deploy=Desplegar
deployRestApiExtensionTitle=Desplegar una extensi\u00f3n API REST
selectThemeToDeployDescription=Seleccione un tema para desplegar.
selectThemeToDeleteDescription=Seleccione un tema para eliminar.
selectRestAPIExtensionToDeployDescription=Seleccione una extensi\u00f3n del API Rest que desplegar.
deployFailedMessage=Se ha producido un error al desplegar {0}.
deploySuccessTitle=Desplegado con \u00e9xito
deploySuccessMessage={0} se ha desplegado correctamente.
deployingCustomPage=Desplegando {0}...
pathTemplateAlreadyExists=La ruta de plantilla (URI) {0} est\u00e1 ya enlazada en la extensi\u00f3n {1}.
pagePropertyKeyMissing=La propiedad "{0}" no est\u00e1 definida.
pagePropertyValueMissing=Ning\u00fan valor establecido para la propiedad "{0}".
invalidMethodName="{0}" no es un m\u00e9todo HTTP v\u00e1lido (valores posibles\: {1}).
invalidRestAPIContentType=El tipo de contenido para la extensi\u00f3n de la API REST debe ser "apiExtension".
pagePropertyFileIsMissing=%s no existe.
useGETMethodWarning=GET es el valor recomendado. Una extensi\u00f3n de la API REST s\u00f3lo deber\u00eda realizar operaciones de s\u00f3lo lectura.
openRestApiExtensionTitle=Abrir extensi\u00f3n REST API
importingRestAPIExtensionProject=Importando el proyecto de extensi\u00f3n API REST {0}...
delete=Eliminar
doNotShowThisDialogAgain=No volver a mostrar este cuadro de di\u00e1logo
extensionPoint=Punto de extensi\u00f3n\:
classFileNotFound=RestAPIController {0} no encontrado.
bdmDependenciesHint=Permitido cuando se define un modelo de datos de negocio. Agrega las dependencias al BDM en el archivo pom.xml generado.
projectName=Nombre del proyecto
projectNameHint=El nombre del proyecto, tambi\u00e9n se utiliza como el identificador de artefacto Maven y el nombre t\u00e9cnico de la extensi\u00f3n (s\u00f3lo se permiten caracteres alfanum\u00e9ricos).
groupIdHint=El namespace de esta p\u00e1gina custom, tambi\u00e9n es usado como id de grupo Maven.
portalDescription=Propiedades visibles en tiempo de ejecuci\u00f3n para los administradores del portal.
portal=Portal
project=Proyecto
emptyProjectName=Nombre del proyecto vac\u00edo
emptyPackage=Paquete de vac\u00edo
projectNameContainSpaces=El nombre del proyecto no puede contener espacios
packageContainsSpaces=El paquete no puede contener espacios
alphanumericCharactersOnly=El nombre del proyecto s\u00f3lo admite caracteres alfanum\u00e9ricos.
address=Direcci\u00f3n
pathTemplateHint=La ruta a la plantilla utilizada para llamar a esta API despu\u00e9s del despliegue. La direcci\u00f3n resuelta se muestra a continuaci\u00f3n.
permissionsDesciption=El acceso de las extensiones API REST est\u00e1 protegido con un sistema de gesti\u00f3n de permisos. Declare uno o m\u00e1s permisos espec\u00edficos a este API. Para cada permiso, debe configurarse una asignaci\u00f3n entre el permiso y un perfil o un nombre de usuario. Para editar la asignaci\u00f3n del archivo haga clic en Desarrollo > Extensi\u00f3n API REST > Editar permisos de asignaci\u00f3n. 
urlParametersDesciption=La mayor\u00eda del tiempo una API devuelve m\u00faltiples resultados. Se recomienda utilizar los par\u00e1metros "p" (\u00edndice de la p\u00e1gina) y "c" (count, que es el n\u00famero de resultados por p\u00e1gina) como para los API Rest de {0}. Utilice estos par\u00e1metros para recuperar los resultados p\u00e1gina por p\u00e1gina. Agregar/suprimir los par\u00e1metros de direcci\u00f3n URL se puede hacer despu\u00e9s en el c\u00f3digo fuente.
applySecurityChangesMsg=Para aplicar los cambios de asociaci\u00f3n de permisos en el portal, tiene que salir de la sesi\u00f3n actual y volver a iniciar sesi\u00f3n.
applySecurityChangesTitle=Aplicar cambios
dependenciesInstallation=Instalaci\u00f3n de las dependencias de Maven
dependenciesInstallationMsg=Ha fallado la instalaci\u00f3n de las dependencias del repositorio central de Maven. No se podr\u00e1n usar las herramientas de desarrollo de extensi\u00f3n de la API REST. Un acceso a Internet al repositorio central de Maven es obligatorio para activar esta funci\u00f3n. Si su proveedor est\u00e1 restringiendo el acceso a Internet, puede configurar un servidor proxy o crear un repositorio espejo. Consulte el sitio de la documentaci\u00f3n para obtener m\u00e1s informaci\u00f3n.
installingDependencies=Instalando dependencias....
validatingRestAPIExtension=Validando la extensi\u00f3n API REST '%s'...
missingDependency=%s\: Faltan dependencias %s
olderVersionToUpdateWarning=Extensi\u00f3n API REST\: %s versi\u00f3n puede ser actualizada a %s en pom.xml para beneficiarse de la \u00faltima capacidad de la API.
todoUpdateVersion=Extensi\u00f3n API REST\: TODO - La versi\u00f3n de '%s' debe ser actualizada a '%s' en el pom.xml.
importProjectExists=Proyecto "{0}" ya existe.
restApiActionMenu=Extensi\u00f3n API REST
newMenu=Nuevo
exportDoneTitle=Exportaci\u00f3n \u00e9xitosa
exportDoneMessage=La extensi\u00f3n de la API Rest '%s' se ha exportado correctamente
exportFailedTitle=Exportaci\u00f3n fallida
exportRestApiTitle=Exportar una extensi\u00f3n de API Rest
importFailedTitle=No se pudo convertir en proyecto
importFailedMsg=Error al convertir esta carpeta en un nuevo proyecto de extensi\u00f3n del API REST.
rightClickToConvert=(Haga clic derecho para convertir)
updateVersionForJava11Compliance=Para asegurar la compatibilidad con Java 11, la versi\u00f3n de '%s' debe ser actualizada a '%s'
restApiExtension=Extensi\u00f3n API REST\: 
inPomFile=en el archivo 'pom.xml'
errorsOnRestApi=Hay errores en el archivo '%s' de la extensi\u00f3n API REST '%s'.
warningsOnRestApi=Hay advertencias en el archivo '%s' de la Extensi\u00f3n API REST '%s'.
updateDependency=Actualizado a %s
themesRepositoryName=Temas
defaultThemeDisplayName=Mi tema personalizado
defaultThemeDescription=Descripci\u00f3n de mi tema personalizado
newThemeTitle=Nuevo tema
invalidContentType=El tipo de contenido debe ser '%s'
deployWizardTitle=Desplegar
buildWizardTitle=Compilar
getMoreInfoInDocumentation=Get more information about %s projects on the <a>documentation website</a>.
updateBonitaVersionMarkerMessage=Para beneficiarse de la \u00faltima capacidad de las API, la propiedad <bonita.version> debe ser actualizada a %s.
buildHasFailed=La construcci\u00f3n de %s ha fallado.
formPermissionNotConfigured=El formulario '%s' depende de los siguientes permisos personalizados no agregados\: %s. Mapea los permisos personalizados a un perfil usando la acci\u00f3n 'Editar asignaci\u00f3n de permisos' en las extensiones API REST.
recommendNodeVersionForBCD=Para ser compatible con el Add-on %s BCD debes usar node con la versi\u00f3n '%s'.
recommendNpmVersionForBCD=Para ser compatible con el Add-on %s BCD, debes usar npm con la versi\u00f3n %s.
bdmVersionNotMatching=Esta versi\u00f3n no coincide con la versi\u00f3n actual de artefactos del BDM.
bdmGroupIdNotMatching=Este groupId no coincide con el groupId de artefactos del BDM actual.