#X-Generator: crowdin.com
java.version.title=Version de Java
java.version.message=Le programme d'installation n'a pas d\u00e9tect\u00e9 de version de Java compatible sur votre syst\u00e8me. Si vous poursuivez l'installation,  une version embarqu\u00e9e de Java sera ajout\u00e9e \u00e0 votre Studio Bonita BPM.  \nRemarque: Cette version de Java ne sera pas install\u00e9e sur votre syst\u00e8me, donc elle n'aura aucune incidence sur d'autres applications. Si vous ne souhaitez pas utiliser cette version embarqu\u00e9e de Java, annulez l'installation, installez Java, puis red\u00e9marrez l'installation. \nVoulez-vous continuer l'installation et utiliser la version embarqu\u00e9e de Java ?
workspace.recovery.progressMessage=Veuillez patienter, r\u00e9cup\u00e9ration des donn\u00e9es de l'espace de travail...
initializing.progressMessage=Veuillez patienter, lors de l'initialisation
workspace.location.title=Emplacement de l'espace de travail
workspace.location.description=Chemin d'acc\u00e8s
workspace.location.explanation=S\u00e9lectionnez un dossier d'installation Bonita BPM 6 dont vous souhaitez extraire les donn\u00e9es:
workspace.location.explanation.choice1=- Espace de travail par d\u00e9faut: s\u00e9lectionnez le r\u00e9pertoire ou vous avez install\u00e9 Bonita BPM Studio.
workspace.location.explanation.choice2=- Autre espace de travail (\u00e9ditions Subscription): s\u00e9lectionnez le r\u00e9pertoire parent.
workspace.location.explanation.end=Pour migrer d'autres espaces de travail manuellement (\u00e9ditions Subscription): dans le Studio en version pr\u00e9c\u00e9dente, fermez tous les diagrammes et exportez les ; puis importez les fichiers dans le Studio nouvelle version.
workspace.location.validation.error=L'emplacement de l'espace de travail n'est pas valide
keep.workspace.title=Conserver l'espace de travail ?
keep.workspace.msg=Voulez vous conserver les donn\u00e9es existantes?
launch=Lancement
install.license.error=Le fichier de licence doit porter l'extension ".lic"
install.license.desc=Licence (facultatif)
request.key.explanation=Veuillez copier la cl\u00e9 ci-dessous puis connectez-vous sur Bonitasoft Customer Portal (https://customer.bonitasoft.com).\nDans le menu d\u00e9di\u00e9 \u00e0 la demande de licences, saisissez vos informations puis collez votre cl\u00e9.
install.license.title=Licence du produit
retrieve.workspace.title=R\u00e9cup\u00e9rer les donn\u00e9es
retrieve.workspace.message=Voulez-vous r\u00e9cup\u00e9rer des donn\u00e9es d'un espace de travail existant de BonitaBPM ?
retrieve.workspace.message.warning=Attention: si vous migrez un espace de travail contenant un repository partag\u00e9 (Edition Souscription), tous les utilisateurs du repository doivent aussi migrer vers cette nouvelle version.
workspace.setup=Configuration de l'espace de travail
no.thanks=Non, ne pas migrer de donn\u00e9e, je migrerai manuellement ou je n\u00b4ai aucune donn\u00e9e \u00e0 migrer.
yes.import=Oui, importer des donn\u00e9es depuis un autre espace de travail.
