#X-Generator: crowdin.com
java.version.title=Versi\u00f3n de Java
java.version.message=El programa de instalaci\u00f3n no ha detectado una versi\u00f3n compatible de Java en su sistema. Si contin\u00faa la instalaci\u00f3n, el instalador a\u00f1adir\u00e1 una versi\u00f3n de Java embebida a su Bonita BPM Studio.  Nota\: Esta versi\u00f3n de Java no se instalar\u00e1 en su sistema, as\u00ed que no afectar\u00e1 otras aplicaciones. Si no quieres utilizar la versi\u00f3n de Java embebida, cancele la instalaci\u00f3n, instale Java y luego reinicie la instalaci\u00f3n.  \u00bfQuieres continuar con la instalaci\u00f3n y usar Java embebida?
workspace.recovery.progressMessage=Por favor espere, recuperaci\u00f3n de datos de espacio de trabajo...
initializing.progressMessage=Espere por favor iniciando 
workspace.location.title=Ubicaci\u00f3n del \u00e1rea de trabajo
workspace.location.description=Ruta
workspace.location.explanation=Seleccione una carpeta de instalaci\u00f3n de Bonita BPM 6 desde donde quiera recuperar datos
workspace.location.explanation.choice1=-espacio de trabajo predeterminado\: busque el directorio donde se instal\u00f3 Bonita BPM Studio.
workspace.location.explanation.choice2=- otro espacio de trabajo (Suscripci\u00f3n)\: Busque el directorio base.
workspace.location.explanation.end=Para migrar manualmente otros espacios de trabajo (s\u00f3lo ediciones de suscripci\u00f3n)\: en el antiguo Studio, cierre todos los diagramas, exporte todo e importe el archivo al nuevo Studio.
workspace.location.validation.error=La ubicaci\u00f3n no se corresponde con un Bonita BPM Workspace v\u00e1lido
keep.workspace.title=\u00bfMantener el \u00e1rea de trabajo?
keep.workspace.msg=\u00bfDesea guardar todos los datos existentes?
launch=Iniciar
install.license.error=Archivo de licencia debe tener una extensi\u00f3n ". Lic"
install.license.desc=License (opcional)
request.key.explanation=Copie la clave de licencia, inicie sesi\u00f3n en el Portal del cliente de Bonitasoft (https\://customer.bonitasoft.com/license/request) y peguelo en el campo clave de solicitud de licencia. Recibir\u00e1 su archivo de licencia por correo electr\u00f3nico. Guardelo localmente y vuelva a este instalador.\n
install.license.title=Licencia del producto
retrieve.workspace.title=Recuperar datos
retrieve.workspace.message=\u00bfQuieres recuperar datos de un \u00e1rea de trabajo existente de BonitaBPM?
retrieve.workspace.message.warning=ADVERTENCIA\: Si migra un espacio de trabajo que contiene un repositorio compartido (ediciones de Suscripci\u00f3n), todos los usuarios del repositorio deber\u00e1n migrar a la nueva versi\u00f3n del Studio.
workspace.setup=Configuraci\u00f3n del workspace
no.thanks=No, gracias\!
yes.import=S\u00ed, importar datos de otro espacio de trabajo.
