java.version.title=Java \u30d0\u30fc\u30b8\u30e7\u30f3
java.version.message=\u30a4\u30f3\u30b9\u30c8\u30fc\u30e9\u30fc\u306f\u3001\u3042\u306a\u305f\u306e\u30b7\u30b9\u30c6\u30e0\u306b Bonita BPM\u3068\u4e92\u63db\u6027\u306e\u3042\u308bJava \u30d0\u30fc\u30b8\u30e7\u30f3\u3092\u691c\u51fa\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3092\u7d9a\u884c\u3059\u308b\u5834\u5408\u3001\u30a4\u30f3\u30b9\u30c8\u30fc\u30e9\u30fc\u306f\u3001Bonita BPM Studio \u306b Java \u306e\u7d44\u307f\u8fbc\u307f\u30d0\u30fc\u30b8\u30e7\u30f3\u3092\u8ffd\u52a0\u3057\u307e\u3059\u3002\n \u6ce8\: \u3053\u306eJava \u30d0\u30fc\u30b8\u30e7\u30f3\u306f\u3042\u306a\u305f\u306e\u30b7\u30b9\u30c6\u30e0\u306b\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3055\u308c\u306a\u3044\u306e\u3067\u3001\u4ed6\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306b\u306f\u5f71\u97ff\u3057\u307e\u305b\u3093\u3002\u7d44\u307f\u8fbc\u307fJava \u30d0\u30fc\u30b8\u30e7\u30f3\u3092\u4f7f\u7528\u3057\u305f\u304f\u306a\u3044\u5834\u5408\u306f\u3001\u3053\u306e\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3092\u30ad\u30e3\u30f3\u30bb\u30eb\u3057\u3001Java \u3092\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3057\u3066\u304b\u3089\u3001\u3053\u306e\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3092\u518d\u958b\u3057\u307e\u3059\u3002\n \u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3092\u7d9a\u884c\u3057\u3066\u7d44\u307f\u8fbc\u307e\u308c\u305f Java \u3092\u4f7f\u7528\u3057\u305f\u3044\u3067\u3059\u304b\uff1f
keep.workspace.title=\u4eca\u307e\u3067\u306e\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u3092\u4fdd\u6301\u3057\u307e\u3059\u304b\uff1f
keep.workspace.msg=\u65e2\u5b58\u306e\u30c7\u30fc\u30bf\u3092\u4fdd\u5b58\u3057\u307e\u3059\u304b\uff1f
launch=\u8d77\u52d5
install.license.error=\u30e9\u30a4\u30bb\u30f3\u30b9 \u30fb \u30d5\u30a1\u30a4\u30eb\u306b\u306f\u3001\u300c.lic\u300d\u306e\u62e1\u5f35\u5b50\u304c\u4ed8\u3051\u3089\u308c\u307e\u3059
install.license.desc=\u30e9\u30a4\u30bb\u30f3\u30b9 \u30d5\u30a1\u30a4\u30eb
request.key.explanation=\u4ee5\u4e0b\u306e\u30e9\u30a4\u30bb\u30f3\u30b9 \u30ad\u30fc\u3092\u30b3\u30d4\u30fc\u3057\u3066\u3001BonitaSoft \u30ab\u30b9\u30bf\u30de\u30fc \u30dd\u30fc\u30bf\u30eb\uff08https\://customer.bonitasoft.com/license/request\uff09\u306b\u30ed\u30b0\u30a4\u30f3\u3057\u3001\u30b3\u30d4\u30fc\u3057\u305f\u30e9\u30a4\u30bb\u30f3\u30b9 \u30ad\u30fc\u3092\u30e9\u30a4\u30bb\u30f3\u30b9 \u30ea\u30af\u30a8\u30b9\u30c8 \u30ad\u30fc\u30fb\u30d5\u30a3\u30fc\u30eb\u30c9\u306b\u8cbc\u308a\u4ed8\u3051\u307e\u3059\u3002\n\u305d\u306e\u5f8c\u3001e\u30e1\u30fc\u30eb\u3067\u30e9\u30a4\u30bb\u30f3\u30b9 \u30ad\u30fc \u30d5\u30a1\u30a4\u30eb\u3092\u53d7\u3051\u53d6\u308a\u307e\u3059\u306e\u3067\u3001\u305d\u308c\u3092\u30ed\u30fc\u30ab\u30eb\u306b\u4fdd\u5b58\u3057\u3066\u304b\u3089\u3001\u3053\u306e\u30a4\u30f3\u30b9\u30c8\u30fc\u30e9\u30fc\u3078\u623b\u308a\u307e\u3059\u3002
install.license.title=\u88fd\u54c1\u30e9\u30a4\u30bb\u30f3\u30b9
workspace.setup=\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u306e\u8a2d\u5b9a
not.enough.diskspace=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3059\u308b\u305f\u3081\u306e\u5341\u5206\u306a\u30c7\u30a3\u30b9\u30af\u5bb9\u91cf\u304c\u3042\u308a\u307e\u305b\u3093\u3002\n\u5225\u306e\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u3092\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044\u3002
installdir.must.be.empty.folder=Installation directory must be empty.
antivirus.detected.title=Anti-virus configuration
antivirus.detected.message=\u30a6\u30a4\u30eb\u30b9\u5bfe\u7b56\u30bd\u30d5\u30c8\u30a6\u30a7\u30a2\u304c\u30b3\u30f3\u30d4\u30e5\u30fc\u30bf\u4e0a\u3067\u5b9f\u884c\u3055\u308c\u3066\u3044\u307e\u3059\u3002 Bonita \u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306e\u3059\u3079\u3066\u306e\u30b3\u30f3\u30c6\u30f3\u30c4\u3092\u30c1\u30a7\u30c3\u30af\u3057\u3001\u8ffd\u52a0\u306e\u4fdd\u8b77\u3092\u63d0\u4f9b\u3057\u306a\u3044\u9650\u308aBonita Studio \u306e\u30d1\u30d5\u30a9\u30fc\u30de\u30f3\u30b9\u306b\u5f71\u97ff\u3092\u4e0e\u3048\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002 ${installdir}\u5c02\u7528\u306e\u9664\u5916\u30eb\u30fc\u30eb\u3092\u8ffd\u52a0\u3059\u308b\u3088\u3046\u306b\u30a2\u30f3\u30c1\u30a6\u30a4\u30eb\u30b9\u3092\u8a2d\u5b9a\u3067\u304d\u307e\u3059\u3002 \u30c7\u30d5\u30a9\u30eb\u30c8\u306eWindows\u30a6\u30a4\u30eb\u30b9\u5bfe\u7b56\u30bd\u30d5\u30c8\u30a6\u30a7\u30a2\u3067\u3053\u308c\u3092\u884c\u3046\u306b\u306f\u4ee5\u4e0b\u306e\u30ea\u30f3\u30af\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
visit.microsoft.website=Microsoft Support Web \u30b5\u30a4\u30c8\u306b\u30a2\u30af\u30bb\u30b9\u3059\u308b