#X-Generator: crowdin.com
java.version.title=Java \u30d0\u30fc\u30b8\u30e7\u30f3
java.version.message=The installer has not detected a compatible version of Java on your system. If you continue the installation, the installer will add an embedded version of Java to your Bonita Studio.\n Note\: This version of Java will not be installed on your system, so it will not impact other applications. If you do not want to use the embedded Java version, cancel the installation, install Java, then restart the installation.\n Do you want to continue the installation and use the embedded Java?
workspace.recovery.progressMessage=\u304a\u5f85\u3061\u304f\u3060\u3055\u3044\u3002\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u306e\u30c7\u30fc\u30bf\u3092\u53d6\u5f97\u4e2d...
initializing.progressMessage=\u304a\u5f85\u3061\u304f\u3060\u3055\u3044\u3001\u521d\u671f\u5316\u3057\u3066\u3044\u307e\u3059
workspace.location.title=\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u306e\u5834\u6240
workspace.location.description=\u30d1\u30b9
workspace.location.explanation=\u3042\u306a\u305f\u304c\u6307\u5b9a\u3057\u305f\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u3092\uff11\u3064\u3060\u3051\u81ea\u52d5\u3067\u79fb\u884c\u3067\u304d\u307e\u3059\uff1a
workspace.location.explanation.choice1=- default workspace\: browse to the directory where you installed Bonita Studio.
workspace.location.explanation.choice2=- \u5225\u306e\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9 \uff08\u30b5\u30d6\u30b9\u30af\u30ea\u30d7\u30b7\u30e7\u30f3\u7248\uff09\: \u305d\u306e\u89aa\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u3092\u53c2\u7167\u3057\u307e\u3059\u3002
workspace.location.explanation.end=\u4ed6\u306e\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u3092\u624b\u52d5\u3067\u79fb\u884c\u3059\u308b\uff08\u30b5\u30d6\u30b9\u30af\u30ea\u30d7\u30b7\u30e7\u30f3\u7248\u306e\u307f\uff09\: \u53e4\u3044 Studio \u306e\u3059\u3079\u3066\u306e\u30c0\u30a4\u30a2\u30b0\u30e9\u30e0\u3092\u9589\u3058\u3066\u3059\u3079\u3066\u3092\u30a8\u30af\u30b9\u30dd\u30fc\u30c8\u3057\u3001\u305d\u306e\u30a2\u30fc\u30ab\u30a4\u30d6\u3092\u65b0\u3057\u3044 Studio \u306b\u30a4\u30f3\u30dd\u30fc\u30c8\u3057\u307e\u3059\u3002
workspace.location.validation.error=\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u306e\u5834\u6240\u306f\u3001\u6709\u52b9\u306aBonita BPM \u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u3067\u306f\u3042\u308a\u307e\u305b\u3093
keep.workspace.title=\u4eca\u307e\u3067\u306e\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u3092\u4fdd\u6301\u3057\u307e\u3059\u304b\uff1f
keep.workspace.msg=\u65e2\u5b58\u306e\u30c7\u30fc\u30bf\u3092\u4fdd\u5b58\u3057\u307e\u3059\u304b\uff1f
launch=\u8d77\u52d5
install.license.error=\u30e9\u30a4\u30bb\u30f3\u30b9 \u30fb \u30d5\u30a1\u30a4\u30eb\u306b\u306f\u3001\u300c.lic\u300d\u306e\u62e1\u5f35\u5b50\u304c\u4ed8\u3051\u3089\u308c\u307e\u3059
install.license.desc=\u30e9\u30a4\u30bb\u30f3\u30b9 \u30fb \u30d5\u30a1\u30a4\u30eb\uff08\u7701\u7565\u53ef\u80fd\uff09
request.key.explanation=\u4ee5\u4e0b\u306e\u30e9\u30a4\u30bb\u30f3\u30b9 \u30ad\u30fc\u3092\u30b3\u30d4\u30fc\u3057\u3066\u3001BonitaSoft \u30ab\u30b9\u30bf\u30de\u30fc \u30dd\u30fc\u30bf\u30eb\uff08https\://customer.bonitasoft.com/license/request\uff09\u306b\u30ed\u30b0\u30a4\u30f3\u3057\u3001\u30b3\u30d4\u30fc\u3057\u305f\u30e9\u30a4\u30bb\u30f3\u30b9 \u30ad\u30fc\u3092\u30e9\u30a4\u30bb\u30f3\u30b9 \u30ea\u30af\u30a8\u30b9\u30c8 \u30ad\u30fc\u30fb\u30d5\u30a3\u30fc\u30eb\u30c9\u306b\u8cbc\u308a\u4ed8\u3051\u307e\u3059\u3002\n\u305d\u306e\u5f8c\u3001e\u30e1\u30fc\u30eb\u3067\u30e9\u30a4\u30bb\u30f3\u30b9 \u30ad\u30fc \u30d5\u30a1\u30a4\u30eb\u3092\u53d7\u3051\u53d6\u308a\u307e\u3059\u306e\u3067\u3001\u305d\u308c\u3092\u30ed\u30fc\u30ab\u30eb\u306b\u4fdd\u5b58\u3057\u3066\u304b\u3089\u3001\u3053\u306e\u30a4\u30f3\u30b9\u30c8\u30fc\u30e9\u30fc\u3078\u623b\u308a\u307e\u3059\u3002
install.license.title=\u88fd\u54c1\u30e9\u30a4\u30bb\u30f3\u30b9
retrieve.workspace.title=\u30c7\u30fc\u30bf\u3092\u53d6\u5f97
retrieve.workspace.message=Do you want to retrieve data from an existing Bonita Studio workspace?
retrieve.workspace.message.warning=\u8b66\u544a\: \u5171\u6709\u30ea\u30dd\u30b8\u30c8\u30ea\uff08\u30b5\u30d6\u30b9\u30af\u30ea\u30d7\u30b7\u30e7\u30f3\u30fb\u30a8\u30c7\u30a3\u30b7\u30e7\u30f3\uff09\u3092\u542b\u3080\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u3092\u79fb\u884c\u3059\u308b\u5834\u5408\u306f\u3001\u3059\u3079\u3066\u306e\u30ea\u30dd\u30b8\u30c8\u30ea \u30e6\u30fc\u30b6\u30fc\u306f\u65b0\u3057\u3044Studio\u30d0\u30fc\u30b8\u30e7\u30f3\u306b\u79fb\u884c\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
workspace.setup=\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u306e\u8a2d\u5b9a
no.thanks=\u3044\u3044\u3048\u3001\u30c7\u30fc\u30bf\u3092\u79fb\u884c\u3057\u307e\u305b\u3093\u3002\u300c\u624b\u52d5\u3067\u79fb\u884c\u3057\u307e\u3059\u300d\u3001\u307e\u305f\u306f\u300c\u79fb\u884c\u3059\u308b\u30c7\u30fc\u30bf\u3092\u6301\u3063\u3066\u3044\u307e\u305b\u3093\u300d\u3002
yes.import=\u306f\u3044\u3001\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u3092\u79fb\u884c\u3057\u307e\u3059\u3002
