#X-Generator: crowdin.net
java.version.title=Vers\u00e3o Java
java.version.message=O instalador n\u00e3o detectou nenhuma vers\u00e3o Java compat\u00edvel em seu sistema. Case continue a instala\u00e7\u00e3o, o instalador adicionar\u00e1 uma vers\u00e3o embarcada do Java para o seu Bonita BPM Studio.  Nota\: Esta vers\u00e3o Java n\u00e3o ser\u00e1 instalada no seu sistema, ent\u00e3o ela n\u00e3o ter\u00e1 impacto em outros aplicativos. Caso n\u00e3o queira usar a vers\u00e3o Java embarcada, cancele a instala\u00e7\u00e3o, instale o Java e reinicie a instala\u00e7\u00e3o.  Deseja continuar com a instala\u00e7\u00e3o e usar o Java embarcado?
workspace.recovery.progressMessage=Aguarde, recupera\u00e7\u00e3o de dados do espa\u00e7o de trabalho (workspace)...
initializing.progressMessage=Por favor aguarde, inicializando
workspace.location.title=Localiza\u00e7\u00e3o do espa\u00e7o de trabalho
workspace.location.description=Caminho
workspace.location.explanation=Selecione uma pasta de instala\u00e7\u00e3o do Bonita BPM 6 onde voc\u00ea deseja obter os dados
workspace.location.explanation.choice1=- espa\u00e7o de trabalho padr\u00e3o\: navegue at\u00e9 o diret\u00f3rio onde voc\u00ea instalou o Bonita BPM Studio.
workspace.location.explanation.choice2=- outro espa\u00e7o de trabalho (edi\u00e7\u00f5es de assinatura)\: navegue at\u00e9 o diret\u00f3rio pai.
workspace.location.explanation.end=Para migrar outros espa\u00e7os de trabalho manualmente (apenas edi\u00e7\u00f5es de assinatura)\: no antigo Studio, com todos os diagramas fechados, exporte tudo e importe o arquivo no novo Studio.
workspace.location.validation.error=A localiza\u00e7\u00e3o do workspace n\u00e3o \u00e9 valida para o Bonita BPM Workspace
keep.workspace.title=Manter o workspace?
keep.workspace.msg=Voc\u00ea quer manter todos os seus dados existentes?
launch=Lan\u00e7ar
install.license.error=Arquivo de licen\u00e7a deve ter uma extens\u00e3o ".lic"
install.license.desc=Arquivo de licen\u00e7a (opcional)
request.key.explanation=Copie a chave de licen\u00e7a abaixo, conecte-se no portal de suporte de Bonitasoft (https\://customer.bonitasoft.com) e solicite uma licen\u00e7a.
install.license.title=Licen\u00e7a de produto
retrieve.workspace.title=Recuperar dados
retrieve.workspace.message=Voc\u00ea deseja recuperar dados de um workspace existente  em BonitaBPM?
retrieve.workspace.message.warning=Aviso\: Se migrar um espa\u00e7o de trabalho que cont\u00e9m um reposit\u00f3rio compartilhado (edi\u00e7\u00f5es de subscri\u00e7\u00e3o), todos os usu\u00e1rios do reposit\u00f3rio devem migrar para a nova vers\u00e3o do Studio.
workspace.setup=Configura\u00e7\u00e3o do espa\u00e7o de trabalho
no.thanks=N\u00e3o, obrigado\!
yes.import=Sim, importe dados de outro workspace.
