NewProcessButtonLabel=Nouveau
OpenProcessButtonLabel=Ouvrir
SaveProcessButtonLabel=Enregistrer
PrintProcessButtonLabel=Imprimer
CopyButtonLabel=Copier
PasteButtonLabel=Coller
HelpButtonLabel=Aide
WelcomeButtonLabel=Bienvenue
openProcessWizardPage_title=Ouvrir un diagramme existant
unableTofindLogMessage=Le fichier de log n'a pas \u00e9t\u00e9 trouv\u00e9 sur votre syst\u00e8me de fichier. Il n'a peut-\u00eatre pas encore \u00e9t\u00e9 cr\u00e9e.
unableTofindLogTitle=Erreur
PreferencesButtonLabel=Pr\u00e9f\u00e9rences
badWorkspaceVersionTitle=Conflit de version d'espace de travail
badWorkspaceVersionMessage=L''espace de travail actuel {0} se trouve dans une version ({1}) diff\u00e9rente de {2}{3}. Un autre utilisateur a peut-\u00eatre migr\u00e9 cet espace de travail vers une version plus r\u00e9cente. Vous ne pouvez plus utiliser cet espace de travail avec cette version de {4}. L''espace de travail par d\u00e9faut va \u00eatre ouvert.
resfreshConnectors=Actualisation des connecteurs...
aboutText={3} Edition\nVersion \: {0}\nVersion id \: {1}\nBuild id \: {2}\nCopyright \u00a9 {4} S.A., 2009-{5}\nAll rights reserved. 
maximizeCoolbarTooltip=Agrandir
reduceCoolbarTooltip=Minimiser
initializingCurrentRepository=Initialisation du projet courant ...
shuttingDown=Arr\u00eat du moteur...
jreNotFoundTitle=Aucun JRE d\u00e9tect\u00e9
jreNotFoundMessage=Un JRE n'a pas \u00e9t\u00e9 trouv\u00e9. Voulez-vous ouvrir la page de pr\u00e9f\u00e9rences Java ?
invalidWorkspaceTitle=Espace de travail non valide
invalidWorkspace={0} n\u2019est pas un espace de travail valide. L\u2019application va donc \u00eatre initialis\u00e9e sans l''importer.
failedToOpenLogTitle=L'ouverture des logs a \u00e9chou\u00e9
failedToOpenLogMessage=Le fichier de logs est trop volumineux pour \u00eatre ouvert avec {1}. Ouvrez le fichier {0} dans un \u00e9diteur de texte de votre choix.
doNotDisplayForOtherDiagrams=Ne plus afficher pour les nouveaux diagrammes
noProcessAvailable=Aucun diagramme ouvert r\u00e9cemment
offlineRepositoryTitle=Projet d\u00e9connect\u00e9 
offlineRepositoryMessage=Le projet {0} est actuellement d\u00e9connect\u00e9. Vous ne pourrez pas mettre \u00e0 jour ni faire de commit en \u00e9tant d\u00e9connect\u00e9.
incompatibleJavaVersionTitle=La version de Java est incompatible
incompatibleJavaVersionMessage=Vous utilisez %s en utilisant une version de Java incompatible (%s).\n Les versions support\u00e9es sont \: %s.
exitWarningMessage=Quitter {0} ? \n\nLa fermeture de Bonita BPM Studio supprime les informations non enregistr\u00e9es dans le {1} et le {2}. Enregistrez tous les \u00e9l\u00e9ments ouverts dans le {2} et exportez vos ressources et applications d\u00e9ploy\u00e9es dans le {1} avant de quitter. \n\nNote \: Dans <A>Pr\u00e9f\u00e9rences > Bases de donn\u00e9es</A>, vous pouvez d\u00e9cocher l''option \u00ab Vider la base de donn\u00e9es \u00e0 la fermeture \u00bb pour conserver ce contenu.
NewButtonLabel=Nouveau
NewButtonTooltip=Cr\u00e9er une nouvelle ressource de projet
organization=Organization
businessDataModel=Mod\u00e8le de Donn\u00e9es M\u00e9tier
bdmAccessControl=Contr\u00f4le d\u2019acc\u00e8s aux donn\u00e9es m\u00e9tier
profile=Profil
applicationDescriptor=Descripteur d'application
applicationPage=Page d'application
layout=Layout
customWidget=Widget personnalis\u00e9
fragment=Fragment
restAPIExtension=Extension d'API REST ...
connectorDef=D\u00e9finition de connecteur ...
connectorImpl=Impl\u00e9mentation de connecteur ...
actorFilterDef=D\u00e9finition de filtre d'acteur ...
actorFilterImpl=Impl\u00e9mentation de filtre d'acteur ...
newGroovy=Groovy ...
theme=\u00a0Th\u00e8me ...
importDragDropInfoTitle=Glisser - D\u00e9poser pour importer
importDragDropInfo=Vous pouvez importer une archive .bos en la d\u00e9posant dans l'explorateur de projet Bonita.\nTous les autres types de fichiers sont ignor\u00e9s.
creatingArchive=Cr\u00e9ation de l'archive %s...
buildError=Une erreur s'est produite pendant la g\u00e9n\u00e9ration de %s
deployErrorTitle=Erreur de d\u00e9ploiement
buildErrorHelp=Le projet n'a pas \u00e9t\u00e9 d\u00e9ploy\u00e9.\nV\u00e9rifiez les \u00e9l\u00e9ments qui le composent puis r\u00e9essayez.\nPour plus d'informations, consultez les logs du Studio (dans le menu `Aide`).
validationErrorTitle=Erreur de validation
validationError=Les erreurs suivantes ont \u00e9t\u00e9 d\u00e9tect\u00e9es dans votre projet.\nLe projet ne peut pas \u00eatre d\u00e9ploy\u00e9 tant que ces erreurs ne sont pas corrig\u00e9es.\nV\u00e9rifiez les fichiers, qui contiennent peut-\u00eatre des erreurs, puis r\u00e9essayez.
bdmGenerationError=Une erreur est survenue \u00e0 la g\u00e9n\u00e9ration de l'archive Java du Mod\u00e8le de Donn\u00e9es M\u00e9tier.
selectArtifactToDeployTitle=S\u00e9lectionner les artefacts \u00e0 d\u00e9ployer
selectArtifactToDeploy=S\u00e9lectionnez les artefacts, v\u00e9rifiez les options et d\u00e9ployez (dans le runtime int\u00e9gr\u00e9 au Studio).
deploy=D\u00e9ployer
selectAll=Tout s\u00e9lectionner
selectNone=Tout d\u00e9s\u00e9lectionner
searchArtifact=Rechercher un artefact ...
expandAll=Tout d\u00e9velopper
collapseAll=Tout r\u00e9duire
buildErrorTitle=Erreur lors de la g\u00e9n\u00e9ration du binaire
build=G\u00e9n\u00e9rer le binaire
deployStatus=Statut du d\u00e9ploiement
deployStatusMessage=Statut du d\u00e9ploiement ci-dessous\u00a0\:
cleanBDMDatabase=Vider la base de donn\u00e9es m\u00e9tier avant le d\u00e9ploiement
deployOptions=Options de d\u00e9ploiement
DeployButtonLabel=D\u00e9ployer
environment=Environnement de configuration des processus
environmentTootltip=Les valeurs des param\u00e8tres, les mappings d'acteurs, les jars tiers, les scripts Groovy, les impl\u00e9mentations  de connecteurs\net de filtres d'acteur s\u00e9lectionn\u00e9es dans la configuration seront int\u00e9gr\u00e9s dans les fichiers bar des processus.
processes=Processus
selectLatestVersion=Ne s\u00e9lectionner que les derni\u00e8res versions des processus
cannotResolveProcess=%s (%s) ne peut pas \u00eatre r\u00e9solu \: %s
cannotEnableProcess=%s (%s) a \u00e9t\u00e9 d\u00e9ploy\u00e9 mais ne peut pas \u00eatre activ\u00e9.
appDescriptorUnknownAppPage=Descripteur d'application '%s'\: La page d'application '%s' n'a pas \u00e9t\u00e9 trouv\u00e9e.
appDescriptorUnknownPageToken=Descripteur d'application '%s'\: Le token de la page d'application '%s' n'existe pas.
appDescriptorUnknownLayoutPage=Descripteur d'application '%s'\: Le layout d'application '%s' n'a pas \u00e9t\u00e9 trouv\u00e9.
appDescriptorUnknownTheme=Descripteur d'application '%s'\: Le th\u00e8me d'application '%s' n'a pas \u00e9t\u00e9 trouv\u00e9.
deploySuccessMsg=Tous les artefacts ont \u00e9t\u00e9 d\u00e9ploy\u00e9s avec succ\u00e8s.
validateProcess=Valider avant le d\u00e9ploiement
portalAppName=Portal
youCanOpenApp=Vous pouvez maintenant ouvrir une application
artifactCounter=%s/%s artefacts s\u00e9lectionn\u00e9s pour \u00eatre d\u00e9ploy\u00e9s
pagesAndLayouts=Pages & Layouts
abort=Abandonner
deployAborted=L'op\u00e9ration de d\u00e9ploiement a \u00e9t\u00e9 interrompue. Tous les artefacts s\u00e9lectionn\u00e9s n'ont pas \u00e9t\u00e9 d\u00e9ploy\u00e9s et l'\u00e9tat initial n'est pas restaur\u00e9. Vous pouvez recommencer le d\u00e9ploiement.
saveOpenedEditorsTitle=Enregistrer avant le d\u00e9ploiement
saveOpenedEditors=Certains artefacts ont \u00e9t\u00e9 modifi\u00e9s. Voulez-vous les enregistrer avant le d\u00e9ploiement ?
savingEditors=Enregistrement du contenu des \u00e9diteurs ...
deploySuccessButNoAppToOpenMsg=Tous les artefacts ont \u00e9t\u00e9 d\u00e9ploy\u00e9s avec succ\u00e8s, mais l'utilisateur par d\u00e9faut actuel (%s) ne peut acc\u00e9der \u00e0 aucune application.
deploying=D\u00e9ploiement de %s ...
deployStatusWithUnresolvedProcessesMessage=Certains processus ne peuvent pas \u00eatre activ\u00e9s en utilisant la configuration actuelle. Veuillez configurer ces processus ou s\u00e9lectionner un autre environnement (Entreprise uniquement).
validateHint=La validation du projet peut prendre du temps\u202f; vous pouvez vouloir\nd\u00e9ployer plus rapidement sans validation cette fois.
applicationAsDisplayName=%s en tant que %s
allArtifactSelected=Tous les artefacts sont s\u00e9lectionn\u00e9s
noArtifactSelected=Aucun artefact s\u00e9lectionn\u00e9
incompatibleModelFoundTitle=Mod\u00e8les incompatibles trouv\u00e9s
incompatibleModelFoundMsg=Des mod\u00e8les incompatibles ont \u00e9t\u00e9 trouv\u00e9s dans le projet. Il n'est pas possible de d\u00e9ployer des mod\u00e8les incompatibles et ils n'appara\u00eetront pas comme des \u00e9l\u00e9ments d\u00e9ployables dans la bo\u00eete de dialogue suivante. D'autres mod\u00e8les seront migr\u00e9s vers la version compatible actuelle.
deployArtifacts=Deploy...