NewProcessButtonLabel=Nova
OpenProcessButtonLabel=Abrir
SaveProcessButtonLabel=Salvar
PrintProcessButtonLabel=Imprimir
CopyButtonLabel=Copiar
PasteButtonLabel=Colar
HelpButtonLabel=Ajuda
WelcomeButtonLabel=Bem-Vindo
openProcessWizardPage_title=Abrir um processo existente
unableTofindLogMessage=Imposs\u00edvel encontrar um ficheiro de log no seu sistema de arquivo. Talvez ele ainda n\u00e3o foi criado.
unableTofindLogTitle=Erro
PreferencesButtonLabel=Prefer\u00eancias
badWorkspaceVersionTitle=Conflito de vers\u00e3o de espa\u00e7o de trabalho
badWorkspaceVersionMessage=Seu espa\u00e7o de trabalho atual {0} tem uma vers\u00e3o diferente ({1}) do BOS Studio {2}. Outro usu\u00e1rio pode ter migrado este espa\u00e7o de trabalho para uma vers\u00e3o mais recente. N\u00e3o \u00e9 mais poss\u00edvel utilizar este espa\u00e7o de trabalho com esta vers\u00e3o do BOS. O espa\u00e7o de trabalho padr\u00e3o ser\u00e1 lan\u00e7ado.
resfreshConnectors=Actualiza\u00e7\u00e3o de conectores...
aboutText={3} Edition\nVersion \: {0}\nVersion id \: {1}\nBuild id \: {2}\nCopyright \u00a9 {4} S.A., 2009-{5}\nAll rights reserved. 
maximizeCoolbarTooltip=Maximizar
reduceCoolbarTooltip=Minimizar
initializingCurrentRepository=Inicializando o projeto atual...
shuttingDown=Parar o motor...
jreNotFoundTitle=Nenhum JRE detectado
jreNotFoundMessage=JRE n\u00e3o encontrado. Voc\u00ea deseja abrir a p\u00e1gina de prefer\u00eancias do Java?
invalidWorkspaceTitle=Espa\u00e7o de trabalho inv\u00e1lido
invalidWorkspace={0} n\u00e3o \u00e9 um espa\u00e7o de trabalho v\u00e1lido. O aplicativo ser\u00e1 inicializado sem importar o espa\u00e7o de trabalho.
failedToOpenLogTitle=Abertura de log falhou
failedToOpenLogMessage=O arquivo de log \u00e9 muito grande para ser aberto com o {1}. \nPor favor, use um editor de texto externo para abrir o arquivo\:{0}
doNotDisplayForOtherDiagrams=N\u00e3o exibir para outros novos diagramas
noProcessAvailable=Nenhum diagrama aberto recentemente
offlineRepositoryTitle=Projeto offline 
offlineRepositoryMessage=O reposit\u00f3rio {0} est\u00e1 atualmente off-line. Voc\u00ea n\u00e3o poder\u00e1 fazer grava\u00e7\u00f5es de altera\u00e7\u00f5es no modo off-line.
incompatibleJavaVersionTitle=Vers\u00e3o Java incompat\u00edvel
incompatibleJavaVersionMessage=Vers\u00e3o Java incompat\u00edvel (%s) detectada.\nA vers\u00e3o necess\u00e1ria para executar %s \u00e9 Java %s.
exitWarningMessage=Sair {0}? \n\nAo fechar o Studio, todo trabalho n\u00e3o salvo em {1} e {2} ser\u00e1 perdido. Salve todos os elementos abertos em {2} e exporte os recursos e aplica\u00e7\u00f5es em {1} antes de sair. \n\nNota\: Em <A>Prefer\u00eancias > Banco de dados</A>, \u00e9 poss\u00edvel desmarcar a op\u00e7\u00e3o "Limpar banco de dados na sa\u00edda" para manter o conte\u00fado do banco de dados.
NewButtonLabel=Nova
NewButtonTooltip=Criar um novo recurso de projeto
organization=Organiza\u00e7\u00e3o
businessDataModel=Modelo de Dados de Neg\u00f3cio
bdmAccessControl=Controle de Acesso do BDM
profile=Perfil
applicationDescriptor=Descritor de Aplica\u00e7\u00e3o
applicationPage=P\u00e1gina da aplica\u00e7\u00e3o
layout=Layout
customWidget=Widgets personalizados
fragment=Fragmentos
restAPIExtension=Extens\u00f5es de API REST...
connectorDef=Defini\u00e7\u00e3o de conector...
connectorImpl=Implementa\u00e7\u00e3o do conector...
actorFilterDef=Defini\u00e7\u00f5es de filtro de ator...
actorFilterImpl=Implementa\u00e7\u00e3o de filtro de ator...
newGroovy=Groovy...
theme=\u00a0Tema...
importDragDropInfoTitle=Importar Arrastar & Soltar
importDragDropInfo=Voc\u00ea pode importar um arquivo Bos, soltando-o no explorador de projeto Bonita.\nOutros arquivos s\u00e3o ignorados.
creatingArchive=Criando arquivo %s...
buildError=Ocorreu um erro ao implantar %s
deployErrorTitle=Erro de implanta\u00e7\u00e3o
buildErrorHelp=O projeto n\u00e3o foi implantado.\nVerifique o artefato envolvido para erros potenciais e tente novamente.\nPara mais informa\u00e7\u00f5es, verifique os logs do Studio (no menu `Ajuda`).
validationErrorTitle=Erro de valida\u00e7\u00e3o
validationError=Os seguintes erros foram detectados no seu projeto.\nO projeto n\u00e3o pode ser implantado at\u00e9 que esses erros sejam corrigidos.\nVerifique os arquivos envolvidos por potenciais erros e tente novamente.
bdmGenerationError=Ocorreu um erro ao implantar o Modelo de Dados de Neg\u00f3cio no motor Java.
selectArtifactToDeployTitle=Selecione artefatos para implantar
selectArtifactToDeploy=Selecione os artefatos, verifique as op\u00e7\u00f5es e implante (para o Studio incorporado runtime).
deploy=Implantado
selectAll=Selecionar todos
selectNone=Selecione nenhum
searchArtifact=Pesquisar artefatos
expandAll=Expandir tudo
collapseAll=Recolher tudo
buildErrorTitle=Erro de compila\u00e7\u00e3o
build=Compilar
deployStatus=Status da implanta\u00e7\u00e3o
deployStatusMessage=Status da implanta\u00e7\u00e3o abaixo\:
cleanBDMDatabase=Limpar banco de dados BDM antes de ser instalado
deployOptions=Op\u00e7\u00f5es de implanta\u00e7\u00e3o
DeployButtonLabel=Implantado
environment=Ambiente de configura\u00e7\u00e3o do processo
environmentTootltip=Valores de par\u00e2metros, mapeamentos de ator, jars de terceiros, scripts Groovy, conectores e implementa\u00e7\u00e3o de filtros de ator selecionados na configura\u00e7\u00e3o ser\u00e3o incorporados no arquivo bar do processo.
processes=Processos
selectLatestVersion=Selecionar apenas vers\u00f5es de processos mais recentes
cannotResolveProcess=%s (%s) n\u00e3o pode ser resolvido\: %s
cannotEnableProcess=%s (%s) foi implantado mas n\u00e3o pode ser habilitado.
appDescriptorUnknownAppPage=Descritor da aplica\u00e7\u00e3o '%s'\: p\u00e1gina da aplica\u00e7\u00e3o '%s' n\u00e3o foi encontrado.
appDescriptorUnknownPageToken=Descritor da aplica\u00e7\u00e3o '%s'\: token da p\u00e1gina da aplica\u00e7\u00e3o '%s' n\u00e3o existe.
appDescriptorUnknownLayoutPage=Descritor da aplica\u00e7\u00e3o '%s'\: layout da aplica\u00e7\u00e3o '%s' n\u00e3o foi encontrado.
appDescriptorUnknownTheme=Descritor da aplica\u00e7\u00e3o '%s'\: tema da aplica\u00e7\u00e3o '%s' n\u00e3o foi encontrado.
deploySuccessMsg=Todos os artefatos foram implantados com sucesso.
validateProcess=Validar antes de implantar
youCanOpenApp=Voc\u00ea pode abrir uma aplica\u00e7\u00e3o
artifactCounter=%s/%s artefatos selecionados para serem implantados
pagesAndLayouts=P\u00e1ginas & Layouts
abort=Abortar
deployAborted=A opera\u00e7\u00e3o de implanta\u00e7\u00e3o foi abortada. Nem todos os artefatos selecionados foram implantados. Nenhum rollback \u00e9 executado. Voc\u00ea pode querer implantar novamente.
saveOpenedEditorsTitle=Salvar antes de implantar
saveOpenedEditors=Alguns artefatos foram modificados. Voc\u00ea quer salv\u00e1-los antes da implanta\u00e7\u00e3o?
savingEditors=Salvando editores...
deploySuccessButNoAppToOpenMsg=Todos os artefatos foram implantados com sucesso, mas o usu\u00e1rio padr\u00e3o atual (%s) n\u00e3o pode acessar qualquer aplicativo.
deploying=Implantando %s...
deployStatusWithUnresolvedProcessesMessage=Alguns processos n\u00e3o podem ser habilitados usando a configura\u00e7\u00e3o atual. Por favor, configure esses processos ou selecione outro ambiente (apenas Enterprise).
validateHint=A valida\u00e7\u00e3o do projeto pode levar tempo; voc\u00ea pode querer implantar mais r\u00e1pido sem valida\u00e7\u00e3o desta vez.
applicationAsDisplayName=%s como %s
allArtifactSelected=Todos os artefatos selecionados para serem implantados
noArtifactSelected=Nenhum artefato selecionado para ser implantado
incompatibleModelFoundTitle=Modelos incompat\u00edveis encontrados
incompatibleModelFoundMsg=Foram encontrados modelos incompat\u00edveis no projeto. N\u00e3o \u00e9 poss\u00edvel implantar modelos incompat\u00edveis e eles n\u00e3o aparecer\u00e3o como elemento implant\u00e1vel na caixa de di\u00e1logo seguinte. Alguns outros modelos ser\u00e3o migrados para a vers\u00e3o compat\u00edvel atual.
deployArtifacts=Implantar...
extendProjectTitle=Estender projeto
extendProjectDescription=Estenda seu projeto Bonita com extens\u00f5es oficiais Bonita. Conectores s\u00e3o usados para conectar seu projeto Bonita a sistemas e filtros de ator s\u00e3o usados para filtrar usu\u00e1rios em tarefas humanas.
addToProject=Adicionar ao projeto
removeFromProject=Remover do projeto
find=Pesquisar
type=Tipo
all=Tudo
extensionSelectedForAdd=Extens\u00e3o selecionada para ser adicionada no final.
addDependenciesError=Ocorreu um erro ao adicionar nova depend\u00eancia de Maven.
noResultFound=Nenhum resultado encontrado.
version=Vers\u00e3o
install=Instale
fetchingExtensions=Conectando-se ao Bonita Marketplace...
installingExtensions=Instalando extens\u00f5es...
filteringExtensions=Filtrando extens\u00f5es...
incompatibleExtension=Atualize para uma vers\u00e3o mais recente para usar esta extens\u00e3o.
incompatibleExtensionTitle=Incompat\u00edvel com a vers\u00e3o atual do Studio
newVersionAvailable=Nova vers\u00e3o dispon\u00edvel
dependencyUpdatable=O seu projeto j\u00e1 depende desta extens\u00e3o em uma vers\u00e3o antiga. Selecione para atualiz\u00e1-lo para a vers\u00e3o mais recente.
projectOverview=Vis\u00e3o Geral do projeto
openMarketplace=Abrir Marketplace
openMarketplaceTooltip=Estenda seu projeto instalando extens\u00f5es dispon\u00edveis no Bonita Marketplace.
projectOverviewTitle=Vis\u00e3o geral
bonitaMarketplace=Bonita Marketplace
removeExtensionTooltip=Remover extens\u00e3o do projeto
details=Detalhes
removeExtensionConfirmationTitle=Remover extens\u00e3o
removeExtensionConfirmation=Remover a extens\u00e3o '%s' do projeto?
extensionLoadingErrorTitle=Erro ao carregar extens\u00f5es
extensionLoadingError=Ocorreu um erro ao carregar extens\u00f5es. Verifique os logs para mais detalhes.
importExtensionTitle=Adicionar '%s'
importExtension=Adicione uma extens\u00e3o como uma depend\u00eancia de Maven ou um arquivo.
importExtensionButtonLabel=Adicionar uma extens\u00e3o personalizada
unknownExtensionsTitle=Outras depend\u00eancias
deleteUnknownTooltip=Remova as extens\u00f5es selecionadas do projeto.
delete=Excluir
importRemoteDependencyTip=Adicione um %s , especificando manualmente as coordenadas de depend\u00eancia Maven. Um acesso \u00e0 Internet para acessar a Central Maven \u00e9 altamente recomendado. Voc\u00ea pode <a>configurar reposit\u00f3rios remotos</a> adicionais, se necess\u00e1rio.
dependencyNotFoundWhenImporting=N\u00e3o foi poss\u00edvel resolver %s nos reposit\u00f3rios remotos configurados.
dependencyCoordinate=Coordenadas de depend\u00eancia
manual=De um reposit\u00f3rio
fromFile=Do arquivo
browse=Navegar...
file=Selecione um arquivo para importar (%s apenas arquivos)
importFromFileTip=Adicionar um %s a partir de um arquivo local. Se o arquivo selecionado n\u00e3o existir em nenhum dos reposit\u00f3rios remotos configurados, a depend\u00eancia ser\u00e1 instalada no reposit\u00f3rio local.
resolvedDependency=Depend\u00eancia resolvida com %s
cannotResolveDependencyInstalledLocally=N\u00e3o \u00e9 poss\u00edvel resolver depend\u00eancia. Ser\u00e1 instalado no reposit\u00f3rio local.
editProjectMetadata=Editar informa\u00e7\u00f5es do projeto
editProjectMetadataDescription=Editar as informa\u00e7\u00f5es atuais do projeto (nome, descri\u00e7\u00e3o, vers\u00e3o, coordenadas maven).
name=Nome
description=Descri\u00e7\u00e3o\u0009
updatingProjectMetadata=Atualizando metadados do projeto...
addDatabaseDriverTitle=Adicionar um driver de banco de dados
addDatabaseDriverDesc=Instalar um driver de banco de dados JDBC para usar com o conector de banco de dados. Se precisar utilizar um driver de banco de dados n\u00e3o sugerido abaixo, voc\u00ea pode import\u00e1-lo manualmente.
addDatabaseDriverQuestion=Voc\u00ea acabou de instalar o conector de banco de dados. Voc\u00ea precisar\u00e1 de um driver de banco de dados JDBC para executar este conector. Voc\u00ea deseja instalar um driver de banco de dados a partir da nossa lista sugerida? Se n\u00e3o, voc\u00ea pode fazer isso mais tarde ou instal\u00e1-lo manualmente.
databaseDriver=Driver de banco de dados
engineRestartWarning=Web server ser\u00e1 reiniciado
enhanceProject=Melhore seu projeto com novos recursos adicionando extens\u00f5es do Bonita Marketplace ou importando suas pr\u00f3prias extens\u00f5es\! 
upgradeBonitaExtensionTooltip=Uma nova vers\u00e3o dessa extens\u00e3o est\u00e1 dispon\u00edvel no Bonita Marketplace.
upgradeBonitaExtension=Atualizar para a vers\u00e3o mais recente
removeExtension=Remover
updateExtensionConfirmationTitle=Atualizar confirma\u00e7\u00e3o de extens\u00e3o
updateExtensionConfirmation=Atualizar a extens\u00e3o '%s' de %s para %s?
newProjectWizardTitle=Novo projeto
newProjectWizardDescription=Criar um novo projeto com as seguintes informa\u00e7\u00f5es
create=Criar
dependencyAlreadyExistsInSameVersion=O projeto j\u00e1 usa essa extens\u00e3o na vers\u00e3o '%s'.
dependencyAlreadyExistsInDifferentVersion=O projeto j\u00e1 usa esta extens\u00e3o na vers\u00e3o '%s'. Atualize o campo vers\u00e3o para usar outra vers\u00e3o desta extens\u00e3o. 
upgradeExtension=Atualizar
upgradeExtensionTooltip=Atualizar a vers\u00e3o desta extens\u00e3o
addExtensionPageTitle=Adicionar extens\u00f5es
addExtensionPageDescription=Voc\u00ea pode adicionar extens\u00f5es ao seu projeto agora ou mais tarde atrav\u00e9s da vis\u00e3o geral do projeto.
extensions=Extens\u00f5es
modify=Modificar
repositories=Reposit\u00f3rios
repositoriesDescription=Configure os reposit\u00f3rios maven usados para recuperar extens\u00f5es Bonita. A autentica\u00e7\u00e3o \u00e9 gerenciada na se\u00e7\u00e3o de servidores.
servers=Servidores
proxies=Proxies
mirrors=Espelhos
id=ID
url=URL
releases=Vers\u00f5es
snapshots=Snapshots
enabled=Ativado
updatePolicy=Atualizar pol\u00edtica
checksumPolicy=Pol\u00edtica de checksum
add=Adicionar
addRepositoryTooltip=Adicionar um novo reposit\u00f3rio acess\u00edvel \u00e0 sua configura\u00e7\u00e3o de maven.
deleteRepositoryTooltip=Remova este reposit\u00f3rio da sua configura\u00e7\u00e3o maven. Voc\u00ea n\u00e3o ser\u00e1 capaz de recuperar mais extens\u00f5es deste reposit\u00f3rio. 
mavenProfile=Perfil de Maven
mavenProfileHint=Maven configura\u00e7\u00e3o de reposit\u00f3rio \u00e9 definida em perfis.\nRecomendamos o uso do perfil Bonita para configurar os reposit\u00f3rios usados pelo seu projeto Bonita.
encryptionMasterPassword=Senha mestra (criptografada)
updateMasterPasswordWarning=A senha mestra \u00e9 usada para criptografar as senhas do seu servidor.\nSe voc\u00ea atualizar a senha mestra existente, todas as senhas devem ser geradas novamente.
encryptionLink=<a>A criptografia de senha</a> \u00e9 opcional, mas recomendado se seu arquivo de configura\u00e7\u00e3o maven (settings.xml) for compartilhado.
addServerTooltip=Adicionar um novo servidor \u00e0 sua configura\u00e7\u00e3o de maven.
deleteServerTooltip=Remover este servidor da sua configura\u00e7\u00e3o de maven.
serversLink=<a>Servidores</a> s\u00e3o usados para gerenciar reposit\u00f3rios e espelhar autentica\u00e7\u00e3o.
removeServerConfirmationTitle=Remover confirma\u00e7\u00e3o do servidor
removeServerConfirmation=Remover o servidor '%s' da sua configura\u00e7\u00e3o maven ?
removeRepositoryConfirmationTitle=Remover confirma\u00e7\u00e3o do reposit\u00f3rio
removeRepositoryConfirmation=Remover o reposit\u00f3rio '%s' da sua configura\u00e7\u00e3o maven ?
serverId=ID
serverIdHint=Este \u00e9 o ID do servidor (n\u00e3o do usu\u00e1rio para logar).\nDeve corresponder ao elemento de id do reposit\u00f3rio/espelho que Maven tenta se conectar.
userPasswordAuthentication=Usu\u00e1rio / senha
sshAuthentication=SSH
username=Nome de usu\u00e1rio
password=Senha 
authentication=Autentica\u00e7\u00e3o
showPassword=Mostrar senha
encryptPassword=Criptografar senha
encryptButtonTooltip=Uma senha mestra \u00e9 necess\u00e1ria para executar a criptografia.
privateKey=Chave privada
passphrase=Palavra-chave
showPassphrase=Mostrar palavra chave
clearPasswordTooltip=O campo senha deve estar vazio para usar autentica\u00e7\u00e3o ssh.
clearPassword=Limpar senha
error=Erro
proxiesLink=Configure maven para trabalhar com <a>proxies</a>. Apenas um proxy pode estar ativo de cada vez.
addProxyTooltip=Adicionar um novo proxy \u00e0 sua configura\u00e7\u00e3o de maven.
deleteProxyTooltip=Remover este proxy da sua configura\u00e7\u00e3o de maven.
removeProxyConfirmationTitle=Remover confirma\u00e7\u00e3o de proxy
removeProxyConfirmation=Remover o proxy '%s' da sua configura\u00e7\u00e3o maven ?
active=Ativo
protocol=Protocolo
host=Servidor
port=Porta 
intValueExpected=N\u00famero esperado.
nonProxyHost=N\u00e3o servidores de proxy
nonProxyHostsTootltip=Esta \u00e9 uma lista de hosts que n\u00e3o deve ser procurada.\nO delimitador da lista \u00e9 o tipo esperado do servidor proxy.\nPipe ou v\u00edrgulas delimitadoras s\u00e3o comuns.
mirrorsLink=Configurar <a>espelhos</a> para seus reposit\u00f3rios.
addMirrorTooltip=Adicionar um novo espelho \u00e0 sua configura\u00e7\u00e3o de maven.
deleteMirrorTooltip=Remover este espelho da sua configura\u00e7\u00e3o de maven.
removeMirrorConfirmationTitle=Remover confirma\u00e7\u00e3o do espelho
removeMirrorConfirmation=Remover o espelho '%s' da sua configura\u00e7\u00e3o de maven ?
mirrorOf=Espelho de
mirrorUrlTooltip=A URL base deste espelho.\nO sistema de compila\u00e7\u00e3o usar\u00e1 esta URL para se conectar a um reposit\u00f3rio em vez da URL original do reposit\u00f3rio.
mirrorOfTooltip=A identifica\u00e7\u00e3o do reposit\u00f3rio do qual isso \u00e9 um espelho.\nIsso n\u00e3o pode coincidir com o id do espelho.
activate=Ativar
activateProxyTooltip=Definir o proxy selecionado como ativo
restoreDefaultConfirmationTitle=Confirma\u00e7\u00e3o de restaura\u00e7\u00e3o padr\u00e3o
restoreDefaultConfirmation=Apagar todas as altera\u00e7\u00f5es na configura\u00e7\u00e3o do seu maven?
updatingConfiguration=Atualizando configura\u00e7\u00f5es...
preparingDefinitionUpdate=Preparando atualiza\u00e7\u00e3o da defini\u00e7\u00e3o...
updatePreview=Visualiza\u00e7\u00e3o Atualiza\u00e7\u00e3o de defini\u00e7\u00e3o...
updateProcessesTitle=Pr\u00e9-visualiza\u00e7\u00e3o de atualiza\u00e7\u00e3o de processos
otherDependencyUpdateMessage=Uma extens\u00e3o foi atualizada ou removida e as configura\u00e7\u00f5es do processo precisam ser atualizadas de acordo. Voc\u00ea pode\:\n
updateActionsMessage=\u2022 Abortar\: a extens\u00e3o ser\u00e1 revertida para seu estado anterior\n  \u2022 Ignore as altera\u00e7\u00f5es. Os processos n\u00e3o ser\u00e3o alterados e a atualiza\u00e7\u00e3o manual \u00e9 necess\u00e1ria\n  \u2022 Prosseguir com a atualiza\u00e7\u00e3o de processos
definitionUpateMessage=Defini\u00e7\u00e3o(s) filtro de conector/ator foram atualizados ou removidos e as configura\u00e7\u00f5s deles precisam ser atualizadas adequadamente. Voc\u00ea pode\:\n
abortingUpdate=Cancelando atualiza\u00e7\u00e3o...
definitionUpdateWithBreakingChanges=Algumas configura\u00e7\u00f5es n\u00e3o podem ser atualizadas automaticamente devido a quebras de altera\u00e7\u00f5es. Voc\u00ea ter\u00e1 que atualiz\u00e1-las manualmente mais tarde.
definitionRemovedDescription=%s (%s) a defini\u00e7\u00e3o foi removida. %s configura\u00e7\u00e3o(\u00f5es) ser\u00e3o exclu\u00eddas.
preparingProcessConfigurationUpdate=Preparando atualiza\u00e7\u00e3o de configura\u00e7\u00e3o do processo...
jarFileRemovedChangeDescription=%s ser\u00e1 removido
jarFileUpdatedChangeDescription=%s (%s \u2192 %s)
configurationToUpdateFound=%s configura\u00e7\u00e3o(\u00f5es) de processo para atualizar encontradas.
jarFileAddedChangeDescription=%s ser\u00e1 temporariamente adicionado.
back=Voltar
connectors=Conectores
connectorsHint=Resumo dos conectores trazidos pela extens\u00e3o %s .\nUm conector \u00e9 feito de uma defini\u00e7\u00e3o e implementa\u00e7\u00e3o. Pode prever-se uma defini\u00e7\u00e3o de v\u00e1rias implementa\u00e7\u00f5es.
implementations=Implementa\u00e7\u00e3o(s)\:
preparingUpdate=Preparando atualiza\u00e7\u00e3o da extens\u00e3o...
computingPreview=Calculando pr\u00e9-visualiza\u00e7\u00e3o...
applyingChanges=Aplicar mudan\u00e7as...
actorFilters=Filtros de ator
actorFiltersHint=Resumo dos filtros de ator trazidos pela extens\u00e3o %s .\nUm filtro de ator \u00e9 feito de uma defini\u00e7\u00e3o e uma implementa\u00e7\u00e3o. V\u00e1rias implementa\u00e7\u00f5es podem ser fornecidas para uma determinada defini\u00e7\u00e3o.
restApiExtensions=Extens\u00f5es de API REST
restApiDetailsHint=Resumo da API REST trazida pela extens\u00e3o %s .\nUma API REST \u00e9 definida por um m\u00e9todo HTTP, um modelo de caminho e uma ou v\u00e1rias permiss\u00f5es.\nUma permiss\u00e3o \u00e9 um mapeamento para a organiza\u00e7\u00e3o que concede acesso \u00e0 API.
httpMethodMissing=M\u00e9todo HTTP n\u00e3o encontrado.
pathMissing=Caminho n\u00e3o encontrado.
permissionsMissing=As permiss\u00f5es est\u00e3o faltando.
permissions=Permiss\u00f5es\:
path=Caminho\:
copyToClipboard=Copiar para \u00e1rea de transfer\u00eancia
editPermissionsMapping=Editar mapeamento de permiss\u00f5es
usages=Usos
connectorUsages=Usos do conector %s.
findUsages=Encontrar usos
findingUsages=Encontrar usos...
diagramNotFound=Diagrama n\u00e3o encontrado
diagramNotFoundMessage=O diagrama do processo %s n\u00e3o foi encontrado.
process=Processo\:
connectorUsagesDescription=A \u00e1rvore abaixo exibe todos os usos do conector %s, ou seja, todas as atividades do processo que est\u00e3o usando este conector.
noConnectorUsagesFound=O conector %s n\u00e3o est\u00e1 sendo usado no seu projeto Bonita.
search=Pesquisar
actorFilterUsagesDescription=A \u00e1rvore abaixo exibe todos os usos do filtro de ator %s, ou seja, todas as atividades de processo que est\u00e3o usando esse filtro de personagem.
addConnector=Conector...
addActorFilter=Filtros de ator...
addTheme=Tema...
addRestApiExtension=Extens\u00f5es de API REST...
addOther=Outro...
legacyArchiveFormatHint=O formato do arquivo zip n\u00e3o \u00e9 suportado.
extension=extens\u00f5es
extensionIsNotAConnector=Esta extens\u00e3o n\u00e3o \u00e9 um conector.
extensionIsNotAnActorFilter=Esta extens\u00e3o n\u00e3o \u00e9 um filtro de ator.
extensionIsNotARestApiExtension=Esta extens\u00e3o n\u00e3o \u00e9 uma extens\u00e3o de API REST.
extensionIsNotAThemeExtension=Esta extens\u00e3o n\u00e3o \u00e9 um tema.
cannotAccessMarketplace=N\u00e3o \u00e9 poss\u00edvel acessar o Bonita BPM Marketplace
cannotLoadMarketplaceMessage=O Bonita Marketplace n\u00e3o pode ser carregado. Ele pode estar relacionado a um problema de conectividade com a Internet.
cannotUpdateMarketplaceMessage=O Bonita Marketplace n\u00e3o p\u00f4de ser atualizado. Pode ser relacionado a um problema de conectividade com a Internet.
localDependencyTooltip=Depend\u00eancia local - Essa depend\u00eancia foi importada manualmente, e \u00e9 armazenada na loja de depend\u00eancias locais no sistema de arquivos.
remoteDependencyTooltip=Depend\u00eancia externa - Essa depend\u00eancia \u00e9 recuperada atrav\u00e9s do Maven de um reposit\u00f3rio remoto.
marketplaceDependencyTooltip=Depend\u00eancia Bonita - Esta depend\u00eancia \u00e9 fornecida pelo Bonita Marketplace, e \u00e9 recuperada atrav\u00e9s do Maven do reposit\u00f3rio central.
editMavenCoordinates=Editar coordenadas maven
editMavenCoordinatesTooltip=Voc\u00ea pode editar as coordenadas dos maven (groupId, artefatId, version & classifier) de depend\u00eancias locais n\u00e3o constru\u00eddas com Maven.
mavenPropertiesMissing=Faltam informa\u00e7\u00f5es sobre propriedades do Maven do jr importado, certifique-se de construir este jar com o Maven. O jar legado n\u00e3o pode ser importado.
extensionView=Extens\u00f5es
extensionViewTooltip=Abra a vista de extens\u00f5es do projeto, para obter uma vis\u00e3o geral das extens\u00f5es do seu projeto e atualiz\u00e1-las.
elementView=Elementos
elementViewTooltip=Abra a visualiza\u00e7\u00e3o dos elementos, para ter um visualiza\u00e7\u00e3o geral dos elementos que comp\u00f5em seu projeto.
repositoryIdMandatory=O ID do reposit\u00f3rio \u00e9 obrigat\u00f3rio.
repositoryNameMandatory=O reposit\u00f3rio '%s' n\u00e3o tem um nome, este campo \u00e9 obrigat\u00f3rio.
repositoryUrlMandatory=O reposit\u00f3rio '%s' n\u00e3o tem uma URL, este campo \u00e9 obrigat\u00f3rio.
invalidMavenConfigurationTitle=Configura\u00e7\u00f5es de maven inv\u00e1lidas
invalidMavenConfiguration=O arquivo de configura\u00e7\u00f5es do maven (%s) cont\u00e9m erros.
proxyIdMandatory=O ID do proxy \u00e9 obrigat\u00f3rio.
proxyHostMandatory=O proxy '%s' n\u00e3o tem um host, este campo \u00e9 obrigat\u00f3rio.
mirrorIdMandatory=ID do espelhamento \u00e9 obrigat\u00f3rio.
mirrorUrlMandatory=O reposit\u00f3rio '%s' n\u00e3o tem uma URL, este campo \u00e9 obrigat\u00f3rio.
mavenConfigurationUpdatedTitle=Configura\u00e7\u00f5es do Maven atualizadas
mavenConfigurationUpdated=O arquivo de configura\u00e7\u00f5es maven (%s) foi atualizado.
projectDoesntContainsElement=Este projeto ainda n\u00e3o cont\u00e9m nenhum %s.
newElementTitle=Criar um novo %s
noDescription=Descri\u00e7\u00e3o n\u00e3o fornecida
diagramZoomHint=Vis\u00e3o geral de todos os diagramas no projeto atual.
cannotReachMavenCentralRepositoryTitle=N\u00e3o foi poss\u00edvel acessar o reposit\u00f3rio central Maven
cannotReachMavenCentralRepositoryMessage=O Studio n\u00e3o consegue acessar o reposit\u00f3rio central do Maven. \u00c9 altamente recomend\u00e1vel configurar um acesso \u00e0 central do Maven para beneficiar das extens\u00f5es fornecidas pela Bonita.\nVerifique\:\n\u2022 Sua conex\u00e3o com a Internet\n\u2022 Configura\u00e7\u00f5es de proxy\n\u2022 Sua conex\u00e3o VPN se um espelho estiver configurado\n\u2022 <a>Status Central Maven</a>
validateExistingMavenConfigurationMessage=Parece que voc\u00ea j\u00e1 tem uma configura\u00e7\u00e3o de Maven existente (%s). Certifique-se de que esta configura\u00e7\u00e3o \u00e9 v\u00e1lida.
configure=Configurar
retry=Repetir
returnToElementsView=Retornar \u00e0 vis\u00e3o dos elementos.
returnToExtensionView=Retornar \u00e0 vis\u00e3o de extens\u00f5es.
addExtensionMenuLabel=Extens\u00e3o
groupIdTootltip=Id do Maven namespace
artifactIdTootltip=ID Maven de projeto t\u00e9cnico.\nDerivado do nome do projeto, se vazio.
depArtifactIdTootltip=O nome do jar sem vers\u00e3o
classifierTooltip=O classificador distingue os artefatos que foram constru\u00eddos do mesmo POM, mas diferem no conte\u00fado.\n\u00c9 uma string opcional e arbitr\u00e1ria que - se presente - \u00e9 anexada ao nome do artefato logo ap\u00f3s o n\u00famero da vers\u00e3o.
projectElements=Elementos
bonitaExtensions=Extens\u00f5es Bonita BPM
bonitaExtensionTooltip=Extens\u00f5es manipuladas por Bonita\: Conectores, filtros Actor, extens\u00f5es API REST e temas.
otherExtensionsTooltip=Drivers de banco de dados, ou qualquer tipo de depend\u00eancia que voc\u00ea possa precisar em seu aplicativo (depend\u00eancia Java...)
projectElementsTooltip=Principais elementos que comp\u00f5em um projeto Bonita.
showMore=Mostre mais
viewSource=Ver fonte
viewSourceTooltip=Visitar %s
processDiagram=Diagrama de processo
refresh=Atualize
refreshTooltip=Atualizar projeto