NewProcessButtonLabel=Nova
OpenProcessButtonLabel=Abrir
SaveProcessButtonLabel=Salvar
PrintProcessButtonLabel=Imprimir
CopyButtonLabel=Copiar
PasteButtonLabel=Colar
HelpButtonLabel=Ajuda
WelcomeButtonLabel=Bem-Vindo
openProcessWizardPage_title=Abrir um processo existente
unableTofindLogMessage=Imposs\u00edvel encontrar um ficheiro de log no seu sistema de arquivo. Talvez ele ainda n\u00e3o foi criado.
unableTofindLogTitle=Erro
PreferencesButtonLabel=Prefer\u00eancias
badWorkspaceVersionTitle=Conflito de vers\u00e3o de espa\u00e7o de trabalho
badWorkspaceVersionMessage=Seu espa\u00e7o de trabalho atual {0} tem uma vers\u00e3o diferente ({1}) do BOS Studio {2}. Outro usu\u00e1rio pode ter migrado este espa\u00e7o de trabalho para uma vers\u00e3o mais recente. N\u00e3o \u00e9 mais poss\u00edvel utilizar este espa\u00e7o de trabalho com esta vers\u00e3o do BOS. O espa\u00e7o de trabalho padr\u00e3o ser\u00e1 lan\u00e7ado.
resfreshConnectors=Actualiza\u00e7\u00e3o de conectores...
aboutText={3} Edition\nVersion \: {0}\nVersion id \: {1}\nBuild id \: {2}\nCopyright \u00a9 {4} S.A., 2009-{5}\nAll rights reserved. 
maximizeCoolbarTooltip=Maximizar
reduceCoolbarTooltip=Minimizar
initializingCurrentRepository=Inicializando o projeto atual...
shuttingDown=Parar o motor...
jreNotFoundTitle=Nenhum JRE detectado
jreNotFoundMessage=JRE n\u00e3o encontrado. Voc\u00ea deseja abrir a p\u00e1gina de prefer\u00eancias do Java?
invalidWorkspaceTitle=Espa\u00e7o de trabalho inv\u00e1lido
invalidWorkspace={0} n\u00e3o \u00e9 um espa\u00e7o de trabalho v\u00e1lido. O aplicativo ser\u00e1 inicializado sem importar o espa\u00e7o de trabalho.
failedToOpenLogTitle=Abertura de log falhou
failedToOpenLogMessage=O arquivo de log \u00e9 muito grande para ser aberto com o {1}. \nPor favor, use um editor de texto externo para abrir o arquivo\:{0}
doNotDisplayForOtherDiagrams=N\u00e3o exibir para outros novos diagramas
noProcessAvailable=Nenhum diagrama aberto recentemente
offlineRepositoryTitle=Projeto offline 
offlineRepositoryMessage=O reposit\u00f3rio {0} est\u00e1 atualmente off-line. Voc\u00ea n\u00e3o poder\u00e1 fazer grava\u00e7\u00f5es de altera\u00e7\u00f5es no modo off-line.
incompatibleJavaVersionTitle=Vers\u00e3o Java incompat\u00edvel
incompatibleJavaVersionMessage=Voc\u00ea est\u00e1 executando %s usando uma vers\u00e3o Java incompat\u00edvel (%s).\n Vers\u00f5es suportadas s\u00e3o\: %s.
exitWarningMessage=Sair {0}? \n\nAo fechar o Studio, todo trabalho n\u00e3o salvo em {1} e {2} ser\u00e1 perdido. Salve todos os elementos abertos em {2} e exporte os recursos e aplica\u00e7\u00f5es em {1} antes de sair. \n\nNota\: Em <A>Prefer\u00eancias > Banco de dados</A>, \u00e9 poss\u00edvel desmarcar a op\u00e7\u00e3o "Limpar banco de dados na sa\u00edda" para manter o conte\u00fado do banco de dados.
NewButtonLabel=Nova
NewButtonTooltip=Criar um novo recurso de projeto
organization=Organization
businessDataModel=Modelo de Dados de Neg\u00f3cio
bdmAccessControl=Controle de Acesso do BDM
profile=Perfil
applicationDescriptor=Descritor de Aplica\u00e7\u00e3o
applicationPage=P\u00e1gina da aplica\u00e7\u00e3o
layout=Layout
customWidget=Widgets personalizados
fragment=Fragmentos
restAPIExtension=Extens\u00f5es de API REST...
connectorDef=Defini\u00e7\u00e3o de conector...
connectorImpl=Implementa\u00e7\u00e3o do conector...
actorFilterDef=Defini\u00e7\u00f5es de filtro de ator...
actorFilterImpl=Implementa\u00e7\u00e3o de filtro de ator...
newGroovy=Groovy...
theme=\u00a0Tema...
importDragDropInfoTitle=Importar Arrastar & Soltar
importDragDropInfo=Voc\u00ea pode importar um arquivo Bos, soltando-o no explorador de projeto Bonita.\nOutros arquivos s\u00e3o ignorados.
creatingArchive=Criando arquivo %s...
buildError=Ocorreu um erro ao implantar %s
deployErrorTitle=Erro de implanta\u00e7\u00e3o
buildErrorHelp=O projeto n\u00e3o foi implantado.\nVerifique o artefato envolvido para erros potenciais e tente novamente.\nPara mais informa\u00e7\u00f5es, verifique os logs do Studio (no menu `Ajuda`).
validationErrorTitle=Erro de valida\u00e7\u00e3o
validationError=Os seguintes erros foram detectados no seu projeto.\nO projeto n\u00e3o pode ser implantado at\u00e9 que esses erros sejam corrigidos.\nVerifique os arquivos envolvidos por potenciais erros e tente novamente.
bdmGenerationError=Ocorreu um erro ao implantar o Modelo de Dados de Neg\u00f3cio no motor Java.
selectArtifactToDeployTitle=Selecione artefatos para implantar
selectArtifactToDeploy=Selecione os artefatos, verifique as op\u00e7\u00f5es e implante (para o Studio incorporado runtime).
deploy=Implantado
selectAll=Selecionar todos
selectNone=Selecione nenhum
searchArtifact=Pesquisar artefatos
expandAll=Expandir tudo
collapseAll=Recolher tudo
buildErrorTitle=Erro de compila\u00e7\u00e3o
build=Compilar
deployStatus=Status da implanta\u00e7\u00e3o
deployStatusMessage=Status da implanta\u00e7\u00e3o abaixo\:
cleanBDMDatabase=Limpar banco de dados BDM antes de ser instalado
deployOptions=Op\u00e7\u00f5es de implanta\u00e7\u00e3o
DeployButtonLabel=Implantado
environment=Ambiente de configura\u00e7\u00e3o do processo
environmentTootltip=Valores de par\u00e2metros, mapeamentos de ator, jars de terceiros, scripts Groovy, conectores e implementa\u00e7\u00e3o de filtros de ator selecionados na configura\u00e7\u00e3o ser\u00e3o incorporados no arquivo bar do processo.
processes=Processos
selectLatestVersion=Selecionar apenas vers\u00f5es de processos mais recentes
cannotResolveProcess=%s (%s) n\u00e3o pode ser resolvido\: %s
cannotEnableProcess=%s (%s) foi implantado mas n\u00e3o pode ser habilitado.
appDescriptorUnknownAppPage=Descritor da aplica\u00e7\u00e3o '%s'\: p\u00e1gina da aplica\u00e7\u00e3o '%s' n\u00e3o foi encontrado.
appDescriptorUnknownPageToken=Descritor da aplica\u00e7\u00e3o '%s'\: token da p\u00e1gina da aplica\u00e7\u00e3o '%s' n\u00e3o existe.
appDescriptorUnknownLayoutPage=Descritor da aplica\u00e7\u00e3o '%s'\: layout da aplica\u00e7\u00e3o '%s' n\u00e3o foi encontrado.
appDescriptorUnknownTheme=Descritor da aplica\u00e7\u00e3o '%s'\: tema da aplica\u00e7\u00e3o '%s' n\u00e3o foi encontrado.
deploySuccessMsg=Todos os artefatos foram implantados com sucesso.
validateProcess=Validar antes de implantar
portalAppName=Portal
youCanOpenApp=Voc\u00ea pode abrir uma aplica\u00e7\u00e3o
artifactCounter=%s/%s artefatos selecionados para serem implantados
pagesAndLayouts=P\u00e1ginas & Layouts
abort=Abortar
deployAborted=A opera\u00e7\u00e3o de implanta\u00e7\u00e3o foi abortada. Nem todos os artefatos selecionados foram implantados. Nenhum rollback \u00e9 executado. Voc\u00ea pode querer implantar novamente.
saveOpenedEditorsTitle=Salvar antes de implantar
saveOpenedEditors=Alguns artefatos foram modificados. Voc\u00ea quer salv\u00e1-los antes da implanta\u00e7\u00e3o?
savingEditors=Salvando editores...
deploySuccessButNoAppToOpenMsg=Todos os artefatos foram implantados com sucesso, mas o usu\u00e1rio padr\u00e3o atual (%s) n\u00e3o pode acessar qualquer aplicativo.
deploying=Implantando %s...
deployStatusWithUnresolvedProcessesMessage=Alguns processos n\u00e3o podem ser habilitados usando a configura\u00e7\u00e3o atual. Por favor, configure esses processos ou selecione outro ambiente (apenas Enterprise).
validateHint=A valida\u00e7\u00e3o do projeto pode levar tempo; voc\u00ea pode querer implantar mais r\u00e1pido sem valida\u00e7\u00e3o desta vez.
applicationAsDisplayName=%s como %s
allArtifactSelected=Todos os artefatos selecionados para serem implantados
noArtifactSelected=Nenhum artefato selecionado para ser implantado
incompatibleModelFoundTitle=Modelos incompat\u00edveis encontrados
incompatibleModelFoundMsg=Foram encontrados modelos incompat\u00edveis no projeto. N\u00e3o \u00e9 poss\u00edvel implantar modelos incompat\u00edveis e eles n\u00e3o aparecer\u00e3o como elemento implant\u00e1vel na caixa de di\u00e1logo seguinte. Alguns outros modelos ser\u00e3o migrados para a vers\u00e3o compat\u00edvel atual.
deployArtifacts=Deploy...
extendProjectTitle=Extend project
extendProjectDescription=Extend your Bonita project with official Bonita extensions. Connectors are used to connect your Bonita project with systems and actor filters are used to filter users on human tasks.
addToProject=Add to project
removeFromProject=Remove from project
find=Find
type=Type
all=All
extensionSelectedForAdd=Extension selected to be added on finish.
addDependenciesError=An error occurred while adding new Maven dependency.
noResultFound=No result found.
version=Version
install=Install
fetchingExtensions=Connecting to Bonita marketplace...
installingExtensions=Installing extensions...
filteringExtensions=Filtering extensions...
incompatibleExtension=Update to a more recent version to use this extension.
incompatibleExtensionTitle=Incompatible with current Studio version
newVersionAvailable=New version available
dependencyUpdatable=Your project already depends of this extension in an older version. Select it to update it to the latest version.
projectDashboard=Project dashboard
openMarketplace=Marketplace
openMarketplaceTooltip=Extend your project by installing extensions available on the Bonita Marketplace.
projectDashboardTitle=Dashboard
bonitaMarketplace=Bonita Marketplace
removeExtensionTooltip=Remove extension from project
details=Details
removeExtensionConfirmationTitle=Remove extension
removeExtensionConfirmation=Remove the extension '%s' from the project?
extensionLoadingErrorTitle=Extensions loading error
extensionLoadingError=An error occurred while loading extensions. Check logs for more details.
importExtensionTitle=Add %s
importExtension=Add an extension as a Maven dependency or an archive.
importExtensionButtonLabel=Add an extension
unknownExtensionsTitle=Other extensions
deleteUnknownTooltip=Remove the selected extensions from the project.
delete=Remove
importRemoteDependencyTip=Add a %s by manually specifying the Maven dependency coordinates. An Internet access to Maven central is highly recommended. You may <a>configure additional remote repositories</a> if required.
dependencyNotFoundWhenImporting=Failed to resolved %s against the configured remote repositories.
dependencyCoordinate=Dependency coordinates
manual=From a Repository
fromFile=From file
browse=Browse...
file=Select a file to import (%s files only)
importFromFileTip=Add a %s from a local file. If the selected file does not exists on any of the configured remote repositories the dependency will be installed in the local repository.
resolvedDependency=Dependency resolved from %s
cannotResolveDependencyInstalledLocally=Cannot resolved dependency. Will be installed in local repository.
editProjectMetadata=Edit project information
editProjectMetadataDescription=Edit the current project information (name, description, version, maven coordinates).
name=Name
description=Description
updatingProjectMetadata=Updating project metadata...
addDatabaseDriverTitle=Add a database driver
addDatabaseDriverDesc=Install a JDBC database driver to use with the database connector. If you need to use a database driver not suggested below you can manually import it.
addDatabaseDriverQuestion=You've just installed the Database connector. You will need a database JDBC driver to run this connector. Do you want to install a database driver from our suggested list ? You can do it later if you will or install it manually.
databaseDriver=Database driver
engineRestartWarning=Web server will be restarted
enhanceProject=Enhance your project with new capabilities by adding extensions from the Bonita marketplace or by importing your own extensions\! 
upgradeBonitaExtensionTooltip=A new version of this extension is available in the Bonita marketplace.
upgradeBonitaExtension=Update to latest version
removeExtension=Remove
updateExtensionConfirmationTitle=Update extension confirmation
updateExtensionConfirmation=Update the extension '%s' from %s to %s ?
newProjectWizardTitle=New project
newProjectWizardDescription=Create a new project with the following information
create=Create
dependencyAlreadyExistsInSameVersion=The project already uses this extension in version '%s'.
dependencyAlreadyExistsInDifferentVersion=The project already uses this extension in version '%s'. Update the version field to use an other version of this extension. 
upgradeExtension=Update
upgradeExtensionTooltip=Update the version of this extension
addExtensionPageTitle=Add extensions
addExtensionPageDescription=You may select some extensions to be used in your new project
extensions=Extensions
modify=Modify
repositories=Repositories
repositoriesDescription=Configure the maven repositories used to retrieve Bonita extensions. Authentication is managed in the servers section.
servers=Servers
proxies=Proxies
mirrors=Mirrors
id=ID
url=Url
releases=Releases
snapshots=Snapshots
enabled=Enabled
updatePolicy=Update policy
checksumPolicy=Checksum policy
add=Add
addRepositoryTooltip=Add a new accessible repository to your maven configuration.
deleteRepositoryTooltip=Remove this repository from your maven configuration. You won't be able to retrieve extensions from this repository anymore. 
mavenProfile=Maven profile
mavenProfileHint=Maven repository configuration is defined in profiles.\nWe recommend the use of the Bonita profile to configure the repositories used by your Bonita project.
encryptionMasterPassword=Master password (encrypted)
updateMasterPasswordWarning=Master password is used to encrypt your server passwords.\nIf you update the existing master password, all passwords have to be generated again.
encryptionLink=<a>Password encryption</a> is optional but recommended if your maven configuration file (settings.xml) is shared.
addServerTooltip=Add a new server to your maven configuration.
deleteServerTooltip=Remove this server from your maven configuration.
serversLink=<a>Servers</a> are used to manage repositories and mirrors authentication.
removeServerConfirmationTitle=Remove server confirmation
removeServerConfirmation=Remove the server '%s' from your maven configuration?
removeRepositoryConfirmationTitle=Remove repository confirmation
removeRepositoryConfirmation=Remove the repository '%s' from your maven configuration?
serverId=ID
serverIdHint=This is the ID of the server (not of the user to login as).\nIt must match the id element of the repository/mirror that Maven tries to connect to.
userPasswordAuthentication=Username / password
sshAuthentication=SSH
username=Username
password=Password
authentication=Authentication
showPassword=Show password
encryptPassword=Encrypt password
encryptButtonTooltip=A master password is required to perform encryption.
privateKey=Private key
passphrase=Passphrase
showPassphrase=Show passphrase
clearPasswordTooltip=The password field must be empty to use ssh authentication.
clearPassword=Clear password
error=Error
proxiesLink=Configure maven to work behind <a>proxies</a>. Only one proxy can be active at a time.
addProxyTooltip=Add a new proxy to your maven configuration.
deleteProxyTooltip=Remove this proxy from your maven configuration.
removeProxyConfirmationTitle=Remove proxy confirmation
removeProxyConfirmation=Remove the proxy '%s' from your maven configuration?
active=Active
protocol=Protocol
host=Host
port=Port
intValueExpected=Integer expected.
nonProxyHost=Non proxy hosts
nonProxyHostsTootltip=This is a list of hosts which should not be proxied.\nThe delimiter of the list is the expected type of the proxy server.\nPipe or comma delimiters are commons.
mirrorsLink=Configure <a>mirrors</a> for your repositories.
addMirrorTooltip=Add a new mirror to your maven configuration.
deleteMirrorTooltip=Remove this mirror from your maven configuration.
removeMirrorConfirmationTitle=Remove mirror confirmation
removeMirrorConfirmation=Remove the mirror '%s' from your maven configuration?
mirrorOf=Mirror of
mirrorUrlTooltip=The base URL of this mirror.\nThe build system will use this URL to connect to a repository rather than the original repository URL.
mirrorOfTooltip=The id of the repository that this is a mirror of.\nThis must not match the mirror id.
activate=Activate
activateProxyTooltip=Set the selected proxy as active
restoreDefaultConfirmationTitle=Restore default confirmation
restoreDefaultConfirmation=Drop all changes on your maven configuration?
updatingConfiguration=Updating configurations...
preparingDefinitionUpdate=Preparing definition update...
updatePreview=Definition update preview...
updateProcessesTitle=Processes update preview
otherDependencyUpdateMessage=An extension have been updated or removed and process configurations require to be updated accordingly. You can\:\n
updateActionsMessage=\u2022 Abort\: the extension will be reverted to its previous state\n  \u2022 Ignore the changes. The processes will not be changed and manual update is required\n  \u2022 Proceed with the processes update
definitionUpateMessage=Connector/actor filter definition(s) have been updated or removed and their configuration require to be updated accordingly. You can\:\n
abortingUpdate=Aborting update...
definitionUpdateWithBreakingChanges=Some configuration cannot be updated automatically due to breaking changes. You will have to update them manually later.
definitionRemovedDescription=%s (%s) definition has been removed. %s configuration(s) will be deleted.
preparingProcessConfigurationUpdate=Preparing process configuration update...
jarFileRemovedChangeDescription=%s will be removed
jarFileUpdatedChangeDescription=%s (%s \u2192 %s)
configurationToUpdateFound=%s process configuration(s) to update found.
jarFileAddedChangeDescription=%s will be transitively added.
back=Back
connectors=Connectors
connectorsHint=Summary of the connectors brought by the %s extension.\nA connector is made of a definition and an implementation. Several implementations can be provided for a given definition.
implementations=Implementation(s)\:
preparingUpdate=Preparing extension update...
computingPreview=Computing preview...
applyingChanges=Applying changes...
actorFilters=Actor filters
actorFiltersHint=Summary of the actor filters brought by the %s extension.\nAn actor filter is made of a definition and an implementation. Several implementations can be provided for a given definition.
restApiExtensions=REST API Extensions
restApiDetailsHint=Summary of the REST API's brought by the %s extension.\nA REST API is defined by an HTTP method, a path template and one or several permissions.\nA permission is a mapping to the organization that grants access to the API.
httpMethodMissing=HTTP method is missing.
pathMissing=Path is missing.
permissionsMissing=Permissions are missing.
permissions=Permissions\:
path=Path\:
copyToClipboard=Copy to clipboard
editPermissionsMapping=Edit permissions mapping
usages=Usages
connectorUsages=Usages of the connector %s.
findUsages=Find usages
findingUsages=Finding usages...
diagramNotFound=Diagram not found
diagramNotFoundMessage=The diagram of the proces %s has not be found.
process=Process\:
connectorUsagesDescription=The tree bellow display all the usages of the connector %s, i.e all the process activities that are using this connector.
noConnectorUsagesFound=The connector %s is not used in your Bonita project.
search=Search
actorFilterUsagesDescription=The tree bellow display all the usages of the actor filter %s, i.e all the process activities that are using this actor filter.
addConnector=Connector...
addActorFilter=Actor filter...
addTheme=Theme...
addRestApiExtension=REST API Extension...
addOther=Other...
legacyArchiveFormatHint=Zip archive format is not supported.
extension=extension
extensionIsNotAConnector=This extension is not a connector.
extensionIsNotAnActorFilter=This extension is not an actor filter.
extensionIsNotARestApiExtension=This extension is not a REST API extension.
extensionIsNotAThemeExtension=This extension is not a theme.
cannotAccessMarketplace=Cannot access to Bonita marketplace
cannotLoadMarketplaceMessage=The Bonita Marketplace cannot be loaded. It might be related to an Internet connectivity issue.
cannotUpdateMarketplaceMessage=The Bonita Marketplace cannot be updated. It might be related to an Internet connectivity issue.
localDependencyTooltip=Local dependency - This dependency has been imported manually, and is stored in the local dependency store on the file system.
remoteDependencyTooltip=External dependency - This dependency is retrieved through Maven from a remote repository.
marketplaceDependencyTooltip=Bonita dependency - This dependency is provided by the Bonita Marketplace, and is retrieved through Maven from the central repository.
editMavenCoordinates=Edit maven coordinates
editMavenCoordinatesTooltip=You can edit the maven coordinates (groupId, artifactId, version & classifier) of local dependencies not built with Maven.
mavenPropertiesMissing=Maven properties information are missing from the imported jar, make sure to build this jar with maven. Legacy jar cannot be imported.
extensionView=Extensions
extensionViewTooltip=Open the project extension view, to get an overview of your project extensions and update them.
dashboardView=Dashboard
dashboardViewTooltip=Open the project dashboard, to get an overview of the artifacts that compose your project.
repositoryIdMandatory=Repository ID is mandatory.
repositoryNameMandatory=The repository '%s' doesn't have a name, this field is mandatory.
repositoryUrlMandatory=The repository '%s' doesn't have an URL, this field is mandatory.
invalidMavenConfigurationTitle=Invalid maven settings
invalidMavenConfiguration=The maven settings file (%s) contains errors.
proxyIdMandatory=Proxy ID is mandatory.
proxyHostMandatory=The proxy '%s' doesn't have a host, this field is mandatory.
mirrorIdMandatory=Mirror ID is mandatory.
mirrorUrlMandatory=The mirror '%s' doesn't have an URL, this field is mandatory.
mavenConfigurationUpdatedTitle=Maven settings updated
mavenConfigurationUpdated=The maven settings file (%s) has been updated.
projectDoesntContainsElement=This project doesn't contain any %s yet.
newElementTitle=Create a new %s
noDescription=No description provided
diagramZoomHint=Overview of all the diagrams in the current project.