NewProcessButtonLabel=Nouveau
OpenProcessButtonLabel=Ouvrir
SaveProcessButtonLabel=Enregistrer
PrintProcessButtonLabel=Imprimer
CopyButtonLabel=Copier
PasteButtonLabel=Coller
HelpButtonLabel=Aide
WelcomeButtonLabel=Bienvenue
openProcessWizardPage_title=Ouvrir un diagramme existant
unableTofindLogMessage=Le fichier de log n'a pas \u00e9t\u00e9 trouv\u00e9 sur votre syst\u00e8me de fichier. Il n'a peut-\u00eatre pas encore \u00e9t\u00e9 cr\u00e9e.
unableTofindLogTitle=Erreur
PreferencesButtonLabel=Pr\u00e9f\u00e9rences
badWorkspaceVersionTitle=Conflit de version d'espace de travail
badWorkspaceVersionMessage=L''espace de travail actuel {0} se trouve dans une version ({1}) diff\u00e9rente de {2}{3}. Un autre utilisateur a peut-\u00eatre migr\u00e9 cet espace de travail vers une version plus r\u00e9cente. Vous ne pouvez plus utiliser cet espace de travail avec cette version de {4}. L''espace de travail par d\u00e9faut va \u00eatre ouvert.
resfreshConnectors=Actualisation des connecteurs...
aboutText={3} Edition\nVersion \: {0}\nVersion id \: {1}\nBuild id \: {2}\nCopyright \u00a9 {4} S.A., 2009-{5}\nAll rights reserved. 
maximizeCoolbarTooltip=Agrandir
reduceCoolbarTooltip=Minimiser
initializingCurrentRepository=Initialisation du projet courant ...
shuttingDown=Arr\u00eat du moteur...
jreNotFoundTitle=Aucun JRE d\u00e9tect\u00e9
jreNotFoundMessage=Un JRE n'a pas \u00e9t\u00e9 trouv\u00e9. Voulez-vous ouvrir la page de pr\u00e9f\u00e9rences Java ?
invalidWorkspaceTitle=Espace de travail non valide
invalidWorkspace={0} n\u2019est pas un espace de travail valide. L\u2019application va donc \u00eatre initialis\u00e9e sans l''importer.
failedToOpenLogTitle=L'ouverture des logs a \u00e9chou\u00e9
failedToOpenLogMessage=Le fichier de logs est trop volumineux pour \u00eatre ouvert avec {1}. Ouvrez le fichier {0} dans un \u00e9diteur de texte de votre choix.
doNotDisplayForOtherDiagrams=Ne plus afficher pour les nouveaux diagrammes
noProcessAvailable=Aucun diagramme ouvert r\u00e9cemment
offlineRepositoryTitle=Projet d\u00e9connect\u00e9 
offlineRepositoryMessage=Le projet {0} est actuellement d\u00e9connect\u00e9. Vous ne pourrez pas mettre \u00e0 jour ni faire de commit en \u00e9tant d\u00e9connect\u00e9.
incompatibleJavaVersionTitle=La version de Java est incompatible
incompatibleJavaVersionMessage=Vous utilisez %s en utilisant une version de Java incompatible (%s).\n Les versions support\u00e9es sont \: %s.
exitWarningMessage=Quitter {0} ? \n\nLa fermeture de Bonita BPM Studio supprime les informations non enregistr\u00e9es dans le {1} et le {2}. Enregistrez tous les \u00e9l\u00e9ments ouverts dans le {2} et exportez vos ressources et applications d\u00e9ploy\u00e9es dans le {1} avant de quitter. \n\nNote \: Dans <A>Pr\u00e9f\u00e9rences > Bases de donn\u00e9es</A>, vous pouvez d\u00e9cocher l''option \u00ab Vider la base de donn\u00e9es \u00e0 la fermeture \u00bb pour conserver ce contenu.
NewButtonLabel=Nouveau
NewButtonTooltip=Cr\u00e9er une nouvelle ressource de projet
organization=Organization
businessDataModel=Mod\u00e8le de Donn\u00e9es M\u00e9tier
bdmAccessControl=Contr\u00f4le d\u2019acc\u00e8s aux donn\u00e9es m\u00e9tier
profile=Profil
applicationDescriptor=Descripteur d'application
applicationPage=Page d'application
layout=Layout
customWidget=Widget personnalis\u00e9
fragment=Fragment
restAPIExtension=Extension d'API REST ...
connectorDef=D\u00e9finition de connecteur ...
connectorImpl=Impl\u00e9mentation de connecteur ...
actorFilterDef=D\u00e9finition de filtre d'acteur ...
actorFilterImpl=Impl\u00e9mentation de filtre d'acteur ...
newGroovy=Groovy ...
theme=\u00a0Th\u00e8me ...
importDragDropInfoTitle=Glisser - D\u00e9poser pour importer
importDragDropInfo=Vous pouvez importer une archive .bos en la d\u00e9posant dans l'explorateur de projet Bonita.\nTous les autres types de fichiers sont ignor\u00e9s.
creatingArchive=Cr\u00e9ation de l'archive %s...
buildError=Une erreur s'est produite pendant la g\u00e9n\u00e9ration de %s
deployErrorTitle=Erreur de d\u00e9ploiement
buildErrorHelp=Le projet n'a pas \u00e9t\u00e9 d\u00e9ploy\u00e9.\nV\u00e9rifiez les \u00e9l\u00e9ments qui le composent puis r\u00e9essayez.\nPour plus d'informations, consultez les logs du Studio (dans le menu `Aide`).
validationErrorTitle=Erreur de validation
validationError=Les erreurs suivantes ont \u00e9t\u00e9 d\u00e9tect\u00e9es dans votre projet.\nLe projet ne peut pas \u00eatre d\u00e9ploy\u00e9 tant que ces erreurs ne sont pas corrig\u00e9es.\nV\u00e9rifiez les fichiers, qui contiennent peut-\u00eatre des erreurs, puis r\u00e9essayez.
bdmGenerationError=Une erreur est survenue \u00e0 la g\u00e9n\u00e9ration de l'archive Java du Mod\u00e8le de Donn\u00e9es M\u00e9tier.
selectArtifactToDeployTitle=S\u00e9lectionner les artefacts \u00e0 d\u00e9ployer
selectArtifactToDeploy=S\u00e9lectionnez les artefacts, v\u00e9rifiez les options et d\u00e9ployez (dans le runtime int\u00e9gr\u00e9 au Studio).
deploy=D\u00e9ployer
selectAll=Tout s\u00e9lectionner
selectNone=Tout d\u00e9s\u00e9lectionner
searchArtifact=Rechercher un artefact ...
expandAll=Tout d\u00e9velopper
collapseAll=Tout r\u00e9duire
buildErrorTitle=Erreur lors de la g\u00e9n\u00e9ration du binaire
build=G\u00e9n\u00e9rer le binaire
deployStatus=Statut du d\u00e9ploiement
deployStatusMessage=Statut du d\u00e9ploiement ci-dessous\u00a0\:
cleanBDMDatabase=Vider la base de donn\u00e9es m\u00e9tier avant le d\u00e9ploiement
deployOptions=Options de d\u00e9ploiement
DeployButtonLabel=D\u00e9ployer
environment=Environnement de configuration des processus
environmentTootltip=Les valeurs des param\u00e8tres, les mappings d'acteurs, les jars tiers, les scripts Groovy, les impl\u00e9mentations  de connecteurs\net de filtres d'acteur s\u00e9lectionn\u00e9es dans la configuration seront int\u00e9gr\u00e9s dans les fichiers bar des processus.
processes=Processus
selectLatestVersion=Ne s\u00e9lectionner que les derni\u00e8res versions des processus
cannotResolveProcess=%s (%s) ne peut pas \u00eatre r\u00e9solu \: %s
cannotEnableProcess=%s (%s) a \u00e9t\u00e9 d\u00e9ploy\u00e9 mais ne peut pas \u00eatre activ\u00e9.
appDescriptorUnknownAppPage=Descripteur d'application '%s'\: La page d'application '%s' n'a pas \u00e9t\u00e9 trouv\u00e9e.
appDescriptorUnknownPageToken=Descripteur d'application '%s'\: Le token de la page d'application '%s' n'existe pas.
appDescriptorUnknownLayoutPage=Descripteur d'application '%s'\: Le layout d'application '%s' n'a pas \u00e9t\u00e9 trouv\u00e9.
appDescriptorUnknownTheme=Descripteur d'application '%s'\: Le th\u00e8me d'application '%s' n'a pas \u00e9t\u00e9 trouv\u00e9.
deploySuccessMsg=Tous les artefacts ont \u00e9t\u00e9 d\u00e9ploy\u00e9s avec succ\u00e8s.
validateProcess=Valider avant le d\u00e9ploiement
portalAppName=Portal
youCanOpenApp=Vous pouvez maintenant ouvrir une application
artifactCounter=%s/%s artefacts s\u00e9lectionn\u00e9s pour \u00eatre d\u00e9ploy\u00e9s
pagesAndLayouts=Pages & Layouts
abort=Abandonner
deployAborted=L'op\u00e9ration de d\u00e9ploiement a \u00e9t\u00e9 interrompue. Tous les artefacts s\u00e9lectionn\u00e9s n'ont pas \u00e9t\u00e9 d\u00e9ploy\u00e9s et l'\u00e9tat initial n'est pas restaur\u00e9. Vous pouvez recommencer le d\u00e9ploiement.
saveOpenedEditorsTitle=Enregistrer avant le d\u00e9ploiement
saveOpenedEditors=Certains artefacts ont \u00e9t\u00e9 modifi\u00e9s. Voulez-vous les enregistrer avant le d\u00e9ploiement ?
savingEditors=Enregistrement du contenu des \u00e9diteurs ...
deploySuccessButNoAppToOpenMsg=Tous les artefacts ont \u00e9t\u00e9 d\u00e9ploy\u00e9s avec succ\u00e8s, mais l'utilisateur par d\u00e9faut actuel (%s) ne peut acc\u00e9der \u00e0 aucune application.
deploying=D\u00e9ploiement de %s ...
deployStatusWithUnresolvedProcessesMessage=Certains processus ne peuvent pas \u00eatre activ\u00e9s en utilisant la configuration actuelle. Veuillez configurer ces processus ou s\u00e9lectionner un autre environnement (Entreprise uniquement).
validateHint=La validation du projet peut prendre du temps\u202f; vous pouvez vouloir\nd\u00e9ployer plus rapidement sans validation cette fois.
applicationAsDisplayName=%s en tant que %s
allArtifactSelected=Tous les artefacts sont s\u00e9lectionn\u00e9s
noArtifactSelected=Aucun artefact s\u00e9lectionn\u00e9
incompatibleModelFoundTitle=Mod\u00e8les incompatibles trouv\u00e9s
incompatibleModelFoundMsg=Des mod\u00e8les incompatibles ont \u00e9t\u00e9 trouv\u00e9s dans le projet. Il n'est pas possible de d\u00e9ployer des mod\u00e8les incompatibles et ils n'appara\u00eetront pas comme des \u00e9l\u00e9ments d\u00e9ployables dans la bo\u00eete de dialogue suivante. D'autres mod\u00e8les seront migr\u00e9s vers la version compatible actuelle.
deployArtifacts=Deploy...
extendProjectTitle=Extend project
extendProjectDescription=Extend your Bonita project with official Bonita extensions. Connectors are used to connect your Bonita project with systems and actor filters are used to filter users on human tasks.
addToProject=Add to project
removeFromProject=Remove from project
find=Find
type=Type
all=All
extensionSelectedForAdd=Extension selected to be added on finish.
addDependenciesError=An error occurred while adding new Maven dependency.
noResultFound=No result found.
version=Version
install=Install
fetchingExtensions=Fetching extensions...
installingExtensions=Installing extensions...
filteringExtensions=Filtering extensions...
incompatibleExtension=Update to a more recent version to use this extension.
incompatibleExtensionTitle=Incompatible with current Studio version
newVersionAvailable=New version available
dependencyUpdatable=Your project already depends of this extension in an older version. Select it to update it to the latest version.
projectExtensions=Project extensions
openMarketplace=Access the Bonita Marketplace
openMarketplaceTooltip=Extend your project by installing extensions available on the Bonita Marketplace.
projectExtensionsTitle=Extensions
bonitaMarketplace=Bonita Marketplace
removeExtensionTooltip=Remove extension from project
details=Details
removeExtensionConfirmationTitle=Remove extension
removeExtensionConfirmation=Remove the extension '%s' from the project?
extensionLoadingErrorTitle=Extensions loading error
extensionLoadingError=An error occurred while loading extensions. Check logs for more details.
importExtensionTitle=Add %s
importExtension=Add a %s as a Maven dependency or an archive.
importExtensionButtonLabel=Add an extension
unknownExtensionsTitle=Other extensions
deleteUnknownTooltip=Remove the selected extensions from the project.
delete=Remove
importRemoteDependencyTip=Add a %s by manually specifying the Maven dependency coordinates. An Internet access to Maven central is highly recommended. You may <a>configure additional remote repositories</a> if required.
dependencyNotFoundWhenImporting=Failed to resolved %s against the configured remote repositories.
dependencyCoordinate=Dependency coordinates
manual=Manual
fromFile=From file
browse=Browse...
file=Select a file to import (%s files only)
importFromFileTip=Add a %s from a local file. If the selected file does not exists on any of the configured remote repositories the dependency will be installed in the local repository.
resolvedDependency=Dependency resolved from %s
cannotResolveDependencyInstalledLocally=Cannot resolved dependency. Will be installed in local repository.
editProjectMetadata=Edit project information
editProjectMetadataDescription=Edit the current project information (name, description, version, maven coordinates).
name=Name
description=Description
updatingProjectMetadata=Updating project metadata...
addDatabaseDriverTitle=Add a database driver
addDatabaseDriverDesc=Install a JDBC database driver to use with the database connector. If you need to use a database driver not suggested below you can manually import it.
addDatabaseDriverQuestion=You've just installed the Database connector. You will need a database JDBC driver to run this connector. Do you want to install a database driver from our suggested list ? You can do it later if you will or install it manually.
databaseDriver=Database driver
engineRestartWarning=Web server will be restarted
enhanceProject=Enhance your project with new capabilities by adding extensions from the Bonita marketplace or by importing your own extensions\! 
upgradeBonitaExtensionTooltip=A new version of this extension is available in the Bonita marketplace.
upgradeBonitaExtension=Update to latest version
removeExtension=Remove
updateExtensionConfirmationTitle=Update extension confirmation
updateExtensionConfirmation=Update the extension '%s' from %s to %s ?
newProjectWizardTitle=New project
newProjectWizardDescription=Create a new project with the following information
create=Create
dependencyAlreadyExistsInSameVersion=The project already uses this extension in version '%s'.
dependencyAlreadyExistsInDifferentVersion=The project already uses this extension in version '%s'. Update the version field to use an other version of this extension. 
upgradeExtension=Update
upgradeExtensionTooltip=Update the version of this extension
addExtensionPageTitle=Add extensions
addExtensionPageDescription=You may select some extensions to be used in your new project
extensions=Extensions
modify=Modify
repositories=Repositories
repositoriesDescription=Configure the maven repositories used to retrieve Bonita extensions. Authentication is managed in the servers section.
servers=Servers
proxies=Proxies
mirrors=Mirrors
id=ID
url=Url
releases=Releases
snapshots=Snapshots
enabled=Enabled
updatePolicy=Update policy
checksumPolicy=Checksum policy
add=Add
addRepositoryTooltip=Add a new accessible repository to your maven configuration.
deleteRepositoryTooltip=Remove this repository from your maven configuration. You won't be able to retrieve extensions from this repository anymore. 
mavenProfile=Maven profile
mavenProfileHint=Maven repository configuration is defined in profiles.\nWe recommend the use of the Bonita profile to configure the repositories used by your Bonita project.
encryptionMasterPassword=Master password (encrypted)
updateMasterPasswordWarning=Master password is used to encrypt your server passwords.\nIf you update the existing master password, all passwords have to be generated again.
encryptionLink=<a>Password encryption</a> is optional but recommended if your maven configuration file (settings.xml) is shared.
addServerTooltip=Add a new server to your maven configuration.
deleteServerTooltip=Remove this server from your maven configuration.
serversLink=<a>Servers</a> are used to manage repositories and mirrors authentication.
removeServerConfirmationTitle=Remove server confirmation
removeServerConfirmation=Remove the server '%s' from your maven configuration?
removeRepositoryConfirmationTitle=Remove repository confirmation
removeRepositoryConfirmation=Remove the repository '%s' from your maven configuration?
serverId=ID
serverIdHint=This is the ID of the server (not of the user to login as).\nIt must match the id element of the repository/mirror that Maven tries to connect to.
userPasswordAuthentication=Username / password
sshAuthentication=SSH
username=Username
password=Password
authentication=Authentication
showPassword=Show password
encryptPassword=Encrypt password
encryptButtonTooltip=A master password is required to perform encryption.
privateKey=Private key
passphrase=Passphrase
showPassphrase=Show passphrase
clearPasswordTooltip=The password field must be empty to use ssh authentication.
clearPassword=Clear password
error=Error
proxiesLink=Configure maven to work behind <a>proxies</a>. Only one proxy can be active at a time.
addProxyTooltip=Add a new proxy to your maven configuration.
deleteProxyTooltip=Remove this proxy from your maven configuration.
removeProxyConfirmationTitle=Remove proxy confirmation
removeProxyConfirmation=Remove the proxy '%s' from your maven configuration?
active=Active
protocol=Protocol
host=Host
port=Port
intValueExpected=Integer expected.
nonProxyHost=Non proxy hosts
nonProxyHostsTootltip=This is a list of hosts which should not be proxied.\nThe delimiter of the list is the expected type of the proxy server.\nPipe or comma delimiters are commons.
mirrorsLink=Configure <a>mirrors</a> for your repositories.
addMirrorTooltip=Add a new mirror to your maven configuration.
deleteMirrorTooltip=Remove this mirror from your maven configuration.
removeMirrorConfirmationTitle=Remove mirror confirmation
removeMirrorConfirmation=Remove the mirror '%s' from your maven configuration?
mirrorOf=Mirror of
mirrorUrlTooltip=The base URL of this mirror.\nThe build system will use this URL to connect to a repository rather than the original repository URL.
mirrorOfTooltip=The id of the repository that this is a mirror of.\nThis must not match the mirror id.
activate=Activate
activateProxyTooltip=Set the selected proxy as active
restoreDefaultConfirmationTitle=Restore default confirmation
restoreDefaultConfirmation=Drop all changes on your maven configuration?
updatingConfiguration=Updating configurations...
preparingDefinitionUpdate=Preparing definition update...
updatePreview=Definition update preview...
updateProcessesTitle=Processes update preview
otherDependencyUpdateMessage=An extension have been updated or removed and process configurations require to be updated accordingly. You can\:\n
updateActionsMessage=\u2022 Abort\: the extension will be reverted to its previous state\n  \u2022 Ignore the changes. The processes will not be changed and manual update is required\n  \u2022 Proceed with the processes update
definitionUpateMessage=Connector/actor filter definition(s) have been updated or removed and their configuration require to be updated accordingly. You can\:\n
abortingUpdate=Aborting update...
definitionUpdateWithBreakingChanges=Some configuration cannot be updated automatically due to breaking changes. You will have to update them manually later.
definitionRemovedDescription=%s (%s) definition has been removed. %s configuration(s) will be deleted.
preparingProcessConfigurationUpdate=Preparing process configuration update...
jarFileRemovedChangeDescription=%s will be removed
jarFileUpdatedChangeDescription=%s (%s \u2192 %s)
configurationToUpdateFound=%s process configuration(s) to update found.
jarFileAddedChangeDescription=%s will be transitively added.
back=Back
connectors=Connectors
connectorsHint=Summary of the connectors brought by the %s extension.\nA connector is made of a definition and an implementation. Several implementations can be provided for a given definition.
implementations=Implementation(s)\:
preparingUpdate=Preparing extension update...
computingPreview=Computing preview...
applyingChanges=Applying changes...
actorFilters=Actor filters
actorFiltersHint=Summary of the actor filters brought by the %s extension.\nAn actor filter is made of a definition and an implementation. Several implementations can be provided for a given definition.
restApiExtensions=REST API Extensions
restApiDetailsHint=Summary of the REST API's brought by the %s extension.\nA REST API is defined by an HTTP method, a path template and one or several permissions.\nA permission is a mapping to the organization that grants access to the API.
httpMethodMissing=HTTP method is missing.
pathMissing=Path is missing.
permissionsMissing=Permissions are missing.
permissions=Permissions\:
path=Path\:
copyToClipboard=Copy to clipboard
editPermissionsMapping=Edit permissions mapping
usages=Usages
connectorUsages=Usages of the connector %s.
findUsages=Find usages
findingUsages=Finding usages...
diagramNotFound=Diagram not found
diagramNotFoundMessage=The diagram of the proces %s has not be found.
process=Process\:
connectorUsagesDescription=The tree bellow display all the usages of the connector %s, i.e all the process activities that are using this connector.
openSelection=Open selection
noConnectorUsagesFound=The connector %s is not used in your Bonita project.
search=Search
actorFilterUsagesDescription=The tree bellow display all the usages of the actor filter %s, i.e all the process activities that are using this actor filter.
addConnector=Connector...
addActorFilter=Actor filter...
addTheme=Theme...
addRestApiExtension=REST API Extension...
addOther=Other...
legacyArchiveFormatHint=Zip archive format is not supported.
extension=extension
extensionIsNotAConnector=This extension is not a connector.
extensionIsNotAnActorFilter=This extension is not an actor filter.
extensionIsNotARestApiExtension=This extension is not a REST API extension.
extensionIsNotAThemeExtension=This extension is not a theme.
cannotLoadMarketplace=Cannot load Bonita marketplace
cannotLoadMarketplaceMessage=The Bonita Marketplace cannot be loaded. It might be related to an Internet connectivity issue.
