NewProcessButtonLabel=\u65b0\u898f
OpenProcessButtonLabel=\u958b\u304f
SaveProcessButtonLabel=\u4fdd\u5b58
PrintProcessButtonLabel=\u5370\u5237
CopyButtonLabel=\u30b3\u30d4\u30fc
PasteButtonLabel=\u8cbc\u308a\u4ed8\u3051
HelpButtonLabel=\u30d8\u30eb\u30d7
WelcomeButtonLabel=\u3088\u3046\u3053\u305d
openProcessWizardPage_title=\u65e2\u5b58\u306e\u30c0\u30a4\u30a2\u30b0\u30e9\u30e0\u3092\u958b\u304f
unableTofindLogMessage=\u30ed\u30b0 \u30d5\u30a1\u30a4\u30eb\u3092\u898b\u3064\u3051\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3002\u307e\u3060\u4f5c\u6210\u3055\u308c\u3066\u3044\u306a\u3044\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
unableTofindLogTitle=\u958b\u304f\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093
PreferencesButtonLabel=\u74b0\u5883\u8a2d\u5b9a
badWorkspaceVersionTitle=\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u4e0d\u4e00\u81f4
badWorkspaceVersionMessage=\u3042\u306a\u305f\u306e\u73fe\u5728\u306e\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9 {0} \u306f\u3001 {2} {3} \u3068\u7570\u306a\u308b\u30d0\u30fc\u30b8\u30e7\u30f3 ({1}) \u3092\u6301\u3063\u3066\u3044\u307e\u3059\u3002\u5225\u306e\u30e6\u30fc\u30b6\u30fc\u304c\u3053\u306e\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u3092\u6700\u8fd1\u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u306b\u79fb\u884c\u3057\u3066\u3044\u308b\u5834\u5408\u304c\u3042\u308a\u307e\u3059\u3002\u3082\u306f\u3084 {4} \u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u3067\u3053\u306e\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u3092\u4f7f\u7528\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002\u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u304c\u8d77\u52d5\u3055\u308c\u307e\u3059\u3002
resfreshConnectors=\u30b3\u30cd\u30af\u30bf\u3092\u66f4\u65b0\u4e2d...
aboutText={3} Edition\nVersion \: {0}\nVersion id \: {1}\nBuild id \: {2}\nCopyright \u00a9 {4} S.A., 2009-{5}\nAll rights reserved. 
maximizeCoolbarTooltip=\u6700\u5927\u5316
reduceCoolbarTooltip=\u6700\u5c0f\u5316
initializingCurrentRepository=\u73fe\u5728\u306e\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u521d\u671f\u5316\u3057\u3066\u3044\u307e\u3059...
shuttingDown=\u30a8\u30f3\u30b8\u30f3\u3092\u505c\u6b62\u3057\u3066\u3044\u307e\u3059...
jreNotFoundTitle=\ JRE \u3092\u691c\u51fa\u3067\u304d\u307e\u305b\u3093
jreNotFoundMessage=JRE \u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002Java \u306e\u74b0\u5883\u8a2d\u5b9a\u30da\u30fc\u30b8\u3092\u958b\u304d\u307e\u3059\u304b\uff1f\n
invalidWorkspaceTitle=\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u304c\u7121\u52b9\u3067\u3059
invalidWorkspace={0} \u306f\u3001\u6709\u52b9\u306a\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306f\u3001\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u3092\u30a4\u30f3\u30dd\u30fc\u30c8\u305b\u305a\u306b\u521d\u671f\u5316\u3055\u308c\u307e\u3059\u3002
failedToOpenLogTitle=\u30ed\u30b0\u3092\u958b\u304f\u306e\u306b\u5931\u6557\u3057\u307e\u3057\u305f
failedToOpenLogMessage=Bonita BPM Studio\u3092\u4f7f\u7528\u3057\u3066\u958b\u304f\u306b\u306f\u3001\u30ed\u30b0 \u30d5\u30a1\u30a4\u30eb\u304c\u5927\u304d\u3059\u304e\u307e\u3059\u3002\n\u4ed6\u306e\u5916\u90e8\u306e\u30c6\u30ad\u30b9\u30c8 \u30a8\u30c7\u30a3\u30bf\u3092\u4f7f\u7528\u3057\u3066\u3001\u6b21\u306e\u30d5\u30a1\u30a4\u30eb\u3092\u958b\u3044\u3066\u3057\u3066\u304f\u3060\u3055\u3044\: {0}
doNotDisplayForOtherDiagrams=\u305d\u306e\u4ed6\u306e\u65b0\u3057\u3044\u30c0\u30a4\u30a2\u30b0\u30e9\u30e0\u306f\u8868\u793a\u3057\u307e\u305b\u3093
noProcessAvailable=\u6700\u8fd1\u958b\u3044\u3066\u306a\u3044\u30c0\u30a4\u30a2\u30b0\u30e9\u30e0
offlineRepositoryTitle=\u30aa\u30d5\u30e9\u30a4\u30f3\u30d7\u30ed\u30b8\u30a7\u30af\u30c8 
offlineRepositoryMessage={0} \u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306f\u73fe\u5728\u30aa\u30d5\u30e9\u30a4\u30f3\u3067\u3059\u3002\n\u30aa\u30d5\u30e9\u30a4\u30f3\u30e2\u30fc\u30c9\u3067\u66f4\u65b0/\u30b3\u30df\u30c3\u30c8\u3092\u5909\u66f4\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
incompatibleJavaVersionTitle=\u4e92\u63db\u6027\u306e\u306a\u3044 Java \u30d0\u30fc\u30b8\u30e7\u30f3
incompatibleJavaVersionMessage=\u4e92\u63db\u6027\u306e\u306a\u3044 Java \u30d0\u30fc\u30b8\u30e7\u30f3 (%s) \u304c\u691c\u51fa\u3055\u308c\u307e\u3057\u305f\u3002\n %s \u3092\u5b9f\u884c\u3059\u308b\u305f\u3081\u306b\u5fc5\u8981\u306a\u30d0\u30fc\u30b8\u30e7\u30f3\u306f Java %s \u3067\u3059\u3002
exitWarningMessage={0}\u3092\u7d42\u4e86\u3057\u307e\u3059\u304b\uff1f\n\n\u30b9\u30bf\u30b8\u30aa\u3092\u9589\u3058\u308b\u3068{1} \u306e\u672a\u4fdd\u5b58\u306e\u4f5c\u696d\u304c\u524a\u9664\u3055\u308c\u307e\u3059\u3002 \u958b\u3044\u3066\u3044\u308b\u8981\u7d20\u304c{1}\u306b\u4fdd\u5b58\u3055\u308c\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002\n\n\u6ce8\uff1a<A>Preferences > Database</A>\u3067\u3001[\u7d42\u4e86\u6642\u306b\u30af\u30ea\u30fc\u30f3\u306a\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9]\u30aa\u30d7\u30b7\u30e7\u30f3\u306e\u30c1\u30a7\u30c3\u30af\u3092\u5916\u3057\u3066\u3001\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306e\u5185\u5bb9\u3092\u4fdd\u6301\u3067\u304d\u307e\u3059\u3002
NewButtonLabel=\u65b0\u898f
NewButtonTooltip=\u65b0\u3057\u3044\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u30ea\u30bd\u30fc\u30b9\u3092\u4f5c\u6210
organization=\u7d44\u7e54
businessDataModel=\u30d3\u30b8\u30cd\u30b9 \u30c7\u30fc\u30bf \u30e2\u30c7\u30eb
bdmAccessControl=BDM \u30a2\u30af\u30bb\u30b9\u30b3\u30f3\u30c8\u30ed\u30fc\u30eb
profile=\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb
applicationDescriptor=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u8a18\u8ff0\u5b50
applicationPage=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3 \u30da\u30fc\u30b8
layout=\u30ec\u30a4\u30a2\u30a6\u30c8
customWidget=\u30ab\u30b9\u30bf\u30e0 \u30a6\u30a3\u30b8\u30a7\u30c3\u30c8
fragment=\u30d5\u30e9\u30b0\u30e1\u30f3\u30c8
restAPIExtension=REST API \u62e1\u5f35...
connectorDef=\u30b3\u30cd\u30af\u30bf\u5b9a\u7fa9...
connectorImpl=\u30b3\u30cd\u30af\u30bf\u306e\u5b9f\u88c5...
actorFilterDef=\u30a2\u30af\u30bf\u30fc\u30d5\u30a3\u30eb\u30bf\u30fc\u5b9a\u7fa9...
actorFilterImpl=\u30a2\u30af\u30bf\u30fc\u30d5\u30a3\u30eb\u30bf\u30fc\u306e\u5b9f\u88c5...
newGroovy=Groovy...
theme=\u30c6\u30fc\u30de...
importDragDropInfoTitle=\u30c9\u30e9\u30c3\u30b0\uff06\u30c9\u30ed\u30c3\u30d7\u306e\u30a4\u30f3\u30dd\u30fc\u30c8
importDragDropInfo=Bonita\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u30a8\u30af\u30b9\u30d7\u30ed\u30fc\u30e9\u306b\u30c9\u30ed\u30c3\u30d7\u3059\u308b\u3053\u3068\u3067\u3001Bos\u30a2\u30fc\u30ab\u30a4\u30d6\u3092\u30a4\u30f3\u30dd\u30fc\u30c8\u3067\u304d\u307e\u3059\u3002\n\u4ed6\u306e\u30d5\u30a1\u30a4\u30eb\u306f\u7121\u8996\u3055\u308c\u307e\u3059\u3002
creatingArchive=\u30a2\u30fc\u30ab\u30a4\u30d6 %s \u3092\u4f5c\u6210\u3057\u3066\u3044\u307e\u3059...
buildError=%s \u306e\u69cb\u7bc9\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f
deployErrorTitle=\u30c7\u30d7\u30ed\u30a4\u30a8\u30e9\u30fc
buildErrorHelp=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306f\u30c7\u30d7\u30ed\u30a4\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002\n\u95a2\u9023\u3059\u308b\u30a2\u30fc\u30c6\u30a3\u30d5\u30a1\u30af\u30c8\u306b\u6f5c\u5728\u7684\u30a8\u30e9\u30fc\u304c\u306a\u3044\u304b\u78ba\u8a8d\u3057\u3066\u3001\u518d\u8a66\u884c\u3057\u3066\u304f\u3060\u3055\u3044\u3002\n\u8a73\u7d30\u306b\u3064\u3044\u3066\u306f\u3001Studio \u30ed\u30b0( `Help` menu)\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002\n
validationErrorTitle=\u30d0\u30ea\u30c7\u30fc\u30b7\u30e7\u30f3 \u30a8\u30e9\u30fc
validationError=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3067\u6b21\u306e\u30a8\u30e9\u30fc\u304c\u691c\u51fa\u3055\u308c\u307e\u3057\u305f\u3002\n\u3053\u308c\u3089\u306e\u30a8\u30e9\u30fc\u304c\u4fee\u6b63\u3055\u308c\u308b\u307e\u3067\u3001\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u30c7\u30d7\u30ed\u30a4\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002\n\u95a2\u9023\u3059\u308b\u30d5\u30a1\u30a4\u30eb\u3067\u6f5c\u5728\u7684\u30a8\u30e9\u30fc\u3092\u78ba\u8a8d\u3057\u3066\u518d\u8a66\u884c\u3057\u3066\u304f\u3060\u3055\u3044\u3002
bdmGenerationError=\u30d3\u30b8\u30cd\u30b9 \u30c7\u30fc\u30bf \u30e2\u30c7\u30eb Java \u30a2\u30fc\u30ab\u30a4\u30d6\u306e\u751f\u6210\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
selectArtifactToDeployTitle=\u30c7\u30d7\u30ed\u30a4\u3059\u308b\u30a2\u30fc\u30c6\u30a3\u30d5\u30a1\u30af\u30c8\u3092\u9078\u629e
selectArtifactToDeploy=\u30a2\u30fc\u30c6\u30a3\u30d5\u30a1\u30af\u30c8\u3092\u9078\u629e\u3057\u30aa\u30d7\u30b7\u30e7\u30f3\u3092\u78ba\u8a8d\u3057\u3066\u304b\u3089\u30c7\u30d7\u30ed\u30a4(Studio \u30a8\u30f3\u30d9\u30c7\u30c3\u30c9 \u30e9\u30f3\u30bf\u30a4\u30e0\u3078)\u3057\u307e\u3059\u3002
deploy=\u30c7\u30d7\u30ed\u30a4
selectAll=\u3059\u3079\u3066\u9078\u629e
selectNone=\u9078\u629e\u306a\u3057
searchArtifact=\u30a2\u30fc\u30c1\u30d5\u30a1\u30af\u30c8\uff08\u6210\u679c\u7269\uff09\u3092\u691c\u7d22
expandAll=\u3059\u3079\u3066\u5c55\u958b
collapseAll=\u5168\u3066\u6298\u308a\u305f\u305f\u3080
buildErrorTitle=\u30d3\u30eb\u30c9\u30a8\u30e9\u30fc
build=\u30d3\u30eb\u30c9
deployStatus=\u30c7\u30d7\u30ed\u30a4\u30b9\u30c6\u30fc\u30bf\u30b9
deployStatusMessage=\u30c7\u30d7\u30ed\u30a4\u72b6\u6cc1\u306f\u4ee5\u4e0b\u306e\u901a\u308a\uff1a
cleanBDMDatabase=\u30c7\u30d7\u30ed\u30a4\u524d\u306b BDM \u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u3092\u30af\u30ea\u30fc\u30f3\u30a2\u30c3\u30d7\u3059\u308b
deployOptions=\u30c7\u30d7\u30ed\u30a4\u30aa\u30d7\u30b7\u30e7\u30f3
DeployButtonLabel=\u30c7\u30d7\u30ed\u30a4
environment=\u30d7\u30ed\u30bb\u30b9\u69cb\u6210\u74b0\u5883
environmentTootltip=Parameters values, actor mappings, third-party jars, Groovy scripts, connectors\nand actor filters implementations selected in the configuration will be embedded in process bar files.
processes=\u30d7\u30ed\u30bb\u30b9
selectLatestVersion=\u6700\u65b0\u306e\u30d7\u30ed\u30bb\u30b9\u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u306e\u307f\u3092\u9078\u629e
cannotResolveProcess=%s (%s) \u306f\u89e3\u6c7a\u3055\u308c\u307e\u305b\u3093\: %s
cannotEnableProcess=%s (%s) \u306f\u30c7\u30d7\u30ed\u30a4\u3055\u308c\u307e\u3057\u305f\u304c\u6709\u52b9\u306b\u3067\u304d\u307e\u305b\u3093\u3002
appDescriptorUnknownAppPage=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u8a18\u8ff0\u5b50 '%s'\: \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30da\u30fc\u30b8 '%s' \u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
appDescriptorUnknownPageToken=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u8a18\u8ff0\u5b50 '%s'\: \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30da\u30fc\u30b8 \u30c8\u30fc\u30af\u30f3 '%s' \u306f\u5b58\u5728\u3057\u307e\u305b\u3093\u3002
appDescriptorUnknownLayoutPage=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u8a18\u8ff0\u5b50 '%s'\: \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30ec\u30a4\u30a2\u30a6\u30c8 '%s' \u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
appDescriptorUnknownTheme=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u8a18\u8ff0\u5b50 '%s'\: \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30c6\u30fc\u30de '%s' \u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
deploySuccessMsg=\u3059\u3079\u3066\u306e\u30a2\u30fc\u30c6\u30a3\u30d5\u30a1\u30af\u30c8\u304c\u6b63\u5e38\u306b\u30c7\u30d7\u30ed\u30a4\u3055\u308c\u307e\u3057\u305f\u3002
validateProcess=\u30c7\u30d7\u30ed\u30a4\u524d\u306b\u691c\u8a3c\u3059\u308b
youCanOpenApp=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u958b\u304f\u3053\u3068\u304c\u3067\u304d\u307e\u3059
artifactCounter=\u30c7\u30d7\u30ed\u30a4\u3055\u308c\u308b\u30a2\u30fc\u30c6\u30a3\u30d5\u30a1\u30af\u30c8  %s/%s  \u304c\u9078\u629e\u3055\u308c\u307e\u3057\u305f
pagesAndLayouts=\u30da\u30fc\u30b8 & \u30ec\u30a4\u30a2\u30a6\u30c8
abort=\u4e2d\u6b62
deployAborted=\u30c7\u30d7\u30ed\u30a4\u64cd\u4f5c\u306f\u4e2d\u6b62\u3055\u308c\u307e\u3057\u305f\u3002\n\u9078\u629e\u3057\u305f\u3059\u3079\u3066\u306e\u30a2\u30fc\u30c6\u30a3\u30d5\u30a1\u30af\u30c8\u304c\u30c7\u30d7\u30ed\u30a4\u3055\u308c\u3066\u3044\u308b\u308f\u3051\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002\n\u30ed\u30fc\u30eb\u30d0\u30c3\u30af\u306f\u5b9f\u884c\u3055\u308c\u307e\u305b\u3093\u3002\u518d\u5ea6\u30c7\u30d7\u30ed\u30a4\u3059\u308b\u3053\u3068\u3092\u304a\u52e7\u3081\u3057\u307e\u3059\u3002
saveOpenedEditorsTitle=\u30c7\u30d7\u30ed\u30a4\u3059\u308b\u524d\u306b\u4fdd\u5b58
saveOpenedEditors=\u3044\u304f\u3064\u304b\u306e\u30a2\u30fc\u30c6\u30a3\u30d5\u30a1\u30af\u30c8\u304c\u5909\u66f4\u3055\u308c\u3066\u3044\u307e\u3059\u3002\u30c7\u30d7\u30ed\u30a4\u3059\u308b\u524d\u306b\u4fdd\u5b58\u3057\u307e\u3059\u304b\uff1f
savingEditors=\u30a8\u30c7\u30a3\u30bf\u30fc\u3092\u4fdd\u5b58\u3057\u3066\u3044\u307e\u3059...
deploySuccessButNoAppToOpenMsg=\u3059\u3079\u3066\u306e\u30a2\u30fc\u30c6\u30a3\u30d5\u30a1\u30af\u30c8\u306f\u6b63\u5e38\u306b\u30c7\u30d7\u30ed\u30a4\u3055\u308c\u307e\u3057\u305f\u304c\u3001\u73fe\u5728\u306e\u30c7\u30d5\u30a9\u30eb\u30c8\u30fb\u30e6\u30fc\u30b6 (%s) \u306f\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306b\u30a2\u30af\u30bb\u30b9\u3067\u304d\u307e\u305b\u3093\u3002
deploying=%s \u3092\u30c7\u30d7\u30ed\u30a4\u3057\u3066\u3044\u307e\u3059...
deployStatusWithUnresolvedProcessesMessage=\u4e00\u90e8\u306e\u30d7\u30ed\u30bb\u30b9\u306f\u73fe\u5728\u306e\u8a2d\u5b9a\u3092\u4f7f\u7528\u3057\u3066\u6709\u52b9\u306b\u3067\u304d\u307e\u305b\u3093\u3002\n\u305d\u308c\u3089\u306e\u30d7\u30ed\u30bb\u30b9\u3092\u8a2d\u5b9a\u3059\u308b\u304b\u3001\u5225\u306e\u74b0\u5883\u3092\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044 (Enterprise\u306e\u307f)\u3002
validateHint=Project validation can take time; you may want\nto deploy faster with no validation this time.
applicationAsDisplayName=%s \u3068\u3057\u3066 %s
allArtifactSelected=\u30c7\u30d7\u30ed\u30a4\u3055\u308c\u308b\u3059\u3079\u3066\u306e\u30a2\u30fc\u30c6\u30a3\u30d5\u30a1\u30af\u30c8\u304c\u9078\u629e\u3055\u308c\u3066\u3044\u307e\u3059
noArtifactSelected=\u30c7\u30d7\u30ed\u30a4\u3059\u308b\u305f\u3081\u306e\u30a2\u30fc\u30c6\u30a3\u30d5\u30a1\u30af\u30c8\u304c\u9078\u629e\u3055\u308c\u3066\u3044\u307e\u305b\u3093
incompatibleModelFoundTitle=\u4e92\u63db\u6027\u306e\u306a\u3044\u30e2\u30c7\u30eb\u304c\u898b\u3064\u304b\u308a\u307e\u3057\u305f
incompatibleModelFoundMsg=\u4e92\u63db\u6027\u306e\u306a\u3044\u30e2\u30c7\u30eb\u304c\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3067\u898b\u3064\u304b\u308a\u307e\u3057\u305f\u3002 \n\u4e92\u63db\u6027\u306e\u306a\u3044\u30e2\u30c7\u30eb\u3092\u30c7\u30d7\u30ed\u30a4\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u305a\u3001\u6b21\u306e\u30c0\u30a4\u30a2\u30ed\u30b0\u306b\u30c7\u30d7\u30ed\u30a4\u53ef\u80fd\u306a\u30a8\u30ec\u30e1\u30f3\u30c8\u3068\u3057\u3066\u8868\u793a\u3055\u308c\u307e\u305b\u3093\u3002 \u4ed6\u306e\u3044\u304f\u3064\u304b\u306e\u30e2\u30c7\u30eb\u306f\u3001\u73fe\u5728\u306e\u4e92\u63db\u6027\u306e\u3042\u308b\u30d0\u30fc\u30b8\u30e7\u30f3\u306b\u79fb\u884c\u3055\u308c\u307e\u3059\u3002
deployArtifacts=\u30c7\u30d7\u30ed\u30a4...
extendProjectTitle=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306e\u30a8\u30af\u30b9\u30dd\u30fc\u30c8
extendProjectDescription=Bonita \u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u516c\u5f0f\u306e Bonita \u62e1\u5f35\u6a5f\u80fd\u3067\u62e1\u5f35\u3057\u307e\u3059\u3002 \u30b3\u30cd\u30af\u30bf\u306f\u3001Bonita\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3068\u30b7\u30b9\u30c6\u30e0\u3092\u63a5\u7d9a\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u3001\u30a2\u30af\u30bf\u30fc\u30d5\u30a3\u30eb\u30bf\u306f\u30d2\u30e5\u30fc\u30de\u30f3\u30bf\u30b9\u30af\u306e\u30e6\u30fc\u30b6\u30fc\u3092\u30d5\u30a3\u30eb\u30bf\u30ea\u30f3\u30b0\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002
addToProject=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306b \u8ffd\u52a0
removeFromProject=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u304b\u3089\u524a\u9664\n
find=\u691c\u7d22
type=\u30bf\u30a4\u30d7
all=\u3059\u3079\u3066
extensionSelectedForAdd=\u4ed5\u4e0a\u3052\u6642\u306b\u8ffd\u52a0\u3059\u308b\u3088\u3046\u306b\u9078\u629e\u3055\u308c\u305f\u62e1\u5f35\u6a5f\u80fd\u3002
addDependenciesError=\u65b0\u3057\u3044 Maven \u4f9d\u5b58\u95a2\u4fc2\u306e\u8ffd\u52a0\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
noResultFound=\u7d50\u679c\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002
version=\u30d0\u30fc\u30b8\u30e7\u30f3
install=\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb
fetchingExtensions=Bonita \u30de\u30fc\u30b1\u30c3\u30c8\u30d7\u30ec\u30a4\u30b9\u306b\u63a5\u7d9a\u4e2d...
installingExtensions=\u62e1\u5f35\u6a5f\u80fd\u3092\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3057\u3066\u3044\u307e\u3059...
filteringExtensions=\u62e1\u5f35\u6a5f\u80fd\u306e\u30d5\u30a3\u30eb\u30bf\u30ea\u30f3\u30b0\u4e2d...
incompatibleExtension=\u3053\u306e\u62e1\u5f35\u6a5f\u80fd\u3092\u4f7f\u7528\u3059\u308b\u306b\u306f\u3001\u6700\u65b0\u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u306b\u66f4\u65b0\u3057\u3066\u304f\u3060\u3055\u3044\u3002
incompatibleExtensionTitle=\u73fe\u5728\u306eStudio\u30d0\u30fc\u30b8\u30e7\u30f3\u3068\u4e92\u63db\u6027\u304c\u3042\u308a\u307e\u305b\u3093
newVersionAvailable=\u65b0\u3057\u3044\u30d0\u30fc\u30b8\u30e7\u30f3\u304c\u5229\u7528\u53ef\u80fd\u3067\u3059
dependencyUpdatable=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306f\u53e4\u3044\u30d0\u30fc\u30b8\u30e7\u30f3\u3067\u306f\u3053\u306e\u62e1\u5f35\u6a5f\u80fd\u306b\u3059\u3067\u306b\u4f9d\u5b58\u3057\u3066\u3044\u307e\u3059\u3002\u6700\u65b0\u30d0\u30fc\u30b8\u30e7\u30f3\u306b\u66f4\u65b0\u3059\u308b\u306b\u306f\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044\u3002
projectOverview=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306e\u6982\u8981
openMarketplace=\u30de\u30fc\u30b1\u30c3\u30c8\u30d7\u30ec\u30a4\u30b9\u3092\u958b\u304f
openMarketplaceTooltip=Bonita \u30de\u30fc\u30b1\u30c3\u30c8\u30d7\u30ec\u30a4\u30b9\u3067\u5229\u7528\u53ef\u80fd\u306a\u62e1\u5f35\u6a5f\u80fd\u3092\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3057\u3066\u3001\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u62e1\u5f35\u3067\u304d\u307e\u3059\u3002
projectOverviewTitle=\u6982\u8981
bonitaMarketplace=Bonita \u30de\u30fc\u30b1\u30c3\u30c8\u30d7\u30ec\u30fc\u30b9
removeExtensionTooltip=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u304b\u3089\u62e1\u5f35\u6a5f\u80fd\u3092\u524a\u9664
details=\u8a73\u7d30
removeExtensionConfirmationTitle=\u62e1\u5f35\u6a5f\u80fd\u3092\u524a\u9664
removeExtensionConfirmation=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u304b\u3089\u62e1\u5f35\u5b50 '%s' \u3092\u524a\u9664\u3057\u307e\u3059\u304b\uff1f
extensionLoadingErrorTitle=\u30a8\u30af\u30b9\u30c6\u30f3\u30b7\u30e7\u30f3\u306e\u8aad\u307f\u8fbc\u307f\u30a8\u30e9\u30fc
extensionLoadingError=\u30a8\u30af\u30b9\u30c6\u30f3\u30b7\u30e7\u30f3\u306e\u8aad\u307f\u8fbc\u307f\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002\u8a73\u7d30\u306b\u3064\u3044\u3066\u306f\u30ed\u30b0\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
importExtensionTitle=%s \u3092\u8ffd\u52a0
importExtension=Maven\u4f9d\u5b58\u6027\u307e\u305f\u306f\u30a2\u30fc\u30ab\u30a4\u30d6\u3068\u3057\u3066\u62e1\u5f35\u6a5f\u80fd\u3092\u8ffd\u52a0\u3057\u307e\u3059\u3002
importExtensionButtonLabel=\u30ab\u30b9\u30bf\u30e0\u30a8\u30af\u30b9\u30c6\u30f3\u30b7\u30e7\u30f3\u3092\u8ffd\u52a0
unknownExtensionsTitle=\u305d\u306e\u4ed6\u306e\u4f9d\u5b58\u95a2\u4fc2
deleteUnknownTooltip=\u9078\u629e\u3057\u305f\u62e1\u5f35\u6a5f\u80fd\u3092\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u304b\u3089\u524a\u9664\u3057\u307e\u3059\u3002
delete=\u524a\u9664
importRemoteDependencyTip=Maven\u306e\u4f9d\u5b58\u5ea7\u6a19\u3092\u624b\u52d5\u3067\u6307\u5b9a\u3057\u3066\u3001%s\u3092\u8ffd\u52a0\u3057\u307e\u3059\u3002 MavenCentral\u3078\u306e\u30a4\u30f3\u30bf\u30fc\u30cd\u30c3\u30c8\u30a2\u30af\u30bb\u30b9\u3092\u5f37\u304f\u304a\u52e7\u3081\u3057\u307e\u3059\u3002 \u5fc5\u8981\u306b\u5fdc\u3058\u3066 <a>\u8ffd\u52a0\u306e\u30ea\u30e2\u30fc\u30c8\u30ea\u30dd\u30b8\u30c8\u30ea\u69cb\u6210</a>
dependencyNotFoundWhenImporting=\u8a2d\u5b9a\u3055\u308c\u305f\u30ea\u30e2\u30fc\u30c8\u30ea\u30dd\u30b8\u30c8\u30ea\u306b\u5bfe\u3057\u3066 %s \u3092\u89e3\u6c7a\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
dependencyCoordinate=\u4f9d\u5b58\u95a2\u4fc2\u5ea7\u6a19
manual=\u30ea\u30dd\u30b8\u30c8\u30ea\u304b\u3089
fromFile=\u30d5\u30a1\u30a4\u30eb\u304b\u3089
browse=\u30d6\u30e9\u30a6\u30ba...
file=\u30a4\u30f3\u30dd\u30fc\u30c8\u3059\u308b\u30d5\u30a1\u30a4\u30eb\u3092\u9078\u629e (%s \u30d5\u30a1\u30a4\u30eb\u306e\u307f)
importFromFileTip=\u30ed\u30fc\u30ab\u30eb\u30d5\u30a1\u30a4\u30eb\u304b\u3089 %s \u3092\u8ffd\u52a0\u3057\u307e\u3059\u3002 \u9078\u629e\u3057\u305f\u30d5\u30a1\u30a4\u30eb\u304c\u8a2d\u5b9a\u3055\u308c\u305f\u30ea\u30e2\u30fc\u30c8\u30ea\u30dd\u30b8\u30c8\u30ea\u306e\u4f55\u308c\u306b\u3082\u5b58\u5728\u3057\u306a\u3044\u5834\u5408\u3001\u4f9d\u5b58\u6027\u306f\u30ed\u30fc\u30ab\u30eb\u30ea\u30dd\u30b8\u30c8\u30ea\u306b\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3055\u308c\u307e\u3059\u3002
resolvedDependency=\u4f9d\u5b58\u95a2\u4fc2\u304c %s \u304b\u3089\u89e3\u6c7a\u3055\u308c\u307e\u3057\u305f
cannotResolveDependencyInstalledLocally=\u4f9d\u5b58\u95a2\u4fc2\u3092\u89e3\u6c7a\u3067\u304d\u307e\u305b\u3093\u3002\u30ed\u30fc\u30ab\u30eb\u30ea\u30dd\u30b8\u30c8\u30ea\u306b\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3055\u308c\u307e\u3059\u3002
editProjectMetadata=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u60c5\u5831\u306e\u7de8\u96c6
editProjectMetadataDescription=\u73fe\u5728\u306e\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u60c5\u5831 (\u540d\u524d\u3001\u8aac\u660e\u3001\u30d0\u30fc\u30b8\u30e7\u30f3\u3001Maven \u5ea7\u6a19) \u3092\u7de8\u96c6\u3057\u307e\u3059\u3002
name=\u540d\u524d
description=\u8aac\u660e\uff08\u30c7\u30a3\u30b9\u30af\u30ea\u30d7\u30b7\u30e7\u30f3\uff09
updatingProjectMetadata=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306e\u30e1\u30bf\u30c7\u30fc\u30bf\u3092\u66f4\u65b0\u3057\u3066\u3044\u307e\u3059...
addDatabaseDriverTitle=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u30c9\u30e9\u30a4\u30d0\u30fc\u3092\u8ffd\u52a0
addDatabaseDriverDesc=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u30b3\u30cd\u30af\u30bf\u3067\u4f7f\u7528\u3059\u308b JDBC \u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u30c9\u30e9\u30a4\u30d0\u3092\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3057\u307e\u3059\u3002 \u4ee5\u4e0b\u3067\u63d0\u6848\u3055\u308c\u3066\u3044\u306a\u3044\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u30c9\u30e9\u30a4\u30d0\u3092\u4f7f\u7528\u3059\u308b\u5fc5\u8981\u304c\u3042\u308b\u5834\u5408\u306f\u3001\u624b\u52d5\u3067\u30a4\u30f3\u30dd\u30fc\u30c8\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002
addDatabaseDriverQuestion=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u30b3\u30cd\u30af\u30bf\u304c\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3055\u308c\u307e\u3057\u305f\u3002\u3053\u306e\u30b3\u30cd\u30af\u30bf\u3092\u5b9f\u884c\u3059\u308b\u306b\u306f\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9JDBC\u30c9\u30e9\u30a4\u30d0\u304c\u5fc5\u8981\u3067\u3059\u3002 \u79c1\u305f\u3061\u306e\u63a8\u5968\u30ea\u30b9\u30c8\u304b\u3089\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u30c9\u30e9\u30a4\u30d0\u3092\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3057\u307e\u3059\u304b\uff1f\u305d\u3046\u3067\u306a\u3044\u5834\u5408\u306f\u3001\u5f8c\u3067\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3059\u308b\u304b\u3001\u624b\u52d5\u3067\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3067\u304d\u307e\u3059\u3002
databaseDriver=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u30c9\u30e9\u30a4\u30d0\u30fc
engineRestartWarning=Web\u30b5\u30fc\u30d0\u30fc\u3092\u518d\u8d77\u52d5\u3057\u307e\u3059
enhanceProject=Bonita \u30de\u30fc\u30b1\u30c3\u30c8\u30d7\u30ec\u30a4\u30b9\u304b\u3089\u62e1\u5f35\u6a5f\u80fd\u3092\u8ffd\u52a0\u3059\u308b\u304b\u3001\u72ec\u81ea\u306e\u62e1\u5f35\u6a5f\u80fd\u3092\u30a4\u30f3\u30dd\u30fc\u30c8\u3057\u3066\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u5f37\u5316\u3057\u307e\u3057\u3087\u3046\uff01 
upgradeBonitaExtensionTooltip=\u3053\u306e\u62e1\u5f35\u6a5f\u80fd\u306e\u65b0\u3057\u3044\u30d0\u30fc\u30b8\u30e7\u30f3\u306f\u3001Bonita \u30de\u30fc\u30b1\u30c3\u30c8\u30d7\u30ec\u30a4\u30b9\u3067\u5229\u7528\u3067\u304d\u307e\u3059\u3002
upgradeBonitaExtension=\u6700\u65b0\u30d0\u30fc\u30b8\u30e7\u30f3\u306b\u66f4\u65b0
removeExtension=\u524a\u9664
updateExtensionConfirmationTitle=\u62e1\u5f35\u6a5f\u80fd\u306e\u78ba\u8a8d\u3092\u66f4\u65b0
updateExtensionConfirmation=\u62e1\u5f35 '%s' \u3092 %s \u304b\u3089 %s \u306b\u66f4\u65b0\u3057\u307e\u3059\u304b\uff1f
newProjectWizardTitle=\u65b0\u898f\u30d7\u30ed\u30b8\u30a7\u30af\u30c8
newProjectWizardDescription=\u6b21\u306e\u60c5\u5831\u3092\u542b\u3080\u65b0\u3057\u3044\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u4f5c\u6210\u3057\u307e\u3059
create=\u4f5c\u6210
dependencyAlreadyExistsInSameVersion=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306f\u3059\u3067\u306b\u30d0\u30fc\u30b8\u30e7\u30f3 '%s' \u3067\u3053\u306e\u62e1\u5f35\u6a5f\u80fd\u3092\u4f7f\u7528\u3057\u3066\u3044\u307e\u3059\u3002
dependencyAlreadyExistsInDifferentVersion=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306f\u3059\u3067\u306b\u30d0\u30fc\u30b8\u30e7\u30f3 '%s' \u3067\u3053\u306e\u62e1\u5f35\u6a5f\u80fd\u3092\u4f7f\u7528\u3057\u3066\u3044\u307e\u3059\u3002\u3053\u306e\u62e1\u5f35\u6a5f\u80fd\u306e\u4ed6\u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u3092\u4f7f\u7528\u3059\u308b\u306b\u306f\u30d0\u30fc\u30b8\u30e7\u30f3\u30d5\u30a3\u30fc\u30eb\u30c9\u3092\u66f4\u65b0\u3057\u3066\u304f\u3060\u3055\u3044\u3002 
upgradeExtension=\u66f4\u65b0
upgradeExtensionTooltip=\u3053\u306e\u62e1\u5f35\u6a5f\u80fd\u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u3092\u66f4\u65b0\u3059\u308b
addExtensionPageTitle=\u30a8\u30af\u30b9\u30c6\u30f3\u30b7\u30e7\u30f3\u3092\u8ffd\u52a0
addExtensionPageDescription=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306e\u6982\u8981\u3092\u4f7f\u7528\u3057\u3066\u3001\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306b\u62e1\u5f35\u6a5f\u80fd\u3092\u8ffd\u52a0\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002
extensions=\u62e1\u5f35\u6a5f\u80fd
modify=\u5909\u66f4
repositories=\u30ea\u30dd\u30b8\u30c8\u30ea
repositoriesDescription=Bonita\u62e1\u5f35\u3092\u53d6\u5f97\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u308bMaven\u30ea\u30dd\u30b8\u30c8\u30ea\u3092\u69cb\u6210\u3057\u307e\u3059\u3002\u8a8d\u8a3c\u306f\u30b5\u30fc\u30d0\u30fc\u30bb\u30af\u30b7\u30e7\u30f3\u3067\u7ba1\u7406\u3055\u308c\u307e\u3059\u3002
servers=\u30b5\u30fc\u30d0\u30fc
proxies=\u30d7\u30ed\u30ad\u30b7
mirrors=\u30df\u30e9\u30fc
id=ID
url=URL
releases=\u30ea\u30ea\u30fc\u30b9
snapshots=\u30b9\u30ca\u30c3\u30d7\u30b7\u30e7\u30c3\u30c8
enabled=\u6709\u52b9
updatePolicy=\u30dd\u30ea\u30b7\u30fc\u3092\u66f4\u65b0
checksumPolicy=\u30c1\u30a7\u30c3\u30af\u30b5\u30e0\u30dd\u30ea\u30b7\u30fc
add=\u8ffd\u52a0
addRepositoryTooltip=Maven\u69cb\u6210\u306b\u65b0\u3057\u3044\u30a2\u30af\u30bb\u30b9\u53ef\u80fd\u306a\u30ea\u30dd\u30b8\u30c8\u30ea\u3092\u8ffd\u52a0\u3057\u307e\u3059\u3002
deleteRepositoryTooltip=Maven\u8a2d\u5b9a\u304b\u3089\u3053\u306e\u30ea\u30dd\u30b8\u30c8\u30ea\u3092\u524a\u9664\u3057\u307e\u3059\u3002\u3053\u306e\u30ea\u30dd\u30b8\u30c8\u30ea\u304b\u3089\u62e1\u5f35\u6a5f\u80fd\u3092\u53d6\u5f97\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u306a\u304f\u306a\u308a\u307e\u3059\u3002 
mavenProfile=Maven \u30d7\u30ed\u30d5\u30a1\u30a4\u30eb
mavenProfileHint=Maven \u30ea\u30dd\u30b8\u30c8\u30ea\u69cb\u6210\u306f\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u3067\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u307e\u3059\u3002\nBonita \u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3067\u4f7f\u7528\u3055\u308c\u3066\u3044\u308b\u30ea\u30dd\u30b8\u30c8\u30ea\u3092\u69cb\u6210\u3059\u308b\u305f\u3081\u306b\u3001Bonita \u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u3092\u4f7f\u7528\u3059\u308b\u3053\u3068\u3092\u304a\u52e7\u3081\u3057\u307e\u3059\u3002
encryptionMasterPassword=\u30de\u30b9\u30bf\u30fc\u30d1\u30b9\u30ef\u30fc\u30c9\uff08\u6697\u53f7\u5316\uff09
updateMasterPasswordWarning=\u30de\u30b9\u30bf\u30fc\u30d1\u30b9\u30ef\u30fc\u30c9\u306f\u30b5\u30fc\u30d0\u30fc\u30d1\u30b9\u30ef\u30fc\u30c9\u306e\u6697\u53f7\u5316\u306b\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002\n\u65e2\u5b58\u306e\u30de\u30b9\u30bf\u30fc\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u66f4\u65b0\u3059\u308b\u5834\u5408\u306f\u3001\u3059\u3079\u3066\u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u518d\u5ea6\u751f\u6210\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
encryptionLink=<a>\u30d1\u30b9\u30ef\u30fc\u30c9\u306e\u6697\u53f7\u5316</a> \u306f\u30aa\u30d7\u30b7\u30e7\u30f3\u3067\u3059\u304c\u3001Maven\u69cb\u6210\u30d5\u30a1\u30a4\u30eb\uff08settings.xml\uff09\u3092\u5171\u6709\u3059\u308b\u5834\u5408\u306b\u63a8\u5968\u3055\u308c\u307e\u3059\u3002
addServerTooltip=Maven\u69cb\u6210\u306b\u65b0\u3057\u3044\u30b5\u30fc\u30d0\u30fc\u3092\u8ffd\u52a0\u3057\u307e\u3059\u3002
deleteServerTooltip=Maven\u69cb\u6210\u304b\u3089\u3053\u306e\u30b5\u30fc\u30d0\u30fc\u3092\u524a\u9664\u3057\u307e\u3059\u3002
serversLink=<a>\u30b5\u30fc\u30d0\u30fc</a> \u306f\u3001\u30ea\u30dd\u30b8\u30c8\u30ea\u3084\u30df\u30e9\u30fc\u8a8d\u8a3c\u3092\u7ba1\u7406\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002
removeServerConfirmationTitle=\u30b5\u30fc\u30d0\u30fc\u306e\u78ba\u8a8d\u3092\u524a\u9664
removeServerConfirmation=\u30b5\u30fc\u30d0\u30fc\u306e '%s' \u3092Maven\u69cb\u6210\u304b\u3089\u524a\u9664\u3057\u307e\u3059\u304b\uff1f
removeRepositoryConfirmationTitle=\u30ea\u30dd\u30b8\u30c8\u30ea\u306e\u78ba\u8a8d\u3092\u524a\u9664
removeRepositoryConfirmation=Maven\u8a2d\u5b9a\u304b\u3089\u30ea\u30dd\u30b8\u30c8\u30ea\u306e\u300c%s\u300d\u3092\u524a\u9664\u3057\u307e\u3059\u304b\uff1f
serverId=ID
serverIdHint=\u3053\u308c\u306f\u30b5\u30fc\u30d0\u30fc\u306eID\u3067\u3059\uff08\u30ed\u30b0\u30a4\u30f3\u3059\u308b\u30e6\u30fc\u30b6\u30fc\u306eID\u3067\u306f\u3042\u308a\u307e\u305b\u3093\uff09\u3002\nMaven\u304c\u63a5\u7d9a\u3057\u3088\u3046\u3068\u3059\u308b\u30ea\u30dd\u30b8\u30c8\u30ea/\u30df\u30e9\u30fc\u306eid\u8981\u7d20\u3068\u4e00\u81f4\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
userPasswordAuthentication=\u30e6\u30fc\u30b6\u30fc\u540d / \u30d1\u30b9\u30ef\u30fc\u30c9
sshAuthentication=SSH
username=\u30e6\u30fc\u30b6\u30fc\u540d
password=\u30d1\u30b9\u30ef\u30fc\u30c9
authentication=\u8a8d\u8a3c
showPassword=\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u8868\u793a
encryptPassword=\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u6697\u53f7\u5316
encryptButtonTooltip=\u6697\u53f7\u5316\u3092\u884c\u3046\u306b\u306f\u30de\u30b9\u30bf\u30fc\u30d1\u30b9\u30ef\u30fc\u30c9\u304c\u5fc5\u8981\u3067\u3059\u3002
privateKey=\u30d7\u30e9\u30a4\u30d9\u30fc\u30c8\u30ad\u30fc
passphrase=\u30d1\u30b9\u30d5\u30ec\u30fc\u30ba
showPassphrase=\u30d1\u30b9\u30d5\u30ec\u30fc\u30ba\u3092\u8868\u793a
clearPasswordTooltip=ssh \u8a8d\u8a3c\u3092\u4f7f\u7528\u3059\u308b\u306b\u306f\u3001\u30d1\u30b9\u30ef\u30fc\u30c9\u30d5\u30a3\u30fc\u30eb\u30c9\u306f\u7a7a\u306b\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
clearPassword=\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u30af\u30ea\u30a2
error=\u30a8\u30e9\u30fc
proxiesLink=<a>\u30d7\u30ed\u30ad\u30b7</a>\u306e\u80cc\u5f8c\u3067\u52d5\u4f5c\u3059\u308b\u3088\u3046\u306bMaven\u3092\u8a2d\u5b9a\u3057\u307e\u3059\u3002\u4e00\u5ea6\u306b1\u3064\u306e\u30d7\u30ed\u30ad\u30b7\u306e\u307f\u6709\u52b9\u306b\u3067\u304d\u307e\u3059\u3002
addProxyTooltip=Maven\u69cb\u6210\u306b\u65b0\u3057\u3044\u30d7\u30ed\u30ad\u30b7\u3092\u8ffd\u52a0\u3057\u307e\u3059\u3002
deleteProxyTooltip=Maven\u8a2d\u5b9a\u304b\u3089\u3053\u306e\u30d7\u30ed\u30ad\u30b7\u3092\u524a\u9664\u3057\u307e\u3059\u3002
removeProxyConfirmationTitle=\u30d7\u30ed\u30ad\u30b7\u306e\u78ba\u8a8d\u3092\u524a\u9664
removeProxyConfirmation=Maven\u8a2d\u5b9a\u304b\u3089\u30d7\u30ed\u30ad\u30b7 '%s' \u3092\u524a\u9664\u3057\u307e\u3059\u304b\uff1f
active=\u30a2\u30af\u30c6\u30a3\u30d6
protocol=\u30d7\u30ed\u30c8\u30b3\u30eb
host=\u30db\u30b9\u30c8
port=\u30dd\u30fc\u30c8
intValueExpected=\u671f\u5f85\u3055\u308c\u308b\u6574\u6570\u3002
nonProxyHost=\u975e\u30d7\u30ed\u30ad\u30b7\u30db\u30b9\u30c8
nonProxyHostsTootltip=\u3053\u308c\u306f\u30d7\u30ed\u30ad\u30b7\u3055\u308c\u308b\u3079\u304d\u3067\u306a\u3044\u30db\u30b9\u30c8\u306e\u30ea\u30b9\u30c8\u3067\u3059\u3002\n\u30ea\u30b9\u30c8\u306e\u533a\u5207\u308a\u6587\u5b57\u306f\u3001\u30d7\u30ed\u30ad\u30b7\u30b5\u30fc\u30d0\u306e\u60f3\u5b9a\u3055\u308c\u308b\u30bf\u30a4\u30d7\u3067\u3059\u3002\n\u30d1\u30a4\u30d7\u307e\u305f\u306f\u30ab\u30f3\u30de\u533a\u5207\u308a\u6587\u5b57\u306f\u30b3\u30e2\u30f3\u3067\u3059\u3002
mirrorsLink=\u30ea\u30dd\u30b8\u30c8\u30ea\u306e <a>\u30df\u30e9\u30fc</a> \u3092\u8a2d\u5b9a\u3057\u307e\u3059\u3002
addMirrorTooltip=Maven\u69cb\u6210\u306b\u65b0\u3057\u3044\u30df\u30e9\u30fc\u3092\u8ffd\u52a0\u3057\u307e\u3059\u3002
deleteMirrorTooltip=Maven\u306e\u8a2d\u5b9a\u304b\u3089\u3053\u306e\u30df\u30e9\u30fc\u3092\u524a\u9664\u3057\u307e\u3059\u3002
removeMirrorConfirmationTitle=\u30df\u30e9\u30fc\u78ba\u8a8d\u3092\u524a\u9664
removeMirrorConfirmation=Maven\u69cb\u6210\u304b\u3089\u30df\u30e9\u30fc '%s' \u3092\u524a\u9664\u3057\u307e\u3059\u304b\uff1f
mirrorOf=\u30df\u30e9\u30fc
mirrorUrlTooltip=\u3053\u306e\u30df\u30e9\u30fc\u306e\u30d9\u30fc\u30b9URL\u3002\n\u30d3\u30eb\u30c9\u30b7\u30b9\u30c6\u30e0\u306f\u3001\u5143\u306e\u30ea\u30dd\u30b8\u30c8\u30eaURL\u3067\u306f\u306a\u304f\u3001\u3053\u306eURL\u3092\u4f7f\u7528\u3057\u3066\u30ea\u30dd\u30b8\u30c8\u30ea\u306b\u63a5\u7d9a\u3057\u307e\u3059\u3002
mirrorOfTooltip=\u30df\u30e9\u30fc\u306e\u30ea\u30dd\u30b8\u30c8\u30ea\u306e id \u3067\u3059\u3002\n\u30df\u30e9\u30fc\u306e id \u3068\u4e00\u81f4\u3055\u305b\u306a\u3044\u3067\u304f\u3060\u3055\u3044\u3002
activate=\u30a2\u30af\u30c6\u30a3\u30d9\u30fc\u30c8
activateProxyTooltip=\u9078\u629e\u3057\u305f\u30d7\u30ed\u30ad\u30b7\u3092\u30a2\u30af\u30c6\u30a3\u30d6\u306b\u8a2d\u5b9a
restoreDefaultConfirmationTitle=\u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u78ba\u8a8d\u3092\u5fa9\u5143\u3059\u308b
restoreDefaultConfirmation=Maven\u69cb\u6210\u306e\u3059\u3079\u3066\u306e\u5909\u66f4\u3092\u524a\u9664\u3057\u307e\u3059\u304b\uff1f
updatingConfiguration=\u8a2d\u5b9a\u3092\u66f4\u65b0\u3057\u3066\u3044\u307e\u3059...
preparingDefinitionUpdate=\u5b9a\u7fa9\u306e\u66f4\u65b0\u3092\u6e96\u5099\u3057\u3066\u3044\u307e\u3059...
updatePreview=\u5b9a\u7fa9\u306e\u66f4\u65b0\u30d7\u30ec\u30d3\u30e5\u30fc...
updateProcessesTitle=\u30d7\u30ed\u30bb\u30b9\u306e\u66f4\u65b0\u306e\u30d7\u30ec\u30d3\u30e5\u30fc
otherDependencyUpdateMessage=\u30a8\u30af\u30b9\u30c6\u30f3\u30b7\u30e7\u30f3\u304c\u66f4\u65b0\u307e\u305f\u306f\u524a\u9664\u3055\u308c\u3066\u304a\u308a\u3001\u305d\u308c\u306b\u5fdc\u3058\u3066\u30d7\u30ed\u30bb\u30b9\u69cb\u6210\u3092\u66f4\u65b0\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002\u6b21\u306e\u3053\u3068\u304c\u3067\u304d\u307e\u3059\:\n
updateActionsMessage=\u2022\u4e2d\u6b62\uff1a\u62e1\u5f35\u6a5f\u80fd\u306f\u4ee5\u524d\u306e\u72b6\u614b\u306b\u623b\u308a\u307e\u3059\n   \u2022\u5909\u66f4\u3092\u7121\u8996\u3057\u307e\u3059\u3002 \u30d7\u30ed\u30bb\u30b9\u306f\u5909\u66f4\u3055\u308c\u305a\u3001\u624b\u52d5\u3067\u66f4\u65b0\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\n   \u2022\u30d7\u30ed\u30bb\u30b9\u306e\u66f4\u65b0\u3092\u7d9a\u884c\u3057\u307e\u3059
definitionUpateMessage=\u30b3\u30cd\u30af\u30bf/\u30a2\u30af\u30bf\u30fc\u30d5\u30a3\u30eb\u30bf\u306e\u5b9a\u7fa9\u304c\u66f4\u65b0\u307e\u305f\u306f\u524a\u9664\u3055\u308c\u305f\u305f\u3081\u3001\u305d\u308c\u306b\u5fdc\u3058\u3066\u69cb\u6210\u3092\u66f4\u65b0\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002\u4ee5\u4e0b\u304c\u53ef\u80fd\u3067\u3059\:\n
abortingUpdate=\u30a2\u30c3\u30d7\u30c7\u30fc\u30c8\u3092\u4e2d\u65ad\u3057\u3066\u3044\u307e\u3059...
definitionUpdateWithBreakingChanges=\u4e00\u90e8\u306e\u8a2d\u5b9a\u306f\u3001\u5909\u66f4\u304c\u4e2d\u65ad\u3055\u308c\u305f\u305f\u3081\u81ea\u52d5\u7684\u306b\u66f4\u65b0\u3067\u304d\u307e\u305b\u3093\u3002\u5f8c\u3067\u624b\u52d5\u3067\u66f4\u65b0\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
definitionRemovedDescription=%s (%s) \u306e\u5b9a\u7fa9\u304c\u524a\u9664\u3055\u308c\u307e\u3057\u305f\u3002 %s \u500b\u306e\u8a2d\u5b9a\u304c\u524a\u9664\u3055\u308c\u307e\u3059\u3002
preparingProcessConfigurationUpdate=\u30d7\u30ed\u30bb\u30b9\u69cb\u6210\u306e\u66f4\u65b0\u3092\u6e96\u5099\u3057\u3066\u3044\u307e\u3059...
jarFileRemovedChangeDescription=%s \u306f\u524a\u9664\u3055\u308c\u307e\u3059
jarFileUpdatedChangeDescription=%s (%s \u2192 %s)
configurationToUpdateFound=%s \u30d7\u30ed\u30bb\u30b9\u8a2d\u5b9a\u304c\u898b\u3064\u304b\u308a\u307e\u3057\u305f\u3002
jarFileAddedChangeDescription=%s \u306f\u4e00\u6642\u7684\u306b\u8ffd\u52a0\u3055\u308c\u307e\u3059\u3002
back=\u623b\u308b
connectors=\u30b3\u30cd\u30af\u30bf
connectorsHint=%s \u62e1\u5f35\u306b\u3088\u3063\u3066\u3082\u305f\u3089\u3055\u308c\u305f\u30b3\u30cd\u30af\u30bf\u306e\u6982\u8981\u3002\n\u30b3\u30cd\u30af\u30bf\u306f\u5b9a\u7fa9\u3068\u5b9f\u88c5\u3067\u69cb\u6210\u3055\u308c\u3066\u3044\u307e\u3059\u3002 \u7279\u5b9a\u306e\u5b9a\u7fa9\u306b\u5bfe\u3057\u3066\u3044\u304f\u3064\u304b\u306e\u5b9f\u88c5\u3092\u63d0\u4f9b\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002
implementations=\u5b9f\u88c5\:
preparingUpdate=\u62e1\u5f35\u6a5f\u80fd\u306e\u66f4\u65b0\u3092\u6e96\u5099\u3057\u3066\u3044\u307e\u3059...
computingPreview=\u30d7\u30ec\u30d3\u30e5\u30fc \u30d7\u30ec\u30d3\u30e5\u30fc...
applyingChanges=\u5909\u66f4\u3092\u9069\u7528\u3057\u3066\u3044\u307e\u3059...
actorFilters=\u30a2\u30af\u30bf\u30fc\u30d5\u30a3\u30eb\u30bf\u30fc
actorFiltersHint=%s  \u62e1\u5f35\u5b50\u306b\u3088\u3063\u3066\u3082\u305f\u3089\u3055\u308c\u308b\u30a2\u30af\u30bf\u30fc\u30d5\u30a3\u30eb\u30bf\u30fc\u306e\u8981\u7d04\u3002\n\u30a2\u30af\u30bf\u30fc\u30d5\u30a3\u30eb\u30bf\u30fc\u306f\u3001\u5b9a\u7fa9\u3068\u5b9f\u88c5\u3067\u69cb\u6210\u3055\u308c\u3066\u3044\u307e\u3059\u3002 \u7279\u5b9a\u306e\u5b9a\u7fa9\u306b\u5bfe\u3057\u3066\u3001\u3044\u304f\u3064\u304b\u306e\u5b9f\u88c5\u3092\u63d0\u4f9b\u3067\u304d\u307e\u3059\u3002
restApiExtensions=REST API \u62e1\u5f35
restApiDetailsHint=%s \u62e1\u5f35\u5b50\u306b\u3088\u3063\u3066\u3082\u305f\u3089\u3055\u308c\u308bREST API\u306e\u8981\u7d04\u3002\nREST API\u306f\u3001HTTP\u30e1\u30bd\u30c3\u30c9\u3001\u30d1\u30b9\u30c6\u30f3\u30d7\u30ec\u30fc\u30c8\u3001\u304a\u3088\u30731\u3064\u307e\u305f\u306f\u8907\u6570\u306e\u6a29\u9650\u306b\u3088\u3063\u3066\u5b9a\u7fa9\u3055\u308c\u307e\u3059\u3002\n\u6a29\u9650\u306f\u3001API\u3078\u306e\u30a2\u30af\u30bb\u30b9\u3092\u8a31\u53ef\u3059\u308b\u7d44\u7e54\u3078\u306e\u30de\u30c3\u30d4\u30f3\u30b0\u3067\u3059\u3002
httpMethodMissing=HTTP \u30e1\u30bd\u30c3\u30c9\u304c\u3042\u308a\u307e\u305b\u3093\u3002
pathMissing=\u30d1\u30b9\u304c\u3042\u308a\u307e\u305b\u3093\u3002
permissionsMissing=\u6a29\u9650\u304c\u3042\u308a\u307e\u305b\u3093\u3002
permissions=\u6a29\u9650\:
path=\u30d1\u30b9\:
copyToClipboard=\u30af\u30ea\u30c3\u30d7\u30dc\u30fc\u30c9\u306b\u30b3\u30d4\u30fc
editPermissionsMapping=\u6a29\u9650\u306e\u30de\u30c3\u30d4\u30f3\u30b0\u3092\u7de8\u96c6
usages=\u4f7f\u3044\u65b9
connectorUsages=\u30b3\u30cd\u30af\u30bf %s \u306e\u4f7f\u7528\u6cd5\u3002
findUsages=\u4f7f\u7528\u72b6\u6cc1\u3092\u691c\u7d22
findingUsages=\u4f7f\u7528\u72b6\u6cc1\u3092\u691c\u7d22\u3057\u3066\u3044\u307e\u3059...
diagramNotFound=\u30c0\u30a4\u30a2\u30b0\u30e9\u30e0\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093
diagramNotFoundMessage=\u30d7\u30ed\u30bb\u30b9 %s \u306e\u30c0\u30a4\u30a2\u30b0\u30e9\u30e0\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
process=\u30d7\u30ed\u30bb\u30b9\:
connectorUsagesDescription=\u6b21\u306e\u30c4\u30ea\u30fc\u306f\u30b3\u30cd\u30af\u30bf %s\u306e\u3059\u3079\u3066\u306e\u4f7f\u7528\u72b6\u6cc1\u3092\u8868\u793a\u3057\u307e\u3059\u3002\u3064\u307e\u308a\u3001 \u3053\u306e\u30b3\u30cd\u30af\u30bf\u3092\u4f7f\u7528\u3057\u3066\u3044\u308b\u3059\u3079\u3066\u306e\u30d7\u30ed\u30bb\u30b9\u30a2\u30af\u30c6\u30a3\u30d3\u30c6\u30a3\u3067\u3059\u3002\n
noConnectorUsagesFound=\u30b3\u30cd\u30af\u30bf %s \u306fBonita\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3067\u306f\u4f7f\u7528\u3055\u308c\u307e\u305b\u3093\u3002
search=\u691c\u7d22
actorFilterUsagesDescription=\u4ee5\u4e0b\u306e\u30c4\u30ea\u30fc\u306b\u306f\u3001\u30a2\u30af\u30bf\u30fc\u30d5\u30a3\u30eb\u30bf\u30fc\uff05s\u306e\u3059\u3079\u3066\u306e\u30b9\u30c6\u30fc\u30b8\u3001\u3064\u307e\u308a\u3053\u306e\u30a2\u30af\u30bf\u30fc\u30d5\u30a3\u30eb\u30bf\u30fc\u3092\u4f7f\u7528\u3057\u3066\u3044\u308b\u3059\u3079\u3066\u306e\u30d7\u30ed\u30bb\u30b9\u30a2\u30af\u30c6\u30a3\u30d3\u30c6\u30a3\u304c\u8868\u793a\u3055\u308c\u307e\u3059\u3002
addConnector=\u30b3\u30cd\u30af\u30bf...
addActorFilter=\u30a2\u30af\u30bf\u30fc\u30d5\u30a3\u30eb\u30bf\u30fc...
addTheme=\u30c6\u30fc\u30de...
addRestApiExtension=REST API \u62e1\u5f35...
addOther=\u305d\u306e\u4ed6...
legacyArchiveFormatHint=Zip\u30a2\u30fc\u30ab\u30a4\u30d6\u5f62\u5f0f\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
extension=\u62e1\u5f35
extensionIsNotAConnector=\u3053\u306e\u62e1\u5f35\u5b50\u306f\u30b3\u30cd\u30af\u30bf\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002
extensionIsNotAnActorFilter=\u3053\u306e\u62e1\u5f35\u5b50\u306f\u30a2\u30af\u30bf\u30fc\u30d5\u30a3\u30eb\u30bf\u30fc\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002
extensionIsNotARestApiExtension=\u3053\u306e\u62e1\u5f35\u5b50\u306f\u3001REST API \u62e1\u5f35\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002
extensionIsNotAThemeExtension=\u3053\u306e\u62e1\u5f35\u5b50\u306f\u30c6\u30fc\u30de\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002
cannotAccessMarketplace=Bonita \u30de\u30fc\u30b1\u30c3\u30c8\u30d7\u30ec\u30a4\u30b9\u306b\u30a2\u30af\u30bb\u30b9\u3067\u304d\u307e\u305b\u3093
cannotLoadMarketplaceMessage=Bonita \u30de\u30fc\u30b1\u30c3\u30c8\u30d7\u30ec\u30a4\u30b9\u3092\u30ed\u30fc\u30c9\u3067\u304d\u307e\u305b\u3093\u3002\u30a4\u30f3\u30bf\u30fc\u30cd\u30c3\u30c8\u63a5\u7d9a\u306e\u554f\u984c\u306b\u95a2\u9023\u3057\u3066\u3044\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
cannotUpdateMarketplaceMessage=Bonita \u30de\u30fc\u30b1\u30c3\u30c8\u30d7\u30ec\u30a4\u30b9\u3092\u66f4\u65b0\u3067\u304d\u307e\u305b\u3093\u3002\u30a4\u30f3\u30bf\u30fc\u30cd\u30c3\u30c8\u63a5\u7d9a\u306e\u554f\u984c\u306b\u95a2\u9023\u3057\u3066\u3044\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
localDependencyTooltip=\u30ed\u30fc\u30ab\u30eb\u4f9d\u5b58\u95a2\u4fc2 - \u3053\u306e\u4f9d\u5b58\u95a2\u4fc2\u306f\u624b\u52d5\u3067\u30a4\u30f3\u30dd\u30fc\u30c8\u3055\u308c\u3001\u30d5\u30a1\u30a4\u30eb\u30b7\u30b9\u30c6\u30e0\u306e\u30ed\u30fc\u30ab\u30eb\u4f9d\u5b58\u95a2\u4fc2\u30b9\u30c8\u30a2\u306b\u4fdd\u5b58\u3055\u308c\u307e\u3059\u3002
remoteDependencyTooltip=\u5916\u90e8\u4f9d\u5b58\u95a2\u4fc2 - \u3053\u306e\u4f9d\u5b58\u95a2\u4fc2\u306f\u3001\u30ea\u30e2\u30fc\u30c8\u30ea\u30dd\u30b8\u30c8\u30ea\u304b\u3089Maven\u3092\u4ecb\u3057\u3066\u53d6\u5f97\u3055\u308c\u307e\u3059\u3002
marketplaceDependencyTooltip=Bonita \u4f9d\u5b58\u95a2\u4fc2 - \u3053\u306e\u4f9d\u5b58\u95a2\u4fc2\u306fBonita Marketplace \u306b\u3088\u3063\u3066\u63d0\u4f9b\u3055\u308c\u3001\u4e00\u5143\u7684\u306a\u30ea\u30dd\u30b8\u30c8\u30ea\u304b\u3089 Maven \u3092\u901a\u3058\u3066\u53d6\u5f97\u3055\u308c\u307e\u3059\u3002
editMavenCoordinates=Maven \u5ea7\u6a19\u306e\u7de8\u96c6
editMavenCoordinatesTooltip=Maven\u3067\u30d3\u30eb\u30c9\u3055\u308c\u3066\u3044\u306a\u3044\u30ed\u30fc\u30ab\u30eb\u4f9d\u5b58\u95a2\u4fc2\u306eMaven\u5ea7\u6a19(groupId\u3001artifactId\u3001\u30d0\u30fc\u30b8\u30e7\u30f3\u3084\u5206\u985e)\u3092\u7de8\u96c6\u3067\u304d\u307e\u3059\u3002
mavenPropertiesMissing=\u30a4\u30f3\u30dd\u30fc\u30c8\u3055\u308c\u305f jar \u30d5\u30a1\u30a4\u30eb\u306bMaven \u30d7\u30ed\u30d1\u30c6\u30a3\u60c5\u5831\u304c\u3042\u308a\u307e\u305b\u3093\u3002maven \u3067\u3053\u306e jar \u30d5\u30a1\u30a4\u30eb\u3092\u30d3\u30eb\u30c9\u3059\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u5f93\u6765\u306e jar \u30d5\u30a1\u30a4\u30eb\u306f\u30a4\u30f3\u30dd\u30fc\u30c8\u3067\u304d\u307e\u305b\u3093\u3002
extensionView=\u30a8\u30af\u30b9\u30c6\u30f3\u30b7\u30e7\u30f3\uff08\u62e1\u5f35\uff09
extensionViewTooltip=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u62e1\u5f35\u30d3\u30e5\u30fc\u3092\u958b\u304d\u3001\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u62e1\u5f35\u306e\u6982\u8981\u3092\u78ba\u8a8d\u3057\u3001\u305d\u308c\u3089\u3092\u66f4\u65b0\u3057\u307e\u3059\u3002
elementView=\u30a8\u30ec\u30e1\u30f3\u30c8
elementViewTooltip=\u8981\u7d20\u30d3\u30e5\u30fc\u3092\u958b\u304d\u3001\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u69cb\u6210\u3059\u308b\u8981\u7d20\u3092\u30c1\u30e9\u30c3\u3068\u898b\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002
repositoryIdMandatory=\u30ea\u30dd\u30b8\u30c8\u30ea ID \u306f\u5fc5\u9808\u3067\u3059\u3002
repositoryNameMandatory=\u30ea\u30dd\u30b8\u30c8\u30ea '%s' \u306b\u540d\u524d\u304c\u3042\u308a\u307e\u305b\u3093\u3002\u3053\u306e\u30d5\u30a3\u30fc\u30eb\u30c9\u306f\u5fc5\u9808\u3067\u3059\u3002
repositoryUrlMandatory=\u30ea\u30dd\u30b8\u30c8\u30ea '%s' \u306fURL\u3092\u6301\u3063\u3066\u3044\u307e\u305b\u3093\u3002\u3053\u306e\u30d5\u30a3\u30fc\u30eb\u30c9\u306f\u5fc5\u9808\u3067\u3059\u3002
invalidMavenConfigurationTitle=\u7121\u52b9\u306aMaven \u8a2d\u5b9a
invalidMavenConfiguration=Maven \u8a2d\u5b9a\u30d5\u30a1\u30a4\u30eb (%s) \u306b\u30a8\u30e9\u30fc\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002
proxyIdMandatory=\u30d7\u30ed\u30ad\u30b7 ID\u306f\u5fc5\u9808\u3067\u3059\u3002
proxyHostMandatory=\u30d7\u30ed\u30ad\u30b7 '%s' \u306f\u30db\u30b9\u30c8\u3092\u6301\u3063\u3066\u3044\u307e\u305b\u3093\u3002\u3053\u306e\u30d5\u30a3\u30fc\u30eb\u30c9\u306f\u5fc5\u9808\u3067\u3059\u3002
mirrorIdMandatory=\u30df\u30e9\u30fc ID \u306f\u5fc5\u9808\u3067\u3059\u3002
mirrorUrlMandatory=\u30df\u30e9\u30fc '%s' \u306fURL\u3092\u6301\u3063\u3066\u3044\u307e\u305b\u3093\u3002\u3053\u306e\u30d5\u30a3\u30fc\u30eb\u30c9\u306f\u5fc5\u9808\u3067\u3059\u3002
mavenConfigurationUpdatedTitle=Maven \u306e\u8a2d\u5b9a\u304c\u66f4\u65b0\u3055\u308c\u307e\u3057\u305f
mavenConfigurationUpdated=Maven\u8a2d\u5b9a\u30d5\u30a1\u30a4\u30eb (%s) \u304c\u66f4\u65b0\u3055\u308c\u307e\u3057\u305f\u3002
projectDoesntContainsElement=\u3053\u306e\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306b\u306f %s \u304c\u542b\u307e\u308c\u3066\u3044\u307e\u305b\u3093\u3002
newElementTitle=\u65b0\u3057\u3044 %s \u3092\u4f5c\u6210
noDescription=\u8aac\u660e\u304c\u63d0\u4f9b\u3055\u308c\u3066\u3044\u307e\u305b\u3093
diagramZoomHint=\u73fe\u5728\u306e\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u5185\u306e\u3059\u3079\u3066\u306e\u30c0\u30a4\u30a2\u30b0\u30e9\u30e0\u306e\u6982\u8981\u3002
cannotReachMavenCentralRepositoryTitle=Maven Central\u30ea\u30dd\u30b8\u30c8\u30ea\u306b\u30a2\u30af\u30bb\u30b9\u3067\u304d\u307e\u305b\u3093
cannotReachMavenCentralRepositoryMessage=Studio \u306f Maven Central \u30ea\u30dd\u30b8\u30c8\u30ea\u306b\u30a2\u30af\u30bb\u30b9\u3067\u304d\u307e\u305b\u3093\u3002 \u63d0\u4f9b\u3055\u308c\u3066\u3044\u308bBonita\u62e1\u5f35\u6a5f\u80fd\u306e\u5229\u7528\u3059\u308b\u306b\u306f\u3001MavenCentral\u3078\u306e\u30a2\u30af\u30bb\u30b9\u3092\u8a2d\u5b9a\u3059\u308b\u3053\u3068\u3092\u5f37\u304f\u304a\u52e7\u3081\u3057\u307e\u3059\u3002\n\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\:\n\u2022 \u30a4\u30f3\u30bf\u30fc\u30cd\u30c3\u30c8\u63a5\u7d9a\n\u2022 \u30d7\u30ed\u30ad\u30b7\u8a2d\u5b9a\n\u2022 \u30df\u30e9\u30fc\u304c\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u306fVPN\u63a5\u7d9a\n\u2022 <a>Maven Central status</a>
validateExistingMavenConfigurationMessage=\u65e2\u5b58\u306e Maven \u69cb\u6210 (%s) \u304c\u5b58\u5728\u3057\u3066\u3044\u308b\u3088\u3046\u3067\u3059\u3002\u3053\u306e\u69cb\u6210\u304c\u6709\u52b9\u3067\u3042\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
configure=\u8a2d\u5b9a
retry=\u30ea\u30c8\u30e9\u30a4
returnToElementsView=\u30a8\u30ec\u30e1\u30f3\u30c8 \u30d3\u30e5\u30fc\u306b\u623b\u308a\u307e\u3059\u3002
returnToExtensionView=\u62e1\u5f35\u30d3\u30e5\u30fc\u306b\u623b\u308a\u307e\u3059\u3002
addExtensionMenuLabel=\u30a8\u30af\u30b9\u30c6\u30f3\u30b7\u30e7\u30f3\uff08\u62e1\u5f35\uff09
groupIdTootltip=Maven \u540d\u524d\u7a7a\u9593 id\u3002
artifactIdTootltip=Maven \u30c6\u30af\u30cb\u30ab\u30eb\u30d7\u30ed\u30b8\u30a7\u30af\u30c8 id.\n\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u540d\u304b\u3089\u53d6\u5f97\u3055\u308c\u307e\u3057\u305f\u3002
depArtifactIdTootltip=\u30d0\u30fc\u30b8\u30e7\u30f3\u304c\u7121\u3044 jar \u306e\u540d\u524d
classifierTooltip=\u5206\u985e\u5668\u306f\u3001\u540c\u3058POM\u304b\u3089\u4f5c\u6210\u3055\u308c\u3066\u3044\u308b\u304c\u3001\u5185\u5bb9\u304c\u7570\u306a\u308b\u30a2\u30fc\u30c6\u30a3\u30d5\u30a1\u30af\u30c8\u3092\u533a\u5225\u3057\u307e\u3059\u3002\n\u30d0\u30fc\u30b8\u30e7\u30f3\u756a\u53f7\u306e\u76f4\u5f8c\u306b\u30a2\u30fc\u30c6\u30a3\u30d5\u30a1\u30af\u30c8\u540d\u306b\u4ed8\u52a0\u3055\u308c\u308b\u306e\u306f\u3001\uff08\u5b58\u5728\u3059\u308b\u5834\u5408\uff09\u30aa\u30d7\u30b7\u30e7\u30f3\u306e\u4efb\u610f\u306e\u6587\u5b57\u5217\u3067\u3059\u3002
projectElements=\u30a8\u30ec\u30e1\u30f3\u30c8
bonitaExtensions=Bonita \u30a8\u30af\u30b9\u30c6\u30f3\u30b7\u30e7\u30f3\uff08\u62e1\u5f35\uff09
bonitaExtensionTooltip=Bonita \u3067\u51e6\u7406\u3055\u308c\u308b\u62e1\u5f35\: \u30b3\u30cd\u30af\u30bf\u3001\u30a2\u30af\u30bf\u30fc\u30d5\u30a3\u30eb\u30bf\u30fc\u3001REST API \u62e1\u5f35\u3084\u30c6\u30fc\u30de\u3002
otherExtensionsTooltip=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u30c9\u30e9\u30a4\u30d0\u30fc\u3001\u307e\u305f\u306f\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3067\u5fc5\u8981\u306b\u306a\u308b\u53ef\u80fd\u6027\u306e\u3042\u308b\u3042\u3089\u3086\u308b\u7a2e\u985e\u306e\u4f9d\u5b58\u95a2\u4fc2\uff08Java\u4f9d\u5b58\u95a2\u6027...\uff09
projectElementsTooltip=Bonita\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u69cb\u6210\u3059\u308b\u4e3b\u306a\u30a8\u30ec\u30e1\u30f3\u30c8\u3002
showMore=\u8a73\u7d30\u3092\u8868\u793a
viewSource=\u30bd\u30fc\u30b9\u3092\u8868\u793a
viewSourceTooltip=%s\u3078
processDiagram=\u30d7\u30ed\u30bb\u30b9 \u30c0\u30a4\u30e4\u30b0\u30e9\u30e0
refresh=\u30ea\u30d5\u30ec\u30c3\u30b7\u30e5
refreshTooltip=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u30ea\u30d5\u30ec\u30c3\u30b7\u30e5