NewProcessButtonLabel=Nuevo
OpenProcessButtonLabel=Abrir
SaveProcessButtonLabel=Guardar
PrintProcessButtonLabel=Imprimir
CopyButtonLabel=Copiar
PasteButtonLabel=Pegar
HelpButtonLabel=Ayuda
WelcomeButtonLabel=Bienvenido
openProcessWizardPage_title=Abrir un proceso existente
unableTofindLogMessage=Imposible ubicar el archivo de registro en su sistema de archivos. Puede que no halla sido creado aun.
unableTofindLogTitle=Error al abrir
PreferencesButtonLabel=Preferencias
badWorkspaceVersionTitle=Conflicto de versiones del espacio de trabajo
badWorkspaceVersionMessage=Su \u00e1rea de trabajo actual\: {0} tiene una versi\u00f3n diferente ({1}) que {2} {3}. Otro usuario puede haber migrado este espacio de trabajo a una versi\u00f3n m\u00e1s reciente. Usted ya no est\u00e1 permitido el uso de este espacio de trabajo con esta versi\u00f3n de {4}. Se abrir\u00e1 el espacio de trabajo predeterminado.
resfreshConnectors=actualizando conectores...
aboutText={3} Edition\nVersion \: {0}\nVersion id \: {1}\nBuild id \: {2}\nCopyright \u00a9 {4} S.A., 2009-{5}\nAll rights reserved. 
maximizeCoolbarTooltip=Maximizar
reduceCoolbarTooltip=Minimizar
initializingCurrentRepository=Inicializando proyecto actual ...
shuttingDown=Detenci\u00f3n del motor ...
jreNotFoundTitle=No JRE detectado
jreNotFoundMessage=No se encontr\u00f3 un JRE. Quiere abrir la p\u00e1gina de preferencias de Java?
invalidWorkspaceTitle=Workspace Invalido
invalidWorkspace={0} no es un espacio de trabajo v\u00e1lido. La aplicaci\u00f3n se inicializar\u00e1 sin importar ning\u00fan espacio de trabajo.
failedToOpenLogTitle=Abrir el log ha fallado
failedToOpenLogMessage=Archivo de registro es demasiado grande para ser abierto con {1}. Por favor, utilice el editor de texto externo de su elecci\u00f3n y abra el siguiente archivo\:{0}
doNotDisplayForOtherDiagrams=No mostrar para otros diagramas nuevos
noProcessAvailable=Ning\u00fan diagrama abierto recientemente
offlineRepositoryTitle=Proyecto offline 
offlineRepositoryMessage=El proyecto {0} est\u00e1 actualmente offline. No ser\u00e1s capaz de actualizar/confirmar cambios en modo offline.
incompatibleJavaVersionTitle=Versi\u00f3n Java incompatible
incompatibleJavaVersionMessage=Est\u00e1s ejecutando %s usando una versi\u00f3n de Java incompatible (%s).\n Las versiones soportadas son\: %s.
exitWarningMessage=Salir {0} ?  \n\nCerrar el Studio eliminar\u00e1 el trabajo no guardado en el {1} y en el {2}. Aseg\u00farese de haber salvado cualquier elemento abierto en el {2} y exportar sus recursos personalizados del {1}.  \n\nNota\: En <A>Preferencias > Base de Datos</A>, usted puede desmarcar la opci\u00f3n "Limpiar base de datos al salir" para mantener el contenido de su base de datos.
NewButtonLabel=Nuevo
NewButtonTooltip=Crear un nuevo recurso en el proyecto
organization=Organizaci\u00f3n...
businessDataModel=Modelo de Datos de Negocio
bdmAccessControl=Control de acceso BDM
profile=Perfil
applicationDescriptor=Descriptor de la aplicaci\u00f3n
applicationPage=P\u00e1gina de la aplicaci\u00f3n
layout=Layout
customWidget=Widget personalizado
fragment=Fragmento
restAPIExtension=Extensi\u00f3n API REST...
connectorDef=Definici\u00f3n de Conector...
connectorImpl=Implementaci\u00f3n del conector...
actorFilterDef=Definici\u00f3n de filtro de actor...
actorFilterImpl=Implementaci\u00f3n del filtro de actor...
newGroovy=Groovy...
theme=Tema...
importDragDropInfoTitle=Importar Drag & Drop
importDragDropInfo=Puedes importar un archivo Bos al desplegarlo en el explorador de proyecto Bonita.\nOtros archivos son ignorados.
creatingArchive=Creando archivo %s...
buildError=Se ha producido un error al construir %s
deployErrorTitle=Error al desplegar
buildErrorHelp=El proyecto no ha sido desplegado.\nCompruebe el artefacto involucrado para posibles errores y vuelva a intentarlo.\nPara m\u00e1s informaci\u00f3n, revise el log del Studio (en el men\u00fa `Ayuda`).
validationErrorTitle=Error de validaci\u00f3n
validationError=Se han detectado los siguientes errores en tu proyecto.\nEl proyecto no puede ser desplegado hasta que se corrijan estos errores.\nComprueba los posibles errores en los archivos involucrados e int\u00e9ntalo de nuevo.
bdmGenerationError=Se ha producido un error al generar el archivo Java del Modelo de Datos de Negocio.
selectArtifactToDeployTitle=Seleccionar artefactos a desplegar
selectArtifactToDeploy=Seleccione los artefactos, compruebe las opciones y despliegue (en el runtime del Studio).
deploy=Desplegar
selectAll=Seleccionar Todo
selectNone=Seleccionar nada
searchArtifact=Buscar artefactos
expandAll=Expandir todo
collapseAll=Colapsar todo
buildErrorTitle=Error de construcci\u00f3n
build=Construir
deployStatus=Estado del despliegue
deployStatusMessage=Estado del despliegue a continuaci\u00f3n\:
cleanBDMDatabase=Limpiar la base de datos del BDM antes de desplegar
deployOptions=Opciones de despligue
DeployButtonLabel=Desplegar
environment=Configuraci\u00f3n de entorno del proceso
environmentTootltip=Los valores de par\u00e1metros, los mapas de actores, las dependencias (jar) de terceros, los scripts Groovy, las implementaciones de filtros de actor y conectores seleccionadas en la configuraci\u00f3n ser\u00e1n incorporados en los archivos bar de procesos.
processes=Procesos
selectLatestVersion=Seleccione s\u00f3lo las \u00faltimas versiones de procesos
cannotResolveProcess=%s (%s) no se puede resolver\: %s
cannotEnableProcess=%s (%s) ha sido desplegado pero no puede ser activado.
appDescriptorUnknownAppPage=Descriptor de la aplicaci\u00f3n '%s'\: No se ha encontrado la p\u00e1gina de aplicaci\u00f3n '%s'.
appDescriptorUnknownPageToken=Descriptor de la aplicaci\u00f3n '%s'\: No existe el token de p\u00e1gina de aplicaci\u00f3n '%s'.
appDescriptorUnknownLayoutPage=Descriptor de la aplicaci\u00f3n '%s'\: No se ha encontrado el layout de aplicaci\u00f3n '%s'.
appDescriptorUnknownTheme=Descriptor de la aplicaci\u00f3n '%s'\: No se ha encontrado el tema de aplicaci\u00f3n '%s'.
deploySuccessMsg=Todos los artefactos se han desplegado con \u00e9xito.
validateProcess=Validar antes de desplegar
portalAppName=Portal
youCanOpenApp=Puede abrir la aplicaci\u00f3n
artifactCounter=%s/%s artefactos seleccionados para ser desplegados
pagesAndLayouts=P\u00e1ginas y Layouts
abort=Abortar
deployAborted=La operaci\u00f3n de despliegue ha sido abortada. No todos los artefactos seleccionados han sido desplegados. No se deshace ning\u00fan despliegue. Puede que quiera desplegar de nuevo.
saveOpenedEditorsTitle=Guardar antes de desplegar
saveOpenedEditors=Algunos artefactos han sido modificados. \u00bfQuieres guardarlos antes de su despliegue?
savingEditors=Guardando editores...
deploySuccessButNoAppToOpenMsg=Todos los artefactos se han desplegado con \u00e9xito, pero el usuario por defecto actual (%s) no puede acceder a ninguna aplicaci\u00f3n.
deploying=Desplegando %s...
deployStatusWithUnresolvedProcessesMessage=Algunos procesos no pueden estar habilitados usando la configuraci\u00f3n actual. Por favor, configure esos procesos o seleccione otro entorno (s\u00f3lo Enterprise).
validateHint=La validaci\u00f3n del proyecto puede tardar tiempo; puede que quiera desplegar m\u00e1s r\u00e1pido sin validar esta vez.
applicationAsDisplayName=%s como %s
allArtifactSelected=Todos los artefactos seleccionados para el despliegue
noArtifactSelected=Ning\u00fan artefacto seleccionado para ser desplegado
incompatibleModelFoundTitle=Modelos incompatibles encontrados
incompatibleModelFoundMsg=Se han encontrado modelos incompatibles en el proyecto. No es posible desplegar modelos incompatibles y no aparecer\u00e1n como elementos desplegables en el siguiente di\u00e1logo. Algunos otros modelos se migrar\u00e1n a la versi\u00f3n compatible actual.