NewProcessButtonLabel=Nuevo
OpenProcessButtonLabel=Abrir
SaveProcessButtonLabel=Guardar
PrintProcessButtonLabel=Imprimir
CopyButtonLabel=Copiar
PasteButtonLabel=Pegar
HelpButtonLabel=Ayuda
WelcomeButtonLabel=Bienvenido
openProcessWizardPage_title=Abrir un proceso existente
unableTofindLogMessage=Imposible ubicar el archivo de registro en su sistema de archivos. Puede que no halla sido creado aun.
unableTofindLogTitle=Error al abrir
PreferencesButtonLabel=Preferencias
badWorkspaceVersionTitle=Conflicto de versiones del espacio de trabajo
badWorkspaceVersionMessage=Su \u00e1rea de trabajo actual\: {0} tiene una versi\u00f3n diferente ({1}) que {2} {3}. Otro usuario puede haber migrado este espacio de trabajo a una versi\u00f3n m\u00e1s reciente. Usted ya no est\u00e1 permitido el uso de este espacio de trabajo con esta versi\u00f3n de {4}. Se abrir\u00e1 el espacio de trabajo predeterminado.
resfreshConnectors=actualizando conectores...
aboutText={3} Edition\nVersion \: {0}\nVersion id \: {1}\nBuild id \: {2}\nCopyright \u00a9 {4} S.A., 2009-{5}\nAll rights reserved. 
maximizeCoolbarTooltip=Maximizar
reduceCoolbarTooltip=Minimizar
initializingCurrentRepository=Inicializando proyecto actual ...
shuttingDown=Detenci\u00f3n del motor ...
jreNotFoundTitle=No JRE detectado
jreNotFoundMessage=No se encontr\u00f3 un JRE. Quiere abrir la p\u00e1gina de preferencias de Java?
invalidWorkspaceTitle=Workspace Invalido
invalidWorkspace={0} no es un espacio de trabajo v\u00e1lido. La aplicaci\u00f3n se inicializar\u00e1 sin importar ning\u00fan espacio de trabajo.
failedToOpenLogTitle=Abrir el log ha fallado
failedToOpenLogMessage=Archivo de registro es demasiado grande para ser abierto con {1}. Por favor, utilice el editor de texto externo de su elecci\u00f3n y abra el siguiente archivo\:{0}
doNotDisplayForOtherDiagrams=No mostrar para otros diagramas nuevos
noProcessAvailable=Ning\u00fan diagrama abierto recientemente
offlineRepositoryTitle=Proyecto offline 
offlineRepositoryMessage=El proyecto {0} est\u00e1 actualmente offline. No ser\u00e1s capaz de actualizar/confirmar cambios en modo offline.
incompatibleJavaVersionTitle=Versi\u00f3n Java incompatible
incompatibleJavaVersionMessage=Est\u00e1s ejecutando %s usando una versi\u00f3n de Java incompatible (%s).\n Las versiones soportadas son\: %s.
exitWarningMessage=Salir {0} ?  \n\nCerrar el Studio eliminar\u00e1 el trabajo no guardado en el {1} y en el {2}. Aseg\u00farese de haber salvado cualquier elemento abierto en el {2} y exportar sus recursos personalizados del {1}.  \n\nNota\: En <A>Preferencias > Base de Datos</A>, usted puede desmarcar la opci\u00f3n "Limpiar base de datos al salir" para mantener el contenido de su base de datos.
NewButtonLabel=Nuevo
NewButtonTooltip=Crear un nuevo recurso en el proyecto
organization=Organizaci\u00f3n
businessDataModel=Modelo de Datos de Negocio
bdmAccessControl=Control de acceso BDM
profile=Perfil
applicationDescriptor=Descriptor de la aplicaci\u00f3n
applicationPage=P\u00e1gina de la aplicaci\u00f3n
layout=Layout
customWidget=Widget personalizado
fragment=Fragmento
restAPIExtension=Extensi\u00f3n API REST...
connectorDef=Definici\u00f3n de Conector...
connectorImpl=Implementaci\u00f3n del conector...
actorFilterDef=Definici\u00f3n de filtro de actor...
actorFilterImpl=Implementaci\u00f3n del filtro de actor...
newGroovy=Groovy...
theme=Tema...
importDragDropInfoTitle=Importar Drag & Drop
importDragDropInfo=Puedes importar un archivo Bos al desplegarlo en el explorador de proyecto Bonita.\nOtros archivos son ignorados.
creatingArchive=Creando archivo %s...
buildError=Se ha producido un error al construir %s
deployErrorTitle=Error al desplegar
buildErrorHelp=El proyecto no ha sido desplegado.\nCompruebe el artefacto involucrado para posibles errores y vuelva a intentarlo.\nPara m\u00e1s informaci\u00f3n, revise el log del Studio (en el men\u00fa `Ayuda`).
validationErrorTitle=Error de validaci\u00f3n
validationError=Se han detectado los siguientes errores en tu proyecto.\nEl proyecto no puede ser desplegado hasta que se corrijan estos errores.\nComprueba los posibles errores en los archivos involucrados e int\u00e9ntalo de nuevo.
bdmGenerationError=Se ha producido un error al generar el archivo Java del Modelo de Datos de Negocio.
selectArtifactToDeployTitle=Seleccionar artefactos a desplegar
selectArtifactToDeploy=Seleccione los artefactos, compruebe las opciones y despliegue (en el runtime del Studio).
deploy=Desplegar
selectAll=Seleccionar Todo
selectNone=Seleccionar nada
searchArtifact=Buscar artefactos
expandAll=Expandir todo
collapseAll=Colapsar todo
buildErrorTitle=Error de construcci\u00f3n
build=Construir
deployStatus=Estado del despliegue
deployStatusMessage=Estado del despliegue a continuaci\u00f3n\:
cleanBDMDatabase=Limpiar la base de datos del BDM antes de desplegar
deployOptions=Opciones de despligue
DeployButtonLabel=Desplegar
environment=Configuraci\u00f3n de entorno del proceso
environmentTootltip=Los valores de par\u00e1metros, los mapas de actores, las dependencias (jar) de terceros, los scripts Groovy, las implementaciones de filtros de actor y conectores seleccionadas en la configuraci\u00f3n ser\u00e1n incorporados en los archivos bar de procesos.
processes=Procesos
selectLatestVersion=Seleccione s\u00f3lo las \u00faltimas versiones de procesos
cannotResolveProcess=%s (%s) no se puede resolver\: %s
cannotEnableProcess=%s (%s) ha sido desplegado pero no puede ser activado.
appDescriptorUnknownAppPage=Descriptor de la aplicaci\u00f3n '%s'\: No se ha encontrado la p\u00e1gina de aplicaci\u00f3n '%s'.
appDescriptorUnknownPageToken=Descriptor de la aplicaci\u00f3n '%s'\: No existe el token de p\u00e1gina de aplicaci\u00f3n '%s'.
appDescriptorUnknownLayoutPage=Descriptor de la aplicaci\u00f3n '%s'\: No se ha encontrado el layout de aplicaci\u00f3n '%s'.
appDescriptorUnknownTheme=Descriptor de la aplicaci\u00f3n '%s'\: No se ha encontrado el tema de aplicaci\u00f3n '%s'.
deploySuccessMsg=Todos los artefactos se han desplegado con \u00e9xito.
validateProcess=Validar antes de desplegar
youCanOpenApp=Puede abrir la aplicaci\u00f3n
artifactCounter=%s/%s artefactos seleccionados para ser desplegados
pagesAndLayouts=P\u00e1ginas y Layouts
abort=Abortar
deployAborted=La operaci\u00f3n de despliegue ha sido abortada. No todos los artefactos seleccionados han sido desplegados. No se deshace ning\u00fan despliegue. Puede que quiera desplegar de nuevo.
saveOpenedEditorsTitle=Guardar antes de desplegar
saveOpenedEditors=Algunos artefactos han sido modificados. \u00bfQuieres guardarlos antes de su despliegue?
savingEditors=Guardando editores...
deploySuccessButNoAppToOpenMsg=Todos los artefactos se han desplegado con \u00e9xito, pero el usuario por defecto actual (%s) no puede acceder a ninguna aplicaci\u00f3n.
deploying=Desplegando %s...
deployStatusWithUnresolvedProcessesMessage=Algunos procesos no pueden estar habilitados usando la configuraci\u00f3n actual. Por favor, configure esos procesos o seleccione otro entorno (s\u00f3lo Enterprise).
validateHint=La validaci\u00f3n del proyecto puede tardar tiempo; puede que quiera desplegar m\u00e1s r\u00e1pido sin validar esta vez.
applicationAsDisplayName=%s como %s
allArtifactSelected=Todos los artefactos seleccionados para el despliegue
noArtifactSelected=Ning\u00fan artefacto seleccionado para ser desplegado
incompatibleModelFoundTitle=Modelos incompatibles encontrados
incompatibleModelFoundMsg=Se han encontrado modelos incompatibles en el proyecto. No es posible desplegar modelos incompatibles y no aparecer\u00e1n como elementos desplegables en el siguiente di\u00e1logo. Algunos otros modelos se migrar\u00e1n a la versi\u00f3n compatible actual.
deployArtifacts=Desplegar...
extendProjectTitle=Extender proyecto
extendProjectDescription=Ampl\u00eda tu proyecto Bonita con extensiones oficiales de Bonita. Los conectores se utilizan para conectar su proyecto Bonita con sistemas y los filtros de actores se utilizan para filtrar usuarios en tareas humanas.
addToProject=A\u00f1ade al proyecto
removeFromProject=Eliminar del proyecto
find=Buscar
type=Tipo
all=Todos
extensionSelectedForAdd=Extensi\u00f3n seleccionada para ser a\u00f1adida al terminar.
addDependenciesError=Se ha producido un error al a\u00f1adir una nueva dependencia Maven.
noResultFound=Ning\u00fan resultado encontrado
version=Versi\u00f3n 
install=Instalar
fetchingExtensions=Conectando al Bonita Marketplace...
installingExtensions=Instalando extensiones...
filteringExtensions=Filtrando extensiones...
incompatibleExtension=Actualizar a una versi\u00f3n m\u00e1s reciente para usar esta extensi\u00f3n.
incompatibleExtensionTitle=Incompatible con la versi\u00f3n actual de Studio
newVersionAvailable=Nueva versi\u00f3n disponible
dependencyUpdatable=Su proyecto ya depende de esta extensi\u00f3n en una versi\u00f3n anterior. Seleccione esta para actualizarla a la \u00faltima versi\u00f3n.
projectOverview=Resumen de proyecto
openMarketplace=Marketplace
openMarketplaceTooltip=Ampl\u00eda tu proyecto instalando extensiones disponibles en Bonita Marketplace.
projectOverviewTitle=Vista global
bonitaMarketplace=Bonita Marketplace
removeExtensionTooltip=Eliminar extensi\u00f3n del proyecto
details=Detalles
removeExtensionConfirmationTitle=Eliminar extensi\u00f3n
removeExtensionConfirmation=\u00bfEliminar la extensi\u00f3n '%s' del proyecto?
extensionLoadingErrorTitle=Error de carga de extensiones
extensionLoadingError=Se ha producido un error al cargar las extensiones. Comprueba el log para m\u00e1s detalles.
importExtensionTitle=A\u00f1adir %s
importExtension=A\u00f1adir una extensi\u00f3n como una dependencia de Maven o un archivo.
importExtensionButtonLabel=A\u00f1adir expresi\u00f3n
unknownExtensionsTitle=Otras extensiones
deleteUnknownTooltip=Eliminar las extensiones seleccionadas del proyecto.
delete=Suprimir
importRemoteDependencyTip=A\u00f1ada un %s especificando manualmente las coordenadas de la dependencia de Maven. Se recomienda un acceso a Internet a Maven central. Puede <a>configurar repositorios remotos adicionales</a> si es necesario.
dependencyNotFoundWhenImporting=Error al resolver %s contra los repositorios remotos configurados.
dependencyCoordinate=Coordenadas de dependencias
manual=Desde un repositorio
fromFile=Desde archivo
browse=Examinar...
file=Seleccione un archivo para importar (archivos %s solamente)
importFromFileTip=A\u00f1adir un %s desde un archivo local. Si el archivo seleccionado no existe en ninguno de los repositorios remotos configurados, la dependencia se instalar\u00e1 en el repositorio local.
resolvedDependency=Dependencia resuelta desde %s
cannotResolveDependencyInstalledLocally=No se ha resuelto la dependencia. Se instalar\u00e1 en el repositorio local.
editProjectMetadata=Editar informaci\u00f3n del proyecto
editProjectMetadataDescription=Editar la informaci\u00f3n actual del proyecto (nombre, descripci\u00f3n, versi\u00f3n, coordenadas maven).
name=Nombre
description=Descripci\u00f3n
updatingProjectMetadata=Actualizando metadatos del proyecto...
addDatabaseDriverTitle=A\u00f1adir un driver de base de datos
addDatabaseDriverDesc=Instalar un driver de base de datos JDBC para usar con el conector de base de datos. Si necesita utilizar un driver de base de datos no sugerido a continuaci\u00f3n, puede importarlo manualmente.
addDatabaseDriverQuestion=Acabas de instalar el conector de base de datos. Necesitar\u00e1s un driver JDBC de base de datos para ejecutar este conector. \u00bfQuieres instalar un driver de base de datos de nuestra lista sugerida? Puedes hacerlo m\u00e1s tarde si lo quieres o instalarlo manualmente.
databaseDriver=Driver de base de datos
engineRestartWarning=El servidor web se reiniciar\u00e1
enhanceProject=\u00a1Mejora tu proyecto con nuevas capacidades a\u00f1adiendo extensiones desde el Bonita Marketplace o importando tus propias extensiones\! 
upgradeBonitaExtensionTooltip=Una nueva versi\u00f3n de esta extensi\u00f3n est\u00e1 disponible en el Bonita Marketplace.
upgradeBonitaExtension=Actualizar a la \u00faltima versi\u00f3n
removeExtension=Suprimir
updateExtensionConfirmationTitle=Confirmaci\u00f3n de actualizaci\u00f3n de extensi\u00f3n
updateExtensionConfirmation=\u00bfActualizar la extensi\u00f3n '%s' de %s a %s?
newProjectWizardTitle=Nuevo proyecto
newProjectWizardDescription=Crear un nuevo proyecto con la siguiente informaci\u00f3n
create=Crear
dependencyAlreadyExistsInSameVersion=El proyecto ya utiliza esta extensi\u00f3n en la versi\u00f3n '%s'.
dependencyAlreadyExistsInDifferentVersion=El proyecto ya utiliza esta extensi\u00f3n en la versi\u00f3n '%s'. Actualiza el campo de versi\u00f3n para usar otra versi\u00f3n de esta extensi\u00f3n. 
upgradeExtension=Actualizar
upgradeExtensionTooltip=Actualizar la versi\u00f3n de esta extensi\u00f3n
addExtensionPageTitle=A\u00f1adir extensiones
addExtensionPageDescription=Puedes seleccionar algunas extensiones para usar en tu nuevo proyecto
extensions=Extensiones
modify=Modificar
repositories=Repositorios
repositoriesDescription=Configurar los repositorios maven utilizados para recuperar las extensiones de Bonita. La autenticaci\u00f3n se gestiona en la secci\u00f3n de servidores.
servers=Servidores
proxies=Proxies
mirrors=R\u00e9plicas
id=ID
url=Url
releases=Releases
snapshots=Snapshots
enabled=Activado
updatePolicy=Pol\u00edtica de Actualizaci\u00f3n
checksumPolicy=Pol\u00edtica de checksum
add=A\u00f1adir
addRepositoryTooltip=A\u00f1ade un nuevo repositorio accesible a tu configuraci\u00f3n maven.
deleteRepositoryTooltip=Eliminar este repositorio de su configuraci\u00f3n en maven. Ya no podr\u00e1 recuperar las extensiones de este repositorio. 
mavenProfile=Perfil Maven
mavenProfileHint=La configuraci\u00f3n del repositorio Maven est\u00e1 definida en los perfiles.\nRecomendamos el uso del perfil de Bonita para configurar los repositorios utilizados por su proyecto Bonita.
encryptionMasterPassword=Contrase\u00f1a maestra (encriptada)
updateMasterPasswordWarning=La contrase\u00f1a maestra se utiliza para cifrar las contrase\u00f1as de su servidor.\nSi actualiza la contrase\u00f1a maestra existente, todas las contrase\u00f1as deben ser generadas de nuevo.
encryptionLink=<a>El cifrado de contrase\u00f1a</a> es opcional pero se recomienda si su archivo de configuraci\u00f3n en maven (settings.xml) es compartido.
addServerTooltip=A\u00f1ade un nuevo servidor a tu configuraci\u00f3n de maven.
deleteServerTooltip=Elimina este servidor de tu configuraci\u00f3n de maven.
serversLink=<a>Servidores</a> se utilizan para administrar los repositorios y la autenticaci\u00f3n de replicas.
removeServerConfirmationTitle=Eliminar confirmaci\u00f3n del servidor
removeServerConfirmation=\u00bfEliminar el servidor '%s' de su configuraci\u00f3n de maven?
removeRepositoryConfirmationTitle=Confirmaci\u00f3n de eliminaci\u00f3n del repositorio
removeRepositoryConfirmation=\u00bfEliminar el repositorio '%s' de su configuraci\u00f3n de maven?
serverId=ID
serverIdHint=Este es el ID del servidor (no del usuario para iniciar sesi\u00f3n).\nDebe coincidir con el elemento id del repositorio/r\u00e9plica al que Maven intenta conectar.
userPasswordAuthentication=Nombre de usuario / contrase\u00f1a
sshAuthentication=SSH
username=Nombre de usuario
password=Contrase\u00f1a
authentication=Autenticaci\u00f3n
showPassword=Mostrar contrase\u00f1a
encryptPassword=Cifrar contrase\u00f1a
encryptButtonTooltip=Se requiere una contrase\u00f1a maestra para realizar el cifrado.
privateKey=Clave privada
passphrase=Passphrase
showPassphrase=Mostrar passphrase
clearPasswordTooltip=El campo contrase\u00f1a debe estar vac\u00edo para usar autenticaci\u00f3n ssh.
clearPassword=Borrar contrase\u00f1a
error=Error
proxiesLink=Configurar un servidor para trabajar detr\u00e1s de <a>proxies</a>. Solo un proxy puede estar activo a la vez.
addProxyTooltip=A\u00f1ade un nuevo proxy a tu configuraci\u00f3n de maven.
deleteProxyTooltip=Elimina este proxy de tu configuraci\u00f3n de maven.
removeProxyConfirmationTitle=Eliminar confirmaci\u00f3n del proxy
removeProxyConfirmation=\u00bfEliminar el proxy '%s' de su configuraci\u00f3n de maven?
active=Activo
protocol=Protocolo
host=Servidor
port=Puerto
intValueExpected=Entero esperado.
nonProxyHost=Sin servidor proxy
nonProxyHostsTootltip=Esta es una lista de servidores que no deben ser reemplazados.\nEl delimitador de la lista es el tipo esperado del servidor proxy.\nLos delimitadores de barra vertical o comas son comunes.
mirrorsLink=Configure <a>r\u00e9plicas</a> para sus repositorios.
addMirrorTooltip=A\u00f1ade una nueva r\u00e9plica a tu configuraci\u00f3n de maven.
deleteMirrorTooltip=Elimina esta r\u00e9plica de tu configuraci\u00f3n de maven.
removeMirrorConfirmationTitle=Eliminar confirmaci\u00f3n de replica
removeMirrorConfirmation=\u00bfEliminar la r\u00e9plica '%s' de tu configuraci\u00f3n de maven?
mirrorOf=Replica de
mirrorUrlTooltip=La URL base de esta r\u00e9plica.\nEl sistema de construcci\u00f3n utilizar\u00e1 esta URL para conectarse a un repositorio en lugar de la URL original del repositorio.
mirrorOfTooltip=El id del repositorio del que es una r\u00e9plica.\nEsto no debe coincidir con el id de r\u00e9plica.
activate=Activar
activateProxyTooltip=Establecer el proxy seleccionado como activo
restoreDefaultConfirmationTitle=Restaurar confirmaci\u00f3n por defecto
restoreDefaultConfirmation=\u00bfBorrar todos los cambios en la configuraci\u00f3n de maven?
updatingConfiguration=Actualizando configuraciones...
preparingDefinitionUpdate=Preparando actualizaci\u00f3n de definici\u00f3n...
updatePreview=Preview actualizaci\u00f3n de definici\u00f3n...
updateProcessesTitle=Preview actualizaci\u00f3n de procesos...
otherDependencyUpdateMessage=Una extensi\u00f3n ha sido actualizada o eliminada y las configuraciones de proceso requieren ser actualizadas en consecuencia. Puedes\:\n
updateActionsMessage=\u2022 Abortar\: la extensi\u00f3n ser\u00e1 revertida a su estado anterior\n  \u2022 Ignorar los cambios. Los procesos no se cambiar\u00e1n y la actualizaci\u00f3n manual es requerida\n  \u2022 Proceder con la actualizaci\u00f3n de procesos
definitionUpateMessage=Las definiciones de conector/filtro de actor han sido actualizadas o eliminadas y su configuraci\u00f3n requiere ser actualizada en consecuencia. Puede\:\n
abortingUpdate=Abortando actualizaci\u00f3n...
definitionUpdateWithBreakingChanges=Algunas configuraciones no se pueden actualizar autom\u00e1ticamente debido a cambios severos. Tendr\u00e1s que actualizarlas manualmente m\u00e1s tarde.
definitionRemovedDescription=%s (%s) la definici\u00f3n ha sido eliminada. %s configuraci\u00f3n(es) ser\u00e1n eliminadas.
preparingProcessConfigurationUpdate=Preparando la actualizaci\u00f3n de configuraci\u00f3n del proceso...
jarFileRemovedChangeDescription=%s ser\u00e1 eliminado
jarFileUpdatedChangeDescription=%s (%s \u2192 %s)
configurationToUpdateFound=%s configuraci\u00f3n(es) de proceso a actualizar encontradas.
jarFileAddedChangeDescription=%s se a\u00f1adir\u00e1 de forma transitoria.
back=Atr\u00e1s
connectors=Conectores
connectorsHint=Resumen de los conectores tra\u00eddos por la extensi\u00f3n %s .\nUn conector est\u00e1 hecho de una definici\u00f3n e implementaci\u00f3n. Se pueden proporcionar varias implementaciones para una definici\u00f3n determinada.
implementations=Implementaci\u00f3n(es)\:
preparingUpdate=Preparando actualizaci\u00f3n de la extensi\u00f3n...
computingPreview=Calculando vista previa...
applyingChanges=Aplicando cambios...
actorFilters=Filtros de actor
actorFiltersHint=Resumen de los filtros de actor tra\u00eddos por la extensi\u00f3n %s .\nUn filtro actor est\u00e1 hecho de una definici\u00f3n y una implementaci\u00f3n. Se pueden proporcionar varias implementaciones para una definici\u00f3n determinada.
restApiExtensions=Extensiones API REST
restApiDetailsHint=Resumen de la API REST tra\u00edda por la extensi\u00f3n %s .\nUna API REST est\u00e1 definida por un m\u00e9todo HTTP, una plantilla de ruta y uno o varios permisos.\nUn permiso es un mapeo de la organizaci\u00f3n que concede acceso a la API.
httpMethodMissing=Falta el m\u00e9todo HTTP.
pathMissing=Falta la ruta.
permissionsMissing=Faltan permisos.
permissions=Permisos\:
path=Ruta\:
copyToClipboard=Copiar al portapapeles
editPermissionsMapping=Editar mapeo de permisos
usages=Usos
connectorUsages=Usos del conector %s.
findUsages=Buscar usos
findingUsages=Buscando usos...
diagramNotFound=Diagrama no encontrado
diagramNotFoundMessage=El diagrama de proceso %s no ha sido encontrado.
process=Proceso\:
connectorUsagesDescription=El siguiente \u00e1rbol muestra todos los usos del conector %s, es decir, todas las actividades de proceso que est\u00e1n usando este conector.
noConnectorUsagesFound=El conector %s no se utiliza en su proyecto Bonita.
search=Buscar
actorFilterUsagesDescription=El siguiente \u00e1rbol muestra todos los usos del filtro de actor %s, es decir, todas las actividades de proceso que est\u00e1n usando este filtro de actores.
addConnector=Conector...
addActorFilter=Filtro de actor...
addTheme=Tema...
addRestApiExtension=Extensi\u00f3n API REST...
addOther=Otros...
legacyArchiveFormatHint=El formato de archivo Zip no es compatible.
extension=extensi\u00f3n
extensionIsNotAConnector=Esta extensi\u00f3n no es un conector.
extensionIsNotAnActorFilter=Esta extensi\u00f3n no es un filtro de actor.
extensionIsNotARestApiExtension=Esta extensi\u00f3n no es una extensi\u00f3n API REST.
extensionIsNotAThemeExtension=Esta extensi\u00f3n no es un tema.
cannotAccessMarketplace=No se puede acceder a Bonita Marketplace
cannotLoadMarketplaceMessage=El Bonita Marketplace no se puede cargar. Puede estar relacionado con un problema de conectividad a Internet.
cannotUpdateMarketplaceMessage=El Bonita Marketplace no se puede actualizar. Puede estar relacionado con un problema de conectividad a Internet.
localDependencyTooltip=Dependencia local - Esta dependencia ha sido importada manualmente, y se almacena en el almac\u00e9n de dependencias locales en el sistema de archivos.
remoteDependencyTooltip=Dependencia externa - Esta dependencia se recupera a trav\u00e9s de Maven desde un repositorio remoto.
marketplaceDependencyTooltip=Dependencia de Bonita - Esta dependencia es proporcionada por el Bonita Marketplace, y es recuperada a trav\u00e9s de Maven desde el repositorio central.
editMavenCoordinates=Editar coordenadas de maven
editMavenCoordinatesTooltip=Puede editar las coordenadas de maven (groupId, artifactId, versi\u00f3n y clasificador) de las dependencias locales no compiladas con Maven.
mavenPropertiesMissing=La informaci\u00f3n sobre las propiedades Maven falta en el JAR importado, aseg\u00farese de compilar este JAR con maven. El JAR legacy no se puede importar.
extensionView=Extensiones
extensionViewTooltip=Abre la vista de extensi\u00f3n del proyecto, para obtener un resumen de las extensiones de tu proyecto y actualizarlas.
overviewView=Vista General
overviewViewTooltip=Abre la vista global del proyecto para ver los artefactos que componen tu proyecto.
repositoryIdMandatory=El ID del repositorio es obligatorio.
repositoryNameMandatory=El repositorio '%s' no tiene un nombre, este campo es obligatorio.
repositoryUrlMandatory=El repositorio '%s' no tiene una URL, este campo es obligatorio.
invalidMavenConfigurationTitle=Configuraci\u00f3n de maven inv\u00e1lida
invalidMavenConfiguration=El archivo de configuraci\u00f3n de maven (%s) contiene errores.
proxyIdMandatory=El ID del proxy es obligatorio.
proxyHostMandatory=El proxy '%s' no tiene un servidor, este campo es obligatorio.
mirrorIdMandatory=El ID de la replica es obligatorio.
mirrorUrlMandatory=La r\u00e9plica '%s' no tiene una URL, este campo es obligatorio.
mavenConfigurationUpdatedTitle=Configuraci\u00f3n de Maven actualizada
mavenConfigurationUpdated=El archivo de configuraci\u00f3n de maven (%s) ha sido actualizado.
projectDoesntContainsElement=Este proyecto a\u00fan no contiene ning\u00fan %s.
newElementTitle=Crear nuevo %s
noDescription=No se proporcion\u00f3 descripci\u00f3n
diagramZoomHint=Resumen de todos los diagramas en el proyecto actual.
cannotReachMavenCentralRepositoryTitle=No se puede acceder al repositorio central de Maven
cannotReachMavenCentralRepositoryMessage=Studio no llega a conectarse al repositorio de Maven Central. Es altamente recomendable configurar un acceso a Maven central para beneficiarse de las extensiones proporcionadas por Bonita.\nCompruebe por favor\:\n\u2022 Su conexi\u00f3n a Internet\n\u2022 Su configuraci\u00f3n de proxy\n\u2022 Su conexi\u00f3n VPN si una r\u00e9plica est\u00e1 configurada\n\u2022 <a>Estado central Maven</a>
validateExistingMavenConfigurationMessage=Parece que ya tiene una configuraci\u00f3n de Maven existente (%s). Aseg\u00farese de que esta configuraci\u00f3n es v\u00e1lida.
configure=Configurar
retry=Reintentar