generatedJavaRepository=Meus Tipos Java Gerados
name=Nome
packageName=Pacote (package)
error=Erro
error_emptyName=Deve ter um nome
type=Tipo
Remove=Remover
selectBusinessObjectWizardTitle=Selecione um objeto de neg\u00f3cio
selectBusinessObjectWizardMessage=Selecione um objeto de neg\u00f3cio existente para editar.
businessObjectRepositoryStoreName=Modelo de dados de neg\u00f3cio
errorMessageSameDataTypeNames=Um outro tipo de dados com o mesmo nome j\u00e1 existe.
errorMessageNoWhitespaceInDataTypeNames=Espa\u00e7os n\u00e3o s\u00e3o permitidos em um nome de objeto de neg\u00f3cio.
noBusinessObjectSelected=Selecione um objeto de neg\u00f3cio.
addBusinessObjectDataTitle=Adicionar uma nova vari\u00e1vel de neg\u00f3cio para {0}
addBusinessObjectDataDescription=Cria uma nova refer\u00eancia para um objeto de neg\u00f3cio definido em Desenvolvimento > menu Modelo de Dados de Neg\u00f3cio
description=Descri\u00e7\u00e3o
businessObject=Objeto de neg\u00f3cio
dataWithSameNameAlreadyExists=Um dado com o mesmo nome j\u00e1 existe
editBusinessObjectDataWindowTitle=Editar vari\u00e1vel de neg\u00f3cio
editBusinessObjectDataTitle=Editar vari\u00e1vel de neg\u00f3cio
editBusinessObjectDataDescription=Editar uma vari\u00e1vel de neg\u00f3cio existente
createNewBusinessObject=<A>Criar um novo objeto de neg\u00f3cio...</A>
businessObjectNotFound=O objeto de neg\u00f3cio {0} n\u00e3o foi encontrado
errorWhileDeployingBDM=Ocorreu um erro ao implantar o Modelo de Dados de Neg\u00f3cio
publish=Publicar
publishBusinessObjectTitle=Publicar Objeto de Neg\u00f3cio
publishBusinessObjectDescription=Publica o Objeto de Neg\u00f3cio selecionado no motor
businessObjectPublishedMessage=Objeto de Neg\u00f3cio publicado com sucesso.
businessObjectPublishedTitle=Objeto de Neg\u00f3cio publicado
export=Exportar
exportBusinessDataModelTitle=Exportar Modelo de Dado de Neg\u00f3cio
exportBusinessDataModelDescription= Exporta um Modelo de Dados de Neg\u00f3cio a ser implantado em {0}. O nome do arquivo gerado ser\u00e1 "bdm.zip"
exportBusinessDataModelSuccessFull=O Modelo de Dados de Neg\u00f3cio foi exportado com sucesso para {0}
exportingBusinessDataModel=Exportando o Modelo de Dados de Neg\u00f3cio...
destinationPath=Caminho de destino
invalidDestinationPath=O caminho destino n\u00e3o \u00e9 uma pasta v\u00e1lida
browse=Procurar...
deployingBusinessObjects=Implantando o Modelo de Dados de Neg\u00f3cio...
add=Adicionar
delete=Excluir
listOfBusinessObjects=Lista de Objetos de Neg\u00f3cio
selectABusinessObjectToEdit=Selecione um Objeto de Neg\u00f3cio para editar
up=Acima
down=Baixar
length=Tamanho
mandatory=Obrigat\u00f3rio
fieldNameAlreadyExists=O nome do atributo j\u00e1 existe
constraintNameAlreadyExists=O nome da restri\u00e7\u00e3o j\u00e1 existe
deleteBOConfirmTitle=Excluir o Objeto de Neg\u00f3cio?
deleteBOConfirmMessage=Excluir o objeto de neg\u00f3cio `%s`?
attribute=atributo
error_emptyPackageName=Nome do pacote est\u00e1 vazio
modelValidationFailedTitle=Relat\u00f3rio de valida\u00e7\u00e3o
validatingBDM=Validando...
atLeastOneAttributeShouldExists={0} deve ter pelo menos um atributo.
manageBusinessDataModelTitle=Implantando o Modelo de Dados de Neg\u00f3cio
manageBusinessDataModelDesc=Adicione objetos de neg\u00f3cio \u00e0 lista e edite seus detalhes nas guias do lado direito.
reservedKeyWord={0} \u00e9 uma palavra-chave reservada
saving=Salvando...
constraints=Restri\u00e7\u00f5es \u00fanicas
businessDataModel=Modelo de Dados de Neg\u00f3cio
selectUniqueConstraintFieldsMessage=Selecione a combina\u00e7\u00e3o de atributos para os quais ser\u00e1 aplicada a restri\u00e7\u00e3o de unidade.
warningTextConstraint=Voc\u00ea n\u00e3o pode usar seus atributos com o tipo TEXT para definir a restri\u00e7\u00e3o \u00fanica.\nAlterne para o tipo de STRING se voc\u00ea precisar.
selectUniqueConstraintFieldsTitle=Selecione os atributos
attributes=Atributos
atLeastOneAttributeShouldBelongToConstraint=Pelo menos um atributo deve ser definido para restri\u00e7\u00e3o de unicidade {0}
attributeInConstraintNotExists=O atributo {0} na restri\u00e7\u00e3o de unicidade {1} n\u00e3o existe
atLeastOneAttributeShouldBelongToIndex=Pelo menos um atributo deve ser definido para o \u00edndice {0}
attributeInIndexNotExists=O atributo {0} no \u00edndice {1} n\u00e3o existe
atLeastOneBusinessObjectShouldExists=Pelo menos um objeto de neg\u00f3cio deve ser definido
invalidSQLIdentifier={0} n\u00e3o \u00e9 um identificador SQL v\u00e1lido
queries=Consultas
queryNameAlreadyExists=O nome da consulta j\u00e1 existe
query=Consulta
parameters=Par\u00e2metros
parameter=par\u00e2metro
queryParameterNameAlreadyExists=O par\u00e2metro {0} j\u00e1 existe
newQuery=Criar consulta em {0}
newQueryDescription=Digite a consulta usando JPQL. Voc\u00ea pode usar ou descartar o exemplo fornecido.\nEm seguida, adapte a lista padr\u00e3o de par\u00e2metros. Se necess\u00e1rio, modifique o tipo de resultado.
editQuery=Editar {0} em {1}
editQueryDescription=Edite a consulta usando JPQL. Em seguida, adapte a lista de par\u00e2metros.\nSe necess\u00e1rio, modifique o tipo de resultado.
parameterNotUsedInQueryWarning={0} \u00e9 definido na lista de par\u00e2metros, mas nunca \u00e9 usado em consulta
undefinedParameter={0} n\u00e3o est\u00e1 definido na lista de par\u00e2metros
exportCompleted=Exporta\u00e7\u00e3o conclu\u00edda
queryResultType=Tipo de resultado
multipleReturnType=M\u00faltiplo (java.util.List)
multiple=M\u00faltiplo
single=\u00danico ({0})
numeric=Num\u00e9rico (java.util.Long)
queryLink=Consulta JPQL * <a>?</a>
jpqlParametersHint=Definir par\u00e2metros usados na consulta acima
emptyQueryError=Consulta JPQL n\u00e3o pode estar vazia
queryNameReserved={0} \u00e9 um nome de consulta reservado (consulta gerada nas consultas padr\u00e3o)
queryExpressionLabel=Consultas
queryContent=Conte\u00fado da consulta
value=Valor
returnType=Tipo de retorno
dropBusinessDataDBOnExit=Limpar banco de dados de neg\u00f3cios na sa\u00edda
dropBusinessDataDBOnBDMChanges=Limpar banco de dados de neg\u00f3cios quando o Modelo de Neg\u00f3cios for alterado
queryExpressionGuidance=Selecione o objeto de neg\u00f3cio e a consulta a ser executada. Defina o valor para cada par\u00e2metro exigido pela consulta.
bdmCompatibilityTitle=Aviso\: Impacto das altera\u00e7\u00f5es
bdmCompatibilityMsg=Este BDM est\u00e1 dispon\u00edvel para todos os processos no seu Studio e para p\u00e1ginas de aplica\u00e7\u00f5es e formul\u00e1rios de processo usando chamadas REST API. Alterar o BDM pode causar inconsist\u00eancias.\nAp\u00f3s a atualiza\u00e7\u00e3o do BDM, validar cada diagrama e verificar suas p\u00e1ginas e formul\u00e1rios.\n\nSe voc\u00ea tiver alterado a configura\u00e7\u00e3o Obrigat\u00f3ria ou M\u00faltipla para um atributo, uma restri\u00e7\u00e3o \u00fanica, ou se voc\u00ea tiver alterado um tipo de atributo n\u00e3o primitivo, voc\u00ea deve limpar a estrutura de banco de dados e a estrutura do BDM.
clearExistingBusinessData=Limpar banco de dados BDM antes de ser instalado
businessObjectNameAlreadyExists=Um objeto de neg\u00f3cio j\u00e1 existe com o mesmo nome
installFailedTitle=Falha na implanta\u00e7\u00e3o
installFailedMessage=Ocorreu um erro ao implantar o Modelo de Dados de Neg\u00f3cio no motor
defaultQueriesOption=Padr\u00e3o
customQueriesOption=Personalizado
defaultQueriesHint=Existem 4 tipos padr\u00e3o de consulta para selecionar Objetos de Neg\u00f3cio\: consulta baseada em restri\u00e7\u00f5es de unicidade, que retorna um \u00fanico resultado, consulta baseada em atributos simples (com crit\u00e9rio "igual") que retorna v\u00e1rios resultados e consulta do tipo "Selecionar todos" que retorna todos os Dados de Neg\u00f3cio do objeto.
providedQuery=Consulta fornecidas
providedQueryDescription=Exibe o conte\u00fado dessa consulta padr\u00e3o
queryParameterNameReservedForPagination={0} \u00e9 uma palavra reservada para pagina\u00e7\u00e3o
orderByMissingWarning=Voc\u00ea definiu uma consulta que retorna uma lista de objetos de neg\u00f3cio. \u00c9 altamente recomendado usar uma cl\u00e1usula ORDER BY ao retornar uma lista.
paginationParameterHint=Dois par\u00e2metros de pagina\u00e7\u00e3o s\u00e3o oferecidos, para ser usado atrav\u00e9s das APIs. startIndex aponta para o primeiro elemento que deve ser retornado no resultado,  enquanto maxResults determina a quantidade m\u00e1xima de itens a ser retornada. \nNota\: Nos formul\u00e1rios apenas uma p\u00e1gina de elementos ser\u00e1 exibida.
newQueryTitle=Criar consulta
editQueryTitle=Editar consulta
howToUseBusinessObjects=Como usar Objetos de Neg\u00f3cio
howToUseBusinessObjectsContent=Para usar dados de neg\u00f3cios em um processo, \u00e9 necess\u00e1rio definir uma vari\u00e1vel de neg\u00f3cio no n\u00edvel do pool. \nPara ler os dados de neg\u00f3cios em um processo, tamb\u00e9m \u00e9 poss\u00edvel utilizar a DAO do objeto de neg\u00f3cio em um script Groovy ou utilizar uma express\u00e3o de consulta. \n\nPara usar dados de neg\u00f3cios em um formul\u00e1rio ou p\u00e1gina de aplica\u00e7\u00e3o, use a API REST na propriedade de valor da widget.
multipleBusinessData=\u00c9 m\u00faltiplo
composition=Composi\u00e7\u00e3o
aggregation=Agrega\u00e7\u00e3o
relation=Relacionamento
indexes=\u00cdndices
indexNameAlreadyExists=Um \u00edndice com o mesmo nome j\u00e1 existe
indexedAttributes=Atributos indexados
availableAttributes=Atributos dispon\u00edveis
selectIndexFieldsTitle=Selecionar atributos para {0}
selectIndexFieldsMessages=Selecione os atributos para indexar usando Arrastar e Soltar.\nO desempenho desse filtro de consulta \u00e9 significativamente melhorado, dependendo dos atributos e da ordem escolhida.
warningTextIndex=Voc\u00ea n\u00e3o pode indexar um atributo com o tipo TEXT. Alterne para o tipo de STRING se voc\u00ea precisar.
businessObjectDAO=DAO de Objeto de Neg\u00f3cio
mandatoryColumnTooltip=Se voc\u00ea verificar M\u00faltiplos e Mandat\u00f3rio, pelo menos um valor \u00e9 obrigat\u00f3rio.
stringLengthTooltip=Use o STRING se voc\u00ea precisa de uma restri\u00e7\u00e3o e/ou indexes \u00fanicos. Seu comprimento m\u00e1ximo depende do seu banco de dados.\nPara mais strings, escolha o tipo TEXT. Equivalente do banco de dados\: varchar
lengthCannotBeEmpty=O tamanho deve ser um inteiro positivo v\u00e1lido
noDetailsAvailable=N\u00e3o h\u00e1 detalhes dispon\u00edveis
details=Detalhes
detailsFor=Detalhes para {0}
realtionTooltip=- Agrcri\u00e7\u00e3o significa "\u00e9 referenciado por"\: o objeto relacionado tem seu pr\u00f3prio ciclo de vida;\nN\u00e3o pode ser criado na mesma transa\u00e7\u00e3o que cria seu pai.\n- Composi\u00e7\u00e3o significa "faz parte de"\: o objeto relacionado pode ser modificado\nquando o objeto pai \u00e9 salvo no banco de dados.\n\ufe0f Um determinado objeto pode ser usado na composi\u00e7\u00e3o por um e apenas um outro objeto. 
errorMessageNoUnderscoreInBoNames='_' n\u00e3o \u00e9 permitido no nome de um Objeto de Neg\u00f3cio.
loadOnDemand=Carregar apenas objetos relacionados quando necess\u00e1rio
loadOnDemandHint=Esta op\u00e7\u00e3o \u00e9 recomendada para objetos que s\u00e3o frequentemente exibidos ou modificados com o Objeto de Neg\u00f3cio pai
alwaysLoad=Sempre carregar objetos relacionados
alwaysLoadHint=Esta op\u00e7\u00e3o \u00e9 recomendada para objetos que s\u00e3o frequentemente exibidos ou modificados com o Objeto de Neg\u00f3cio pai
createBusinessDataVariable=Criar um Dado de neg\u00f3cio...
error_reservedPackagePrefix={0} \u00e9 um prefixo de pacote reservado.
warning_reservedPackagePrefix={0} \u00e9 um prefixo de pacote desaconselhado.
disabledMandatoryTooltip=Um atributo m\u00faltiplo n\u00e3o pode ser obrigat\u00f3rio.
defaultValue=Valor padr\u00e3o
defaultValueReturnTypeValidationMessage=A express\u00e3o de valor padr\u00e3o retorna {0}, mas {1} \u00e9 esperado
addBusinessObjectDataWindowTitle=Nova vari\u00e1vel de neg\u00f3cio
defaultValueBusinessDataTooltip=Dados de neg\u00f3cio podem ser inicializados com Objetos de Neg\u00f3cio existentes usando uma consulta ou criando uma nova usando um Script Groovy e a vari\u00e1vel fornecida dao (XXXDAO. ewInstance()).
cleaningBusinessObjects=Limpando Modelo de dados de neg\u00f3cio...
countQueryInfo=Para obter resultados paginados de uma consulta REST API sobre este objeto comercial, voc\u00ea deve criar uma consulta de contagem relacionada. Para uma consulta chamada "queryName", crie uma consulta chamada "countForQueryName" que conta o n\u00famero total de resultados.
missingCountQuery=Voc\u00ea pode definir uma consulta de contagem %s para habilitar resultados paginados desta consulta REST API.
queryReturnTypeWarning=Apenas os tipos de retorno abaixo s\u00e3o suportados.\nAtualmente n\u00e3o \u00e9 poss\u00edvel usar v\u00e1rias express\u00f5es SELECT como 'SELECT e.name,e.id FROM...'.
modelValidationFailedMsg=A valida\u00e7\u00e3o do modelo de dados de neg\u00f3cio falhou com os seguintes problemas. Corrija esses problemas para ser capaz de salvar seu modelo.
bdmDeployedTitle=Modelo de Dados de Neg\u00f3cio implantado
bdmDeployedMessage=O Modelo de Dados de Neg\u00f3cio foi implantado com sucesso.\nAs sess\u00f5es abertas foram encerradas (portal, aplica\u00e7\u00f5es...). Voc\u00ea precisa entrar novamente.
doNotShowMeAgain=N\u00e3o mostrar esta mensagem novamente.
bdmDeployDetails=Passos de implanta\u00e7\u00e3o de modelo de dados de neg\u00f3cio\:\n\u0009<unk> Pare servi\u00e7os BPM (\u2192 fecha todas as sess\u00f5es abertas)\n\u0009<unk> Gerar entidades Java e DAO a partir do modelo\n\u0009<unk> Criar/Atualizar esquema de banco de dados\n\u0009<unk> Reiniciar os servi\u00e7os BPM
textDetails=Use TEXT se o tamanho da string poss\u00edvel exceder o tamanho m\u00e1ximo de STRING em seu banco de dados (por exemplo, para \u00e1reas de texto).\nCuidado com isso evitar\u00e1 restri\u00e7\u00f5es ou \u00edndices exclusivos.\nBanco de dados equivalente\: Clob.
lengthIsNotAPositiveNumber=O tamanho deve ser um inteiro positivo
lengthIsNotANumber=O comprimento deve ser um n\u00famero inteiro
dateDetails=DATE armazena uma data e um tempo na base de dados usando uma LONG (n\u00famero de milissegundos decorridos desde 01/01/1970 00\:00\: (UTC)) e usa java.util.Date como tipo Java.
legacyDateTooltip=Opera\u00e7\u00f5es complexas no Designer de UI, Groovy scripts e REST API criou algumas inconsist\u00eancias com o tipo DATE. \nPor conseguinte, o DATE permanece na lista para suportar os desenvolvimentos anteriores, mas para novos desenvolvimentos, use os tipos DATE ONLY, DATE-TIME (NO TIME ZONE), ou DATE-TIME (TIME ZONE) para lidar com data ou data/hora dependendo do seu caso de uso.
dateOnlyDetails=%s \u00e9 usado para manter uma data sem hora. Use-a para datas de nascimento, por exemplo. Ele \u00e9 armazenado no banco de dados como uma String, usando ISO-8601 "aaaa-mm-dd". Usa um java.time.LocalDate como tipo Java.
dateTimeDetails=%s \u00e9 usado para manter uma data-hora que exibe o mesmo que o fuso hor\u00e1rio do usu\u00e1rio (NO Time Zone). Use-o para hora de abertura de lojas, por exemplo.\nEle \u00e9 armazenado no banco de dados como uma String usando ISO 8601 "aaaa-mm-ddThh\:mm\:ss\:sss". Usa java.LocalDateTime como tipo Java.
dateTimeInTimezoneDetails=%s \u00e9 usado para manter uma data-hora que exibe o mesmo que o fuso hor\u00e1rio do usu\u00e1rio (Time Zone). Use-o para hora de abertura de lojas, por exemplo.\nEle \u00e9 armazenado no banco de dados como uma String usando ISO 8601 "aaaa-mm-ddThh\:mm\:ss\:sss". Usa java.LocalDateTime como tipo Java.
fieldNameShouldStartsWithLowercase=O nome do atributo deve come\u00e7ar com um caso menor, caso contr\u00e1rio pode levar a alguns erros.
generatingJarFromBDMModel=Gerando jar do Modelo de Dados de Neg\u00f3cio...
deployBDMJobName=Implantar o Modelo de Dados de neg\u00f3cio
continueDeploy=Continuar
duplicateConstraintOrIndexName=Existem pelo menos dois %s com o mesmo nome \: %s
emptyBdm=Modelo de objeto de neg\u00f3cio deve ter pelo menos um objeto de neg\u00f3cio declarado
duplicateQueryName=A consulta '%s' j\u00e1 existe para o objeto de neg\u00f3cio '%s'
businessObjectWithoutName=Um Objeto de Neg\u00f3cio deve ter um nome qualificado
reservedPackageName=O pacote %s est\u00e1 reservado. Por favor, escolha outro nome de pacote
invalidJavaIdentifier=%s n\u00e3o \u00e9 um nome qualificado v\u00e1lido para Java
invalidCharacterInBusinessObjectName=%s \u00e9 um caractere proibido no nome do objeto de neg\u00f3cio
businessObjectWithoutField=O objeto de neg\u00f3cio '%s' deve ter pelo menos um atributo declarado
duplicateConstraintName=A consulta '%s' j\u00e1 existe para o objeto de neg\u00f3cio '%s'
unknownFieldInConstraint=O atributo '%s' n\u00e3o existe no objeto de neg\u00f3cio '%s'
invalidFieldIdentifier='%s' n\u00e3o \u00e9 um identificador de atributo v\u00e1lido
indexWithoutName=Um \u00edndice deve ter nome
invalidSqlIdentifier='%s n\u00e3o \u00e9 um identificador SQL v\u00e1lido
indexWithoutField=O \u00edndice '%s' deve ter pelo menos um atributo declarado
queryParameterWithoutName=Um par\u00e2metro de consulta deve ter nome
forbiddenQueryParameterName=%s \u00e9 um nome de par\u00e2metro reservado. Use um nome diferente de\: %s
queryParameterWithoutClassName=%s par\u00e2metro de consulta deve ter um nome de classe
queryWithoutName=Uma consulta deve ter nome
queryNameLengthToHigh='%s' comprimento deve ser inferior a 150 caracteres
queryWithoutContent=A consulta '%s' deve ter um conte\u00fado definido
queryWithoutReturntype=A consulta '%s' deve ter um tipo de retorno definido
fieldWithoutName=O atributo '%s' deve ter um tipo declarado
constraintWithoutName=Uma restri\u00e7\u00e3o \u00fanica deve ter nome
constraintWithoutField=A restri\u00e7\u00e3o \u00fanica '%s' deve ter pelo menos um atributo declarado
boUsedInCompositionAndAggregation=O objeto '%s' \u00e9 referenciado tanto na composi\u00e7\u00e3o como na agrega\u00e7\u00e3o. Isso pode levar a erros de execu\u00e7\u00e3o e pode levar a um comportamento imprevis\u00edvel da configura\u00e7\u00e3o do AccessControl
circularCompositionReference=O objeto de neg\u00f3cio '%s' tem uma refer\u00eancia de composi\u00e7\u00e3o circular para si mesmo ou \u00e9 referenciado v\u00e1rias vezes no objeto '%s'
severalCompositionReferenceForABusinessObject=O objeto de neg\u00f3cio '%s' \u00e9 referenciado pela composi\u00e7\u00e3o em dois objetos de neg\u00f3cio, ou \u00e9 referenciado v\u00e1rias vezes em um \u00fanico objeto de neg\u00f3cio
multipleAggregationToItself=O objeto '%s' est\u00e1 referenciando-se em uma rela\u00e7\u00e3o de m\u00faltiplos agregamentos
importButtonLabel=Importar
importBdm=Importar Modelo de Dados de Neg\u00f3cio
importBdmDesc=Importar um novo Modelo de Dados de Neg\u00f3cio.
bdmImportedTitle=Modelo de Dados de Neg\u00f3cio importado
bdmImported=Modelo de Dados de Neg\u00f3cio foi importado com sucesso.
bdmWillBeOverwritten=Um Modelo de Dados de Neg\u00f3cio j\u00e1 est\u00e1 definido.
bdmZipInvalid=O arquivo %s \u00e9 inv\u00e1lido, n\u00e3o cont\u00e9m um Modelo de Dados de Neg\u00f3cio.
cleanDeployTitle=Limpar implanta\u00e7\u00e3o
cleanDeployMsg=Isto eliminar\u00e1 a tabela de dados BDM, todos os dados existentes no BDM ser\u00e3o perdidos.\nContinuar?
businessDataModelDeployed=Modelo de Dados de Neg\u00f3cio foi implantado.
addBusinessObject=Add Object
addPackage=Add package
deletePackageConfirmTitle=Excluir pacote
deletePackageConfirm=Excluir o pacote `%s` e todos os seus Objetos de Neg\u00f3cio ?
mergePackageConfirmTitle=Mesclar pacotes
mergePackageConfirm=Mesclar os pacotes `%s` e `%s`?
search=Search
updatePackage=Alterar pacote
updatePackageTitle=Alterar pacote %s
updatePackageMessage=Atualizar o pacote objeto de neg\u00f3cio %s'.
archiveContentInvalid=Imposs\u00edvel analisar o conte\u00fado do arquivo em um Modelo de Dados de Neg\u00f3cio.
businessObjectNameDuplicated=Um objeto de neg\u00f3cio `%s` j\u00e1 existe no modelo atual, com um conte\u00fado diferente.
importAction=Importar a\u00e7\u00e3o
importBdmDescription=Importar um Modelo de Dados de Neg\u00f3cio. Se um BDM j\u00e1 est\u00e1 definido, voc\u00ea pode importar o novo para o modelo atual. 
errorOnImport=Ocorreu um erro ao importar o Modelo de Dados de Neg\u00f3cio.
importingBdm=Importando Modelo de Dados de Neg\u00f3cio...
importDetails=Detalhes da importa\u00e7\u00e3o
smartImportDesc=O novo Modelo de Dados de Neg\u00f3cio ser\u00e1 importado para o atual.
smartImportConflict=Alguns pacotes s\u00e3o conflitantes\: Objetos de neg\u00f3cio t\u00eam o mesmo nome, mas conte\u00fado diferente.
selectPackageToKeep=Para cada pacote conflitante, voc\u00ea pode manter o existente ou substitu\u00ed-lo com o novo.
ImportError=Ocorreu um erro ao importar o Modelo de Dados de Neg\u00f3cio.
smartImportImpossible=Alguns objetos de neg\u00f3cio est\u00e3o conflitando entre diferentes pacotes (mesmo nome).
overwriteImportDesc=O Modelo de Dados de Neg\u00f3cio ser\u00e1 substitu\u00eddo pelo modelo importado.
businessDataModelPreview=Visualizar
conflictingSinglePackage=Este pacote j\u00e1 existe no modelo atual, com um conte\u00fado diferente.\nVoc\u00ea pode manter a vers\u00e3o existente deste pacote ou substitu\u00ed-lo com o novo. 
conflictingMultiPackage=O conte\u00fado deste pacote est\u00e1 conflitando com o conte\u00fado de um outro pacote no modelo existente.
businessObjectInSeveralPackages=O objeto de neg\u00f3cio `%s` j\u00e1 existe no modelo atual, m\u00e1s em outro pacote.
newBdmImport=O novo Modelo de Dados de Neg\u00f3cio ser\u00e1 importado.
skipped=J\u00e1 existe
globalSkipped=O conte\u00fado deste Modelo de Dados de Neg\u00f3cio j\u00e1 existe em seu modelo atual. A importa\u00e7\u00e3o n\u00e3o teria nenhum efeito.
nothingToImport=Nada a importar.
previewDesc=Pr\u00e9-visualiza\u00e7\u00e3o do Modelo de Dados de Neg\u00f3cio ap\u00f3s a importa\u00e7\u00e3o.
importActionName=Importar
businessObjectAlreadyPresent=O objeto de neg\u00f3cio%s` j\u00e1 est\u00e1 presente no modelo atual.
packageAlreadyPresent=Todos os Objetos de Neg\u00f3cio no pacote%s` j\u00e1 est\u00e3o presentes no modelo atual.
importBusinessObjectTooltip=O objeto de neg\u00f3cio%s` ser\u00e1 importado.
importPackageTooltip=Todos os objetos de neg\u00f3cio do pacote%s` ser\u00e3o importados.
mavenArtifactProperties=Propriedades de artefatos Maven
groupId=Id do Grupo
version=Vers\u00e3o
mavenArtifactPropertiesHint=Dois artefatos Maven s\u00e3o gerados a partir da defini\u00e7\u00e3o BDM\: bdm-cliente e bdm-dao.\nVoc\u00ea pode alterar o id do grupo desses artefatos. A vers\u00e3o \u00e9 for\u00e7ada a 1.0.0.
groupIdCannotContainsSpace=Id do grupo n\u00e3o pode conter espa\u00e7os.
objectAlreadyExistsInAnotherPackage=%s (J\u00e1 existe no pacote %s)
conflictingWithSameObject=%s (J\u00e1 existe com um conte\u00fado diferente)
changePackageTip=Dica\: Voc\u00ea tamb\u00e9m pode arrastar e soltar um Objeto de Neg\u00f3cio de um pacote para outro.
bdmDocumentationLink=Para obter mais informa\u00e7\u00f5es sobre nomes de pacotes e gerenciamento de modelo de dados, verifique a <a>documenta\u00e7\u00e3o</a>.
edition=Edi\u00e7\u00e3o
attributeNameRequired=O nome do atributo \u00e9 obrigat\u00f3rio
boNameRequired=Nome do objeto de neg\u00f3cio \u00e9 obrigat\u00f3rio
emptyFieldList=O objeto de neg\u00f3cio '%s' deve ter pelo menos um atributo.
cyclicComposition=O objeto de neg\u00f3cio '%s' cont\u00e9m uma composi\u00e7\u00e3o c\u00edclica.
unknownBusinessObjectReference=O atributo '%s' faz refer\u00eancia a um objeto de neg\u00f3cio que n\u00e3o existe na defini\u00e7\u00e3o atual do modelo de dados de neg\u00f3cio.
constraintNameRequired=Nome de restri\u00e7\u00e3o \u00fanico \u00e9 necess\u00e1rio
constraintReferencesUnknownAttributes=Os seguintes atributos referenciados na restri\u00e7\u00e3o de unicidade '%s' s\u00e3o desconhecidos\: %s
fieldsDuplicated=Alguns atributos na restri\u00e7\u00e3o '%s' s\u00e3o duplicados
defaultConstraintName=restri\u00e7\u00e3o \u00fanica
parametersLabel=Par\u00e2metros usados na consulta acima
queryNameRequired=O nome da consulta \u00e9 obrigat\u00f3rio
queryParameterNameRequired=O nome do par\u00e2metro de consulta \u00e9 necess\u00e1rio
modelNotSavableTitle=Modelo de objeto de neg\u00f3cio n\u00e3o \u00e9 v\u00e1lido
modelNotSavable=Seu modelo de dados de neg\u00f3cio \u00e9 inv\u00e1lido.\nCorrija os erros para conseguir salvar.
emptyModelNotSavable=Seu modelo de dados de neg\u00f3cio \u00e9 inv\u00e1lido, ele deve conter pelo menos um objeto de neg\u00f3cio para ser salvo.
cantUseTextTypeInConstraint=O campo '%s' tem o tipo TEXT, n\u00e3o pode ser usado em uma restri\u00e7\u00e3o \u00fanica.
cantUseMultipleTypeInConstraint=O campo '%s' \u00e9 m\u00faltiplo, ele n\u00e3o pode ser usado em uma restri\u00e7\u00e3o \u00fanica
cantHaveNullReferenceInConstraint=O campo '%s' tem refer\u00eancia nula, n\u00e3o pode ser usado em uma restri\u00e7\u00e3o \u00fanica
cantUseTextTypeInIndex=O campo '%s' tem o tipo TEXT, ele n\u00e3o pode ser usado em um \u00edndice
cantUseMultipleTypeInIndex=O campo '%s' \u00e9 m\u00faltiplo, ele n\u00e3o pode ser usado em um \u00edndice
cantHaveNullReferenceInIndex=O campo '%s' tem refer\u00eancia nula, n\u00e3o pode ser usado em um \u00edndice
indexReferencesUnknownAttributes=Os seguintes atributos referenciados no \u00edndice '%s' s\u00e3o desconhecidos\: %s
constraintFieldEmptiness=A restri\u00e7\u00e3o de unicidade '%s' deve ser aplicada a pelo menos um atributo
indexFieldEmptiness=O \u00edndice '%s' deve ser aplicado a pelo menos um atributo
deploy=Implantar
constraintsSectionTitle=Restri\u00e7\u00f5es \u00fanicas para `%s`
querySectionTitle=Consultas para `%s`
indexSectionTitle=\u00cdndices para `%s`
unknownBusinessObject=O objeto de neg\u00f3cio %s n\u00e3o existe.
modelPageName=Modelo
constraintsPageName=Restri\u00e7\u00f5es \u00fanicas
createPackageTooltip=Criar um novo pacote
createBoTooltip=Criar um novo objeto de neg\u00f3cio no pacote selecionado
deleteTooltip=Apagar sele\u00e7\u00e3o
expandAll=Expand
collapseAll=Collapse
addFieldTooltip=Adicione um novo atributo
deleteFieldTooltip=Remover o atributo selecionado
addConstraintTooltip=Adicionar uma nova restri\u00e7\u00e3o \u00fanica
deleteConstraintTooltip=Remover a restri\u00e7\u00e3o de unicidade selecionada
addQueryTooltip=Adicionar uma nova consulta personalizada
deleteQueryTooltip=Remover a consulta personalizada selecionada
addParameterTooltip=Adicionar um novo par\u00e2metro de consulta \u00e0 consulta personalizada selecionada
deleteParameterTooltip=Remover o par\u00e2metro de consulta selecionado
addIndexTooltip=Adicionar um novo \u00edndice
deleteIndexTooltip=Remover o \u00edndice selecionado
dndIndexTooltip=Atributos podem ser indexados / desindexados usando Arrastar e Soltar.\nAtributos indexados tamb\u00e9m podem ser classificados usando Arrastar e Soltar.
pakage=Pacote (package)
fieldDescriptionPlaceholder=Descri\u00e7\u00e3o do atributo
saveBeforeImportTitle=Salvar antes de importar
saveBeforeImportMessage=Salvar o Modelo de Dados de Neg\u00f3cio antes de realizar a importa\u00e7\u00e3o?
deleteFieldConfirmTitle=Excluir o atributo selecionado
deleteFieldConfirmMessage=Excluir o atributo `%s`?
deleteConstraintConfirmTitle=Excluir restri\u00e7\u00e3o de unicidade selecionada
deleteConstraintConfirmMessage=Excluir a restri\u00e7\u00e3o \u00fanica `%s`?
deleteIndexConfirmTitle=Excluir \u00edndice selecionado
deleteIndexConfirmMessage=Excluir o \u00edndice `%s`?
deleteQueryConfirmTitle=Excluir consulta personalizada selecionada
deleteQueryConfirmMessage=Excluir a consulta personalizada `%s`?
deleteQueryParamsConfirmTitle=Excluir par\u00e2metros de consulta selecionados
deleteQueryParamsConfirmMessage=Excluir os par\u00e2metros de consulta selecionados?
validate=Validar
validateTooltip=Obter um status de valida\u00e7\u00e3o global no atual Modelo de Dados de Neg\u00f3cio
validationStatus=Status da valida\u00e7\u00e3o
validatioNStatusDesc=O Modelo de Dados de Neg\u00f3cio atual tem os seguintes problemas.\nCorrija esses problemas para ser capaz de salvar e implantar seu BDM.
bdmValidMessage=O Modelo de Dados de Neg\u00f3cio \u00e9 v\u00e1lido.
bdmDeployRequiredTitle=Implementa\u00e7\u00e3o do BDM necess\u00e1ria
bdmDeployRequired=O Modelo de Dados de Neg\u00f3cio foi modificado. Voc\u00ea deve implant\u00e1-lo para ter em conta essas altera\u00e7\u00f5es.\n\nGerenciar notifica\u00e7\u00f5es BDM nas <a>prefer\u00eancias</a>.
explore=Explorar
exploreTooltip=Explore o esquema BDM com uma ferramenta graphQL Voyager. BDM deve ter sido implantado\!
bdmVoyager=Modelo de dados de neg\u00f3cio
deployCancelTitle=Cancelar implanta\u00e7\u00e3o
deployCancel=N\u00e3o foi poss\u00edvel salvar o modelo, a opera\u00e7\u00e3o de deploy foi cancelada.
invalidGroupId=Id do grupo inv\u00e1lido\: {0}
bdmDeployMarker=Implanta\u00e7\u00e3o necess\u00e1ria
discouragedUsageOfKnownReservedKeyword=`{0}` usage is discouraged as it is a known reserved identifier for some Database vendor.
deployBdmHint=Deploy the current version of the BDM in the Engine.\nbdm-client and bdm-dao jar are generated.\nThe bdm-client maven dependency in the project is updated according to the group id.
groupIdCannotBeEdited=The groupid cannot be edited because the model is in error.\nFix the errors to be able to edit the groupId.
bdmDashboardContribution=The Business Data Model is the definition of the business data that is shared by processes and process-based applications in a tenant.
