generatedJavaRepository=Mes Types Java G\u00e9n\u00e9r\u00e9s
name=Nom
packageName=Package
error=Erreur
error_emptyName=Le nom ne peut pas \u00eatre vide
type=Type
Remove=Supprimer
selectBusinessObjectWizardTitle=S\u00e9lectionnez un objet m\u00e9tier
selectBusinessObjectWizardMessage=S\u00e9lectionnez un objet m\u00e9tier existant pour le modifier.
businessObjectRepositoryStoreName=Mod\u00e8le de Donn\u00e9es M\u00e9tier
errorMessageSameDataTypeNames=Un autre type de donn\u00e9e portant le m\u00eame nom existe d\u00e9j\u00e0.
errorMessageNoWhitespaceInDataTypeNames=Le nom d'un objet m\u00e9tier ne doit pas contenir d'espace.
noBusinessObjectSelected=S\u00e9lectionnez un objet m\u00e9tier.
addBusinessObjectDataTitle=Ajouter une nouvelle variable m\u00e9tier \u00e0 {0}
addBusinessObjectDataDescription=Cr\u00e9er une nouvelle r\u00e9f\u00e9rence \u00e0 un Objet M\u00e9tier (d\u00e9fini dans le menu D\u00e9veloppement > Mod\u00e8le de Donn\u00e9es M\u00e9tier)
description=Description
businessObject=Objet M\u00e9tier
dataWithSameNameAlreadyExists=Une donn\u00e9e portant le m\u00eame nom existe d\u00e9j\u00e0
editBusinessObjectDataWindowTitle=Modifier une variable m\u00e9tier
editBusinessObjectDataTitle=Modifier une variable m\u00e9tier
editBusinessObjectDataDescription=Modifier une variable m\u00e9tier existante
createNewBusinessObject=<A>Cr\u00e9ez un nouvel objet m\u00e9tier...</A>
businessObjectNotFound=L''objet m\u00e9tier {0} est introuvable
errorWhileDeployingBDR=Une erreur s'est produite \u00e0 la publication du Mod\u00e8le de Donn\u00e9es M\u00e9tier
publish=Publier
publishBusinessObjectTitle=Publier un Objet M\u00e9tier
publishBusinessObjectDescription=Publier les objets m\u00e9tier s\u00e9lectionn\u00e9s dans le moteur
businessObjectPublishedMessage=L'Objet M\u00e9tier a \u00e9t\u00e9 publi\u00e9 avec succ\u00e8s.
businessObjectPublishedTitle=L'objet m\u00e9tier a \u00e9t\u00e9 publi\u00e9
export=Exporter
exportBusinessDataModelTitle=Exporter un Mod\u00e8le de Donn\u00e9es M\u00e9tier
exportBusinessDataModelDescription=Exporter un Mod\u00e8le de Donn\u00e9es M\u00e9tier \u00e0 d\u00e9ployer dans le {0}. Le nom de l''archive g\u00e9n\u00e9r\u00e9e sera \u00ab bdm.zip \u00bb
exportBusinessDataModelSuccessFull=Le Mod\u00e8le de Donn\u00e9es M\u00e9tier a \u00e9t\u00e9 export\u00e9 avec succ\u00e8s vers {0}
exportingBusinessDataModel=Export du Mod\u00e8le de Donn\u00e9es M\u00e9tier...
destinationPath=Chemin de destination
invalidDestinationPath=Le chemin de destination n'est pas un dossier valide
browse=Parcourir...
deployingBusinessObjects=D\u00e9ploiement du Mod\u00e8le de Donn\u00e9es M\u00e9tier...
add=Ajouter
delete=Supprimer
listOfBusinessObjects=Liste d'objets m\u00e9tier
selectABusinessObjectToEdit=S\u00e9lectionnez un objet m\u00e9tier pour l'\u00e9diter
up=Monter
down=Descendre
length=Longueur
mandatory=Obligatoire
fieldNameAlreadyExists=Ce nom d'attribut existe d\u00e9j\u00e0
constraintNameAlreadyExists=Ce nom de contrainte existe d\u00e9j\u00e0
deleteBOConfirmTitle=Souhaitez-vous supprimer cet objet m\u00e9tier ?
deleteBOConfirmMessage=\u00cates-vous s\u00fbr(e) de vouloir supprimer l''objet m\u00e9tier \u00ab {0} \u00bb ?
attribute=attribut
error_emptyPackageName=Le nom du package est vide
modelValidationFailedTitle=Rapport de validation
validatingBDM=Validation...
atLeastOneAttributeShouldExists={0} doit \u00eatre compos\u00e9 d''au moins un attribut.
manageBusinessDataModelTitle=D\u00e9finir le Mod\u00e8le de Donn\u00e9es M\u00e9tier
manageBusinessDataModelDesc=Ajoutez les objets m\u00e9tier \u00e0 la liste puis renseignez leurs d\u00e9tails dans les onglets de droite.
reservedKeyWord={0} est un mot-cl\u00e9 r\u00e9serv\u00e9
saving=Enregistrement en cours...
constraints=Contraintes
businessDataModel=Mod\u00e8le de Donn\u00e9es M\u00e9tier
selectUniqueConstraintFieldsMessage=S\u00e9lectionnez la combinaison d'attributs \u00e0 laquelle s'appliquera la contrainte d'unicit\u00e9.
warningTextConstraint=Vous ne pouvez pas utiliser des attributs de type TEXT pour d\u00e9finir une contrainte d'unicit\u00e9. Choisissez le type STRING si besoin.
selectUniqueConstraintFieldsTitle=S\u00e9lectionnez les attributs
attributes=Attributs
atLeastOneAttributeShouldBelongToConstraint=S\u00e9lectionnez au moins un attribut sur lequel appliquer la contrainte d''unicit\u00e9 {0}
attributeInConstraintNotExists=L''attribut {0} r\u00e9f\u00e9renc\u00e9 par la contrainte d''unicit\u00e9 {1} n''existe pas
atLeastOneAttributeShouldBelongToIndex=L''index {0} doit comporter au moins un attribut
attributeInIndexNotExists=L''attribut {0} r\u00e9f\u00e9renc\u00e9 dans l''index {1} n''existe pas
atLeastOneBusinessObjectShouldExists=Vous devez d\u00e9finir au moins un objet m\u00e9tier
invalidSQLIdentifier={0} n''est pas un identifiant SQL valide
queries=Requ\u00eates
queryNameAlreadyExists=Ce nom de requ\u00eate existe d\u00e9j\u00e0
query=Requ\u00eate \u00e0 ex\u00e9cuter
parameters=Param\u00e8tres
parameter=Param
queryParameterNameAlreadyExists=Le param\u00e8tre {0} existe d\u00e9j\u00e0
newQuery=Cr\u00e9er une query pour {0}
newQueryDescription=Saisissez la requ\u00eate en JPQL. Vous pouvez partir de l'exemple ci-dessous, ou le remplacer enti\u00e8rement. Par d\u00e9faut, tous les attributs de l'objet sont propos\u00e9s en tant que param\u00e8tre. Rectifiez ces param\u00e8tres et le type de retour si besoin.
editQuery=Modifier une requ\u00eate
editQueryDescription=Cette requ\u00eate doit \u00eatre r\u00e9dig\u00e9e en language JPQL.
parameterNotUsedInQueryWarning={0} appara\u00eet dans la liste des param\u00e8tres mais n''est pas utilis\u00e9 dans la requ\u00eate
undefinedParameter={0} n''est pas d\u00e9fini dans la liste des param\u00e8tres
exportCompleted=L'export est termin\u00e9
queryResultType=Type de r\u00e9sultat
multipleReturnType=Multiple (java.util.List)
multiple=Multiple
single=Simple ({0})
numeric=Num\u00e9rique (java.util.Long)
queryLink=Requ\u00eate JPQL * <a>?</a>
jpqlParametersHint=D\u00e9finissez les param\u00e8tres utilis\u00e9s dans la requ\u00eate ci-dessus
emptyQueryError=La requ\u00eate JPQL doit \u00eatre renseign\u00e9e
queryNameReserved={0} est un nom de requ\u00eate r\u00e9serv\u00e9 (requ\u00eate g\u00e9n\u00e9r\u00e9e par d\u00e9faut)
queryExpressionLabel=Requ\u00eate \u00e0 ex\u00e9cuter
queryContent=Contenu de la requ\u00eate
value=Valeur
returnType=Type de retour
dropBusinessDataDBOnExit=Vider la base de donn\u00e9es des donn\u00e9es m\u00e9tier \u00e0 la fermeture
dropBusinessDataDBOnBDMChanges=Vider la base de donn\u00e9es des donn\u00e9es m\u00e9tier \u00e0 chaque changement du mod\u00e8le
queryExpressionGuidance=S\u00e9lectionnez l'objet m\u00e9tier et la requ\u00eate correspondante. Pr\u00e9cisez la valeur de chaque param\u00e8tre pour cette requ\u00eate.
bdmCompatibilityTitle=Avertissement \: Impact des modifications
bdmCompatibilityMsg=Ce BDM est accessible \u00e0 tous les processus du Studio ainsi qu'aux pages d'applications et aux formulaires de processus qui utilisent des appels \u00e0 l'API REST. Modifier le BDM peut provoquer des incoh\u00e9rences. \nApr\u00e8s la mise \u00e0 jour du BDM, validez chaque diagramme et v\u00e9rifiez vos pages et formulaires. \nSi vous avez modifi\u00e9 le caract\u00e8re obligatoire ou multiple d'un attribut, une contrainte d'unicit\u00e9, ou si vous avez modifi\u00e9 un attribut de type non primitif, vous devez r\u00e9initialiser la structure de la base de donn\u00e9es du BDM ainsi que ses donn\u00e9es.
clearExistingBusinessData=R\u00e9initialiser la base de donn\u00e9es du BDM
businessObjectNameAlreadyExists=Un objet m\u00e9tier portant le m\u00eame nom existe d\u00e9j\u00e0.
installFailedTitle=Echec du d\u00e9ploiement
installFailedMessage=Une erreur est survenue au d\u00e9ploiement du Mod\u00e8le de Donn\u00e9es M\u00e9tier dans le moteur
defaultQueriesOption=D\u00e9faut
customQueriesOption=Sp\u00e9cifiques
defaultQueriesHint=4 types de requ\u00eates par d\u00e9faut pour s\u00e9lectionner les objets m\u00e9tier \: bas\u00e9es sur les contraintes uniques, qui renvoie des r\u00e9sultats simples, bas\u00e9es sur des attributs simples (avec crit\u00e8re "\u00e9gal"), qui renvoient des r\u00e9sultats multiples et les r\u00e9sultats des requ\u00eates countFor associ\u00e9es, et un Select All, qui retourne toutes les donn\u00e9es m\u00e9tier sur l'objet m\u00e9tier.
providedQuery=Requ\u00eates par d\u00e9faut
providedQueryDescription=La d\u00e9finition de cette requ\u00eate par d\u00e9faut est affich\u00e9e ci-dessous
queryParameterNameReservedForPagination={0} est un mot r\u00e9serv\u00e9 
orderByMissingWarning=Vous avez d\u00e9fini une requ\u00eate qui retourne une liste d'Objets M\u00e9tier. Il est recommand\u00e9 d'utiliser une clause ORDER BY pour trier cette liste.
paginationParameterHint=Des param\u00e8tres de pagination peuvent \u00eatre utilis\u00e9s lors de l'appel \u00e0 la requ\u00eate. \nstartIndex point vers le premier \u00e9l\u00e9ment de la liste \u00e0 retourner, et maxResults le nombre maximum de r\u00e9sultats \u00e0 retourner. Note\: dans les formulaires, une seule page peut \u00eatre affich\u00e9e.
newQueryTitle=Cr\u00e9er une requ\u00eate 
editQueryTitle=Modifier une requ\u00eate
howToUseBusinessObjects=Comment utiliser les objets m\u00e9tier
howToUseBusinessObjectsContent=Pour utiliser des donn\u00e9es m\u00e9tier dans un processus, vous devez d\u00e9finir une variable m\u00e9tier au niveau du pool.\n\nPour lire les donn\u00e9es m\u00e9tier dans un processus, vous pouvez \u00e9galement utiliser le DAO de l'objet m\u00e9tier dans un script Groovy ou utiliser une expression d'une requ\u00eate. Pour utiliser des donn\u00e9es m\u00e9tier dans une page de formulaire ou une page d'application, utilisez l'API REST dans la propri\u00e9t\u00e9 "valeur" du widget.
multipleBusinessData=Est multiple
composition=Composition
aggregation=Agr\u00e9gation
relation=Relation
indexes=Index
indexNameAlreadyExists=Un index portant le m\u00eame nom existe d\u00e9j\u00e0
indexedAttributes=Attributs index\u00e9s
availableAttributes=Attributs disponibles
selectIndexFieldsTitle=S\u00e9lectionnez les attributs de {0}
selectIndexFieldsMessages=S\u00e9lectionnez les attributs composant cet index. Les performances des requ\u00eates seront li\u00e9es au choix et \u00e0 l'ordre des attributs s\u00e9lectionn\u00e9s.
warningTextIndex=Vous ne pouvez pas indexer un attribut de type TEXT. Choisissez le type STRING si besoin.
businessObjectDAO=DAO d'objet m\u00e9tier
mandatoryColumnTooltip=Si vous s\u00e9lectionnez Multiple et Obligatoire, l'attribut doit contenir au moins une valeur.
stringLengthTooltip=Utilisez STRING si vous avez besoin de contraintes d'unicit\u00e9 ou d'indexs. Sa longueur maximale d\u00e9pend de votre base de donn\u00e9es. Pour les cha\u00eenes plus longues, choisissez le type TEXT. Equivalent en base de donn\u00e9es \: varchar
lengthCannotBeEmpty=La Longueur doit \u00eatre un entier positif
noDetailsAvailable=Aucune information
details=D\u00e9tails
detailsFor=D\u00e9tails de {0} 
realtionTooltip=- Agr\u00e9gation signifie \u00ab est r\u00e9f\u00e9renc\u00e9 par \u00bb \: l'objet reli\u00e9 a son propre cycle de vie ; il ne peut pas \u00eatre modifi\u00e9 lorsque l'objet parent est enregistr\u00e9 en base de donn\u00e9es.\n - Composition signifie \u00ab appartient \u00e0 \u00bb \: l'objet peut \u00eatre modifi\u00e9 lorsque l'objet parent est enregistr\u00e9 en base de donn\u00e9es.
errorMessageNoUnderscoreInBoNames='_' n'est pas un caract\u00e8re autoris\u00e9 dans le nom d'un Objet M\u00e9tier.
loadOnDemand=Ne charger les objets li\u00e9s que lorsque c'est n\u00e9cessaire
loadOnDemandHint=Cette option est recommand\u00e9e pour les objets rarement affich\u00e9s ou modifi\u00e9s en m\u00eame temps que l'objet m\u00e9tier parent
alwaysLoad=Toujours charger les objets li\u00e9s
alwaysLoadHint=Cette option est recommand\u00e9e pour les objets souvent affich\u00e9s ou modifi\u00e9s en m\u00eame temps que l'objet m\u00e9tier parent
createBusinessDataVariable=Cr\u00e9er une donn\u00e9e m\u00e9tier...
error_reservedPackagePrefix={0} est un pr\u00e9fixe de package r\u00e9serv\u00e9.
warning_reservedPackagePrefix={0} n''est pas un pr\u00e9fixe de package conseill\u00e9.
disabledMandatoryTooltip=Un attribut multiple ne peut pas \u00eatre obligatoire.
defaultValue=Valeur par d\u00e9faut
defaultValueReturnTypeValidationMessage=L''expression de la valeur par d\u00e9faut retourne {0} au lieu de {1}
addBusinessObjectDataWindowTitle=Nouvelle variable m\u00e9tier
defaultValueBusinessDataTooltip=Les donn\u00e9es m\u00e9tier peuvent \u00eatre initialis\u00e9es soit \u00e0 l'aide d'une requ\u00eate sur des objets m\u00e9tier existants,\nsoit en cr\u00e9ant un nouvel objet \u00e0 l'aide d'un script Groovy et de la variable DAO fournie (XXXDAO.newInstance()).
cleaningBusinessObjects=Nettoyage du mod\u00e8le de donn\u00e9es m\u00e9tier en cours ...
countQueryInfo=Pour pouvoir paginer les r\u00e9sultats d'une requ\u00eate REST sur cet objet m\u00e9tier, vous devez cr\u00e9er une requ\u00eate count associ\u00e9e. Syntaxe \: pour une requ\u00eate "queryName" donn\u00e9e, cr\u00e9ez une requ\u00eate "countForQueryName" qui compte le nombre total des r\u00e9sultats.
missingCountQuery=Vous pouvez d\u00e9finir une requ\u00eate count {0} pour permettre la pagination des r\u00e9sultats de cette requ\u00eate REST.
queryReturnTypeWarning=Seuls les types de retour ci-dessous sont support\u00e9s. \nIl n\u2019est actuellement pas possible d\u2019utiliser plusieurs expressions SELECT comme 'SELECT e.name,e.id FROM...'.
modelValidationFailedMsg=La validation du mod\u00e8le de donn\u00e9es m\u00e9tier a \u00e9chou\u00e9 (liste des probl\u00e8mes ci-dessous). Corrigez ces probl\u00e8mes pour pouvoir enregistrer votre mod\u00e8le.
bdmDeployedTitle=Mod\u00e8le de donn\u00e9es m\u00e9tiers d\u00e9ploy\u00e9
bdmDeployedMessage=Le mod\u00e8le de donn\u00e9es m\u00e9tier a \u00e9t\u00e9 d\u00e9ploy\u00e9 avec succ\u00e8s. \n\u26a0 Les sessions ouvertes ont \u00e9t\u00e9 ferm\u00e9es (portail, applications...). Vous devrez vous reconnecter.
doNotShowMeAgain=Ne plus me montrer ce message.
bdmDeployDetails=\u00c9tapes de d\u00e9ploiement de mod\u00e8le de donn\u00e9es m\u00e9tier\:\n\u0009\u23f8 Pause des services BPM (\u2192 ferme toutes les sessions ouvertes)\n\u0009\u26a1 Generation des entit\u00e9s et DAO Java \u00e0 partir du mod\u00e8le\n\u0009\u26a1 Cr\u00e9ation/Mise \u00e0 jour du sch\u00e9ma de base de donn\u00e9e\n\u0009\u25b6 Reprise des services BPM
textDetails=Utilisez TEXT si la longueur de la cha\u00eene peut d\u00e9passer la longueur de cha\u00eene maximale dans votre base de donn\u00e9es (par exemple pour les zones de texte). Attention, cela rendra impossible la cr\u00e9ation de contraintes d'unicit\u00e9 ou d'index. \n\u00c9quivalent base de donn\u00e9es \: Clob.
lengthIsNotAPositiveNumber=La longueur doit \u00eatre un entier positif
lengthIsNotANumber=La longueur doit \u00eatre un nombre entier
dateDetails=DATE stocke une date et une heure dans la base de donn\u00e9es \u00e0 l\u2019aide d\u2019un LONG (nombre de millisecondes \u00e9coul\u00e9es depuis le 01/01/1970 00\:00\:00\u00a0\: (UTC)) et utilise le type Java java.util.Date.
legacyDateTooltip=Les op\u00e9rations complexes dans l'UI Designer, les scripts Groovy et les API REST cr\u00e9\u00e9nt quelques incoh\u00e9rences avec le type DATE. Donc, DATE reste dans la liste pour supporter les d\u00e9veloppements anciens, mais pour les nouveaux d\u00e9veloppements, utilisez les types DATE ONLY, DATE-TIME (NO TIME ZONE), ou DATE-TIME (TIME ZONE) pour g\u00e9rer date ou date/heure selon votre cas d\u2019utilisation.
dateOnlyDetails=%s sert \u00e0 repr\u00e9senter une date sans heure pr\u00e9cise, comme une date de naissance par exemple. Il est stock\u00e9 en base de donn\u00e9es en tant que String, \u00e0 l\u2019aide du format ISO-8601 \u00ab\u00a0yyyy-mm-dd\u00a0\u00bb. Il utilise le type Java java.time.LocalDate.
dateTimeDetails=%s sert \u00e0 repr\u00e9senter une date et une heure qui s'affichent de la m\u00eame fa\u00e7on quel que soit le fuseau horaire, ou "time zone" de l\u2019utilisateur (SANS TZ), comme un horaire d'ouverture de magasin par exemple. Il est stock\u00e9 en base de donn\u00e9es en tant que String \u00e0 l\u2019aide du format ISO 8601 \u00ab\u00a0yyyyy-mm-ddThh\:mm\:ss\:sss\u00a0\u00bb. Il utilise le type Java java.time.LocalDateTime.
dateTimeInTimezoneDetails=%s sert \u00e0 repr\u00e9senter une date et une heure qui refl\u00e8tent le fuseau horaire ou "time zone (TZ)" de l'ordinateur de l\u2019utilisateur, comme le jour et l'heure d'une r\u00e9union par exemple. Il est stock\u00e9 en base de donn\u00e9es en tant que String \u00e0 l'aide du format ISO 8601 \u00ab\u00a0yyyy-mm-ddThh\:mm\:ss.sssZ\u00a0\u00bb. Il utilise le type Java java.time.OffsetDateTime.
fieldNameShouldStartsWithLowercase=Le nom d'attribut devrait commencer par une minuscule ; une majuscule pourrait engendrer des erreurs.
generatingJarFromBDMModel=G\u00e9n\u00e9ration du jar \u00e0 partir du Mod\u00e8le de Donn\u00e9es M\u00e9tier...
deployBDMJobName=D\u00e9ployer le Mod\u00e8le de Donn\u00e9es M\u00e9tier
continueDeploy=Continuer
duplicateConstraintOrIndexName=Il y a au moins deux %s avec le m\u00eame nom \: %s
emptyBdm=Le Mod\u00e8le de Donn\u00e9es M\u00e9tier doit avoir au moins un Objet M\u00e9tier d\u00e9clar\u00e9
duplicateQueryName=La requ\u00eate '%s' existe d\u00e9j\u00e0 pour l\u2019objet m\u00e9tier '%s'
businessObjectWithoutName=Un Objet M\u00e9tier doit avoir un nom qualifi\u00e9
reservedPackageName=Le package %s est r\u00e9serv\u00e9. Veuillez choisir un autre nom de package.
invalidJavaIdentifier=%s n\u2019est pas un nom qualifi\u00e9 Java valide
invalidCharacterInBusinessObjectName=%s est un caract\u00e8re interdit dans le nom d\u2019un objet m\u00e9tier
businessObjectWithoutField=L\u2019objet m\u00e9tier '%s' doit avoir au moins un attribut d\u00e9fini
duplicateConstraintName=La contrainte '%s' existe d\u00e9j\u00e0 pour l\u2019objet m\u00e9tier '%s'
unknownFieldInConstraint=L'attribut '%s' n'existe pas dans l'objet m\u00e9tier '%s'
invalidFieldIdentifier='%s' n'est pas un identifiant d'attribut valide
indexWithoutName=Un index doit avoir un nom
invalidSqlIdentifier='%s' n'est pas un identifiant SQL valide
indexWithoutField=L'index '%s' doit avoir au moins un attribut d\u00e9clar\u00e9
queryParameterWithoutName=Un param\u00e8tre de requ\u00eate doit avoir un nom
forbiddenQueryParameterName=%s est un nom de param\u00e8tre r\u00e9serv\u00e9. Utilisez un nom diff\u00e9rent\u00a0de \: %s
queryParameterWithoutClassName=Le param\u00e8tre de requ\u00eate %s doit avoir un nom de classe
queryWithoutName=Une requ\u00eate doit avoir un nom
queryNameLengthToHigh=La taille de '%s' doit \u00eatre inf\u00e9rieure \u00e0 150 caract\u00e8res
queryWithoutContent=La requ\u00eate '%s' doit avoir un contenu d\u00e9fini
queryWithoutReturntype=La requ\u00eate '%s' doit avoir un type de retour d\u00e9fini
fieldWithoutName=L'attribut '%s' doit avoir un type d\u00e9clar\u00e9
constraintWithoutName=Une contrainte d'unicit\u00e9 doit avoir un nom
constraintWithoutField=La contrainte d'unicit\u00e9 '%s' doit avoir au moins un attribut d\u00e9clar\u00e9
boUsedInCompositionAndAggregation=L'objet '%s' est r\u00e9f\u00e9renc\u00e9 \u00e0 la fois en composition et en agr\u00e9gation. Cela pourrait occasionner des erreurs lors de l\u2019ex\u00e9cution, et cr\u00e9er des comportements impr\u00e9dictibles lors de la configuration des contr\u00f4les d\u2019acc\u00e8s.
circularCompositionReference=L'objet m\u00e9tier '%s' se r\u00e9f\u00e9rence lui-m\u00eame en composition ou est r\u00e9f\u00e9renc\u00e9 plusieurs fois dans l'objet '%s'
severalCompositionReferenceForABusinessObject=L'objet m\u00e9tier '%s' est r\u00e9f\u00e9renc\u00e9 en composition dans deux objets m\u00e9tiers, ou est r\u00e9f\u00e9renc\u00e9 plusieurs fois dans un m\u00eame objet m\u00e9tier
multipleAggregationToItself=L'objet '%s' se r\u00e9f\u00e9rence lui-m\u00eame dans une relation d\u2019agr\u00e9gation multiple
importButtonLabel=Importer
importBdm=Importer un Mod\u00e8le de Donn\u00e9es M\u00e9tier
importBdmDesc=Importer un nouveau Mod\u00e8le de Donn\u00e9es M\u00e9tier.
bdmImportedTitle=Mod\u00e8le de Donn\u00e9es M\u00e9tier import\u00e9
bdmImported=Le Mod\u00e8le de Donn\u00e9es M\u00e9tier a \u00e9t\u00e9 import\u00e9 et d\u00e9ploy\u00e9 avec succ\u00e8s.
bdmWillBeOverwritten=Il existe d\u00e9j\u00e0 un Mod\u00e8le de Donn\u00e9es M\u00e9tier.
bdmZipInvalid=L'archive %s n\u2019est pas valide, elle ne contient pas de Mod\u00e8le de Donn\u00e9es M\u00e9tier.
cleanDeployTitle=Clean deploy
cleanDeployMsg=This will drop the BDM database table, all existing data in the BDM will be lost.\nContinue ?