generatedJavaRepository=Meus Tipos Java Gerados
name=Name
packageName=Pacote (package)
error=Error
error_emptyName=Deve ter um nome
type=Type
Remove=Remove
selectBusinessObjectWizardTitle=Select a Business Object
selectBusinessObjectWizardMessage=Select an existing Business Object to edit.
businessObjectRepositoryStoreName=Modelo de dados de neg\u00f3cio
errorMessageSameDataTypeNames=Um outro tipo de dados com o mesmo nome j\u00e1 existe.
errorMessageNoWhitespaceInDataTypeNames=Whitespace is not allowed in a Business Object name.
noBusinessObjectSelected=Select a Business Object.
addBusinessObjectDataTitle=Adicionar uma nova vari\u00e1vel de neg\u00f3cio para {0}
addBusinessObjectDataDescription=Cria uma nova refer\u00eancia para um objeto de neg\u00f3cio definido em Desenvolvimento > menu Modelo de Dados de Neg\u00f3cio
description=Description
businessObject=Business Object
dataWithSameNameAlreadyExists=A data with the same name already exists
editBusinessObjectDataWindowTitle=Editar vari\u00e1vel de neg\u00f3cio
editBusinessObjectDataTitle=Edit Business variable
editBusinessObjectDataDescription=Editar uma vari\u00e1vel de neg\u00f3cio existente
createNewBusinessObject=<A>Create a new Business Object...</A>
businessObjectNotFound=Business Object {0} not found
errorWhileDeployingBDR=An error occurred while publishing the Business Data Model
publish=Publish
publishBusinessObjectTitle=Publish Business Object
publishBusinessObjectDescription=Publish selected Business Object in engine
businessObjectPublishedMessage=Business Object published successfully.
businessObjectPublishedTitle=Business Object published
export=Export
exportBusinessDataModelTitle=Export Business Data Model
exportBusinessDataModelDescription=Export a Business Data Model to be deployed in the {0}.\nThe generated archive file name will be "bdm.zip"
exportBusinessDataModelSuccessFull=Business Data Model has successfully been exported to {0}
exportingBusinessDataModel=Exporting Business Data Model...
destinationPath=Caminho de destino
invalidDestinationPath=Destination path is not a valid folder
browse=Procurar...
deployingBusinessObjects=Deploying Business Data Model...
add=Add
delete=Delete
listOfBusinessObjects=List of Business Objects
selectABusinessObjectToEdit=Select a Business Object to edit
up=Acima
down=Baixar
length=Length
mandatory=Mandatory
fieldNameAlreadyExists=Attribute name already exists
constraintNameAlreadyExists=Constraint name already exists
deleteBOConfirmTitle=Delete Business Object?
deleteBOConfirmMessage=Delete the Business Object `%s`?
attribute=attribute
error_emptyPackageName=Package name is empty
modelValidationFailedTitle=Relat\u00f3rio de valida\u00e7\u00e3o
validatingBDM=Validating...
atLeastOneAttributeShouldExists={0} must have at least one attribute.
manageBusinessDataModelTitle=Implantando o Modelo de Dados de Neg\u00f3cio
manageBusinessDataModelDesc=Add Business Objects to the list and edit their details in the right pane tabs.
reservedKeyWord={0} is a reserved keyword
saving=Saving...
constraints=Unique constraints
businessDataModel=Business data model
selectUniqueConstraintFieldsMessage=Select the combination of attributes to which the unique constraint will be applied.
warningTextConstraint=Voc\u00ea n\u00e3o pode usar seus atributos com o tipo TEXT para definir a restri\u00e7\u00e3o \u00fanica.\nAlterne para o tipo de STRING se voc\u00ea precisar.
selectUniqueConstraintFieldsTitle=Select attributes
attributes=Attributes
atLeastOneAttributeShouldBelongToConstraint=At least one attribute should be defined for unique constraint {0}
attributeInConstraintNotExists=Attribute {0} in unique constraint {1} doesn''t exist
atLeastOneAttributeShouldBelongToIndex=At least one attribute should be defined for index {0}
attributeInIndexNotExists=Attribute {0} in index {1} doesn''t exist
atLeastOneBusinessObjectShouldExists=At least one Business Object should be defined
invalidSQLIdentifier={0} is not a valid SQL identifier
queries=Queries
queryNameAlreadyExists=Query name already exists
query=Consulta
parameters=Parameters
parameter=param
queryParameterNameAlreadyExists=Parameter {0} already exists
newQuery=Create query on {0}
newQueryDescription=Type the query using JPQL. You may use or discard the example provided.\nThen adapt the default list of parameters. If needed, modify the result type.
editQuery=Edit {0} on {1}
editQueryDescription=Edit the query using JPQL. Then adapt the list of parameters.\nIf needed, modify the result type.
parameterNotUsedInQueryWarning={0} is defined in parameter''s list but never used in query
undefinedParameter={0} is not defined in parameter''s list
exportCompleted=Export completed
queryResultType=Result type
multipleReturnType=Multiple (java.util.List)
multiple=M\u00faltiplo
single=Single ({0})
numeric=Numeric (java.util.Long)
queryLink=JPQL Query * <a>?</a>
jpqlParametersHint=Define parameters used in the above query
emptyQueryError=JPQL Query cannot be empty
queryNameReserved={0} is a reserved query name (query generated in default queries)
queryExpressionLabel=Query
queryContent=Query content
value=Value
returnType=Return type
dropBusinessDataDBOnExit=Limpar banco de dados de neg\u00f3cios na sa\u00edda
dropBusinessDataDBOnBDMChanges=Limpar banco de dados de neg\u00f3cios quando o Modelo de Neg\u00f3cios for alterado
queryExpressionGuidance=Select the Business Object and the corresponding query to execute. Set the value for each parameter required by the query.
bdmCompatibilityTitle=Warning\: Impact of changes
bdmCompatibilityMsg=This BDM is available to all processes in your Studio, and to application pages and process forms using REST API calls. Changing the BDM might cause inconsistencies.\nAfter the BDM update, validate each diagram and check your pages and forms.\n\nIf you have changed the Mandatory or Multiple setting for an attribute, a unique constraint, or if you have changed a non-primitive attribute type, you must clean the BDM database structure and data.
clearExistingBusinessData=Clean BDM database before deployment
businessObjectNameAlreadyExists=A Business Object already exists with the same name
installFailedTitle=Deploy failed
installFailedMessage=An error occurred while deploying the Business Data Model in engine
defaultQueriesOption=Default
customQueriesOption=Custom
defaultQueriesHint=4 default types of queries to select Business Objects\: based on unique constraints, which returns\nsingle results, based on simple attributes (with equals criterion) which returns multiple and their associated countFor queries\nresults, and a Select All, which returns all Business Data on the Business Object.
providedQuery=Provided query
providedQueryDescription=Display the content of this provided query
queryParameterNameReservedForPagination={0} is a reserved keyword for pagination
orderByMissingWarning=You have defined a query that returns a list of business objects. It's highly recommended to use an ORDER BY clause when returning a list.
paginationParameterHint=2 Pagination parameters are offered, to be used through the APIs.\nstartIndex is the index in the list of results to be displayed first, maxResults is the number of items to display in the page.\nNote\: In application forms, widgets only display one page of elements.
newQueryTitle=Create query
editQueryTitle=Edit query
howToUseBusinessObjects=How to use Business Objects
howToUseBusinessObjectsContent=To use business data in a process, you need to define a business variable at pool level.\nTo read business data in a process, you can also use the business object DAO in a Groovy script or use a query expression.\n\nTo use business data in a form or application page, use the REST API in the widget value property.
multipleBusinessData=\u00c9 m\u00faltiplo
composition=Composition
aggregation=Aggregation
relation=Relationship
indexes=Indexes
indexNameAlreadyExists=Index name already exists
indexedAttributes=Indexed attributes
availableAttributes=Available attributes
selectIndexFieldsTitle=Select attributes for {0}
selectIndexFieldsMessages=Select the attributes for this index. The performance of this query filter is significantly improved, depending on the attributes and order chosen.
warningTextIndex=Voc\u00ea n\u00e3o pode indexar um atributo com o tipo TEXT. Alterne para o tipo de STRING se voc\u00ea precisar.
businessObjectDAO=Business Object DAO
mandatoryColumnTooltip=If you check Multiple and Mandatory, at least one value is mandatory.
stringLengthTooltip=Use o STRING se voc\u00ea precisa de uma restri\u00e7\u00e3o e/ou indexes \u00fanicos. Seu comprimento m\u00e1ximo depende do seu banco de dados.\nPara mais strings, escolha o tipo TEXT. Equivalente do banco de dados\: varchar
lengthCannotBeEmpty=Length must be a valid positive integer
noDetailsAvailable=No details available
details=Details
detailsFor=Details for {0}
realtionTooltip=- Agrcri\u00e7\u00e3o significa "\u00e9 referenciado por"\: o objeto relacionado tem seu pr\u00f3prio ciclo de vida;\nN\u00e3o pode ser criado na mesma transa\u00e7\u00e3o que cria seu pai.\n- Composi\u00e7\u00e3o significa "faz parte de"\: o objeto relacionado pode ser modificado\nquando o objeto pai \u00e9 salvo no banco de dados.\n\ufe0f Um determinado objeto pode ser usado na composi\u00e7\u00e3o por um e apenas um outro objeto. 
errorMessageNoUnderscoreInBoNames='_' is not allowed in a Business Object name.
loadOnDemand=Only load related objects when needed
loadOnDemandHint=This option is recommended for objects which are rarely displayed or modified with the parent Business Object
alwaysLoad=Always load related objects
alwaysLoadHint=This option is recommended for objects which are often displayed or modified with the parent Business Object
createBusinessDataVariable=Create a Business data...
error_reservedPackagePrefix={0} is a reserved package prefix.
warning_reservedPackagePrefix={0} \u00e9 um prefixo de pacote desaconselhado.
disabledMandatoryTooltip=Um atributo m\u00faltiplo n\u00e3o pode ser obrigat\u00f3rio.
defaultValue=Default value
defaultValueReturnTypeValidationMessage=A express\u00e3o de valor padr\u00e3o retorna {0}, mas {1} \u00e9 esperado
addBusinessObjectDataWindowTitle=Nova vari\u00e1vel de neg\u00f3cio
defaultValueBusinessDataTooltip=Business data can be initialized with existing Business Objects using a query\nor by creating a new one using a Groovy Script and the provided dao variable (XXXDAO.newInstance()).
cleaningBusinessObjects=Cleaning Business data model...
countQueryInfo=To get paged results from a REST API query on this business object you must create a related count query. For a query named "queryName", create a query named "countForQueryName" that counts the total number of results.
missingCountQuery=You can define a count query {0} to enable paged results from this REST API query.
queryReturnTypeWarning=Only below return types are supported.\nIt is currently not possible to use multiple SELECT expressions like 'SELECT e.name,e.id FROM...'.
modelValidationFailedMsg=A valida\u00e7\u00e3o do modelo de dados de neg\u00f3cio falhou com os seguintes problemas. Corrija esses problemas para ser capaz de salvar seu modelo.
bdmDeployedTitle=Modelo de Dados de Neg\u00f3cio implantado
bdmDeployedMessage=The Business Data Model has been deployed successfully.\n\u26a0 Open sessions have been closed (portal,applications...). You need to log back in.
doNotShowMeAgain=N\u00e3o mostrar esta mensagem novamente.
bdmDeployDetails=Business Data Model deployment steps\:\n\u0009\u23f8 Pause BPM services (\u2192 closes all open sessions)\n\u0009\u26a1 Generate Java entities and DAO from model\n\u0009\u26a1 Create/Update database schema\n\u0009\u25b6 Resume BPM services
textDetails=Use TEXT se o tamanho da string poss\u00edvel exceder o tamanho m\u00e1ximo de STRING em seu banco de dados (por exemplo, para \u00e1reas de texto).\nCuidado com isso evitar\u00e1 restri\u00e7\u00f5es ou \u00edndices exclusivos.\nBanco de dados equivalente\: Clob.
lengthIsNotAPositiveNumber=O tamanho deve ser um inteiro positivo
lengthIsNotANumber=O comprimento deve ser um n\u00famero inteiro
dateDetails=DATE armazena uma data e um tempo na base de dados usando uma LONG (n\u00famero de milissegundos decorridos desde 01/01/1970 00\:00\: (UTC)) e usa java.util.Date como tipo Java.
legacyDateTooltip=Opera\u00e7\u00f5es complexas no Designer de UI, Groovy scripts e REST API criou algumas inconsist\u00eancias com o tipo DATE. \nPor conseguinte, o DATE permanece na lista para suportar os desenvolvimentos anteriores, mas para novos desenvolvimentos, use os tipos DATE ONLY, DATE-TIME (NO TIME ZONE), ou DATE-TIME (TIME ZONE) para lidar com data ou data/hora dependendo do seu caso de uso.
dateOnlyDetails=%s \u00e9 usado para manter uma data sem hora. Use-a para datas de nascimento, por exemplo. Ele \u00e9 armazenado no banco de dados como uma String, usando ISO-8601 "aaaa-mm-dd". Usa um java.time.LocalDate como tipo Java.
dateTimeDetails=%s \u00e9 usado para manter uma data-hora que exibe o mesmo que o fuso hor\u00e1rio do usu\u00e1rio (NO Time Zone). Use-o para hora de abertura de lojas, por exemplo.\nEle \u00e9 armazenado no banco de dados como uma String usando ISO 8601 "aaaa-mm-ddThh\:mm\:ss\:sss". Usa java.LocalDateTime como tipo Java.
dateTimeInTimezoneDetails=%s \u00e9 usado para manter uma data-hora que exibe o mesmo que o fuso hor\u00e1rio do usu\u00e1rio (Time Zone). Use-o para hora de abertura de lojas, por exemplo.\nEle \u00e9 armazenado no banco de dados como uma String usando ISO 8601 "aaaa-mm-ddThh\:mm\:ss\:sss". Usa java.LocalDateTime como tipo Java.
fieldNameShouldStartsWithLowercase=O nome do atributo deve come\u00e7ar com um caso menor, caso contr\u00e1rio pode levar a alguns erros.
generatingJarFromBDMModel=Gerando jar do Modelo de Dados de Neg\u00f3cio...
deployBDMJobName=Implantar o Modelo de Dados de neg\u00f3cio
continueDeploy=Continuar
duplicateConstraintOrIndexName=Existem pelo menos dois %s com o mesmo nome \: %s
emptyBdm=Modelo de objeto de neg\u00f3cio deve ter pelo menos um objeto de neg\u00f3cio declarado
duplicateQueryName=A consulta '%s' j\u00e1 existe para o objeto de neg\u00f3cio '%s'
businessObjectWithoutName=Um Objeto de Neg\u00f3cio deve ter um nome qualificado
reservedPackageName=O pacote %s est\u00e1 reservado. Por favor, escolha outro nome de pacote
invalidJavaIdentifier=%s n\u00e3o \u00e9 um nome qualificado v\u00e1lido para Java
invalidCharacterInBusinessObjectName=%s \u00e9 um caractere proibido no nome do objeto de neg\u00f3cio
businessObjectWithoutField=O objeto de neg\u00f3cio '%s' deve ter pelo menos um atributo declarado
duplicateConstraintName=A consulta '%s' j\u00e1 existe para o objeto de neg\u00f3cio '%s'
unknownFieldInConstraint=O atributo '%s' n\u00e3o existe no objeto de neg\u00f3cio '%s'
invalidFieldIdentifier='%s' n\u00e3o \u00e9 um identificador de atributo v\u00e1lido
indexWithoutName=Um \u00edndice deve ter nome
invalidSqlIdentifier='%s n\u00e3o \u00e9 um identificador SQL v\u00e1lido
indexWithoutField=O \u00edndice '%s' deve ter pelo menos um atributo declarado
queryParameterWithoutName=Um par\u00e2metro de consulta deve ter nome
forbiddenQueryParameterName=%s \u00e9 um nome de par\u00e2metro reservado. Use um nome diferente de\: %s
queryParameterWithoutClassName=%s par\u00e2metro de consulta deve ter um nome de classe
queryWithoutName=Uma consulta deve ter nome
queryNameLengthToHigh='%s' comprimento deve ser inferior a 150 caracteres
queryWithoutContent=A consulta '%s' deve ter um conte\u00fado definido
queryWithoutReturntype=A consulta '%s' deve ter um tipo de retorno definido
fieldWithoutName=O atributo '%s' deve ter um tipo declarado
constraintWithoutName=Uma restri\u00e7\u00e3o \u00fanica deve ter nome
constraintWithoutField=A restri\u00e7\u00e3o \u00fanica '%s' deve ter pelo menos um atributo declarado
boUsedInCompositionAndAggregation=O objeto '%s' \u00e9 referenciado tanto na composi\u00e7\u00e3o como na agrega\u00e7\u00e3o. Isso pode levar a erros de execu\u00e7\u00e3o e pode levar a um comportamento imprevis\u00edvel da configura\u00e7\u00e3o do AccessControl
circularCompositionReference=O objeto de neg\u00f3cio '%s' tem uma refer\u00eancia de composi\u00e7\u00e3o circular para si mesmo ou \u00e9 referenciado v\u00e1rias vezes no objeto '%s'
severalCompositionReferenceForABusinessObject=O objeto de neg\u00f3cio '%s' \u00e9 referenciado pela composi\u00e7\u00e3o em dois objetos de neg\u00f3cio, ou \u00e9 referenciado v\u00e1rias vezes em um \u00fanico objeto de neg\u00f3cio
multipleAggregationToItself=O objeto '%s' est\u00e1 referenciando-se em uma rela\u00e7\u00e3o de m\u00faltiplos agregamentos
importButtonLabel=Importar
importBdm=Importar Modelo de Dados de Neg\u00f3cio
importBdmDesc=Importar um novo Modelo de Dados de Neg\u00f3cio.
bdmImportedTitle=Modelo de Dados de Neg\u00f3cio importado
bdmImported=Business Data Model has been imported successfully.
bdmWillBeOverwritten=Um Modelo de Dados de Neg\u00f3cio j\u00e1 est\u00e1 definido.
bdmZipInvalid=O arquivo %s \u00e9 inv\u00e1lido, n\u00e3o cont\u00e9m um Modelo de Dados de Neg\u00f3cio.
cleanDeployTitle=Limpar implanta\u00e7\u00e3o
cleanDeployMsg=Isto eliminar\u00e1 a tabela de dados BDM, todos os dados existentes no BDM ser\u00e3o perdidos.\nContinuar?
businessDataModelDeployed=Business Data Model has been deployed.
addBusinessObject=New Business Object
addPackage=New package
deletePackageConfirmTitle=Delete package
deletePackageConfirm=Delete the package `%s` and all its Business Objects ?
mergePackageConfirmTitle=Merge packages
mergePackageConfirm=Merge the packages `%s` and `%s`?
searchBusinessObject=Search business object
updatePackage=Update package
updatePackageTitle=Update Business Object package
updatePackageMessage=Update the package of the Business Object %s.
selectBdmToMerge=Select the BDM archive to import and merge
importBdmHelpMessage=Import the new BDM into the current one.\n\n\u26a0\ufe0f This operation is possible if the two models fulfill the following condition\: Business object names must be unique across all packages. 
overwriteBdmHelpMessage=Overwrite the the current Business Data Model schema with the imported one.
archiveContentInvalid=Impossible to parse the archive content into a Business Data Model.
businessObjectNameDuplicated=Both schemas contains a Business Object %s, those Business Objects are not identical (same package and same content)
smartImportCompletedTitle=Import completed
smartImportCompleted=The Business Data Model has been imported successfully.
smartImportImpossibleTitle=Cannot automatically merge
smartImportImpossible=Impossible to import the new Business Data Model into the current one.
updateModelsHint=Update one of the models to solve the following conflicts and try again.
importOption=Import
overwriteOption=Overwrite
importAction=Import action
importBdmDescription=Import a Business Data Model. If a BDM is already defined, you can import the new one into the current one or overwrite it. 
errorOnImport=An error occurred while importing the Business Data Model.
importingBdm=Importing Business Data Model...