linkGoToIsNull = \ Debe ir a especificar el atributo  de {0} 
initializingProcessEngine=Incie el motor de procesos
deploymentFailedMessage = Run ha fallado durante la implementaci\u00f3n del proceso
deployingProcess = Instalando el proceso {0}...
exportErrorOccured = Error de compilaci\u00f3n
exportProcessMessage = Todos los procesos en este diagrama se exportar\u00e1n como archivos individuales *.bar en la carpeta de destino seleccionada
exportProcessTitle = Exportaci\u00f3n de procesos como la barra archivos
cantDeployEmptyPool = Imposible ejecutar un proceso vac\u00edo
confirmSaveMessage = La operaci\u00f3n solicitada espera su proceso para ser salvo antes de la transformaci\u00f3n. \u00bfDesea guardarlo ahora?
confirmSaveTitle = Guardar
OpenUserXPButtonLabel = Aplicaciones
RunButtonLabel = Ejecutar
engineConfigurations = Configuraciones del motor
defaultConfiguration = Configuraci\u00f3n por defecto
exporting = Exportando... 
exportSuccessTitle = compilaci\u00f3n satisfactoria
exportSuccessMsg=Build ha terminado con \u00e9xito\!
initializingUserXP = Iniciando Portal ...
waitingForEngineToStart=Esperando el arranque del servidor... 
enablingProcess = Habilitar {0}...
undeploying = Extracci\u00f3n de definici\u00f3n previa de {0}
selectProcessToExport = Seleccione los procesos para exportar
buildTitle = Compilar
buildDesc=Crear archivos de negocios ejecutables desde sus procesos
destinationPath = ruta de destino
selectDestinationTitle=Seleccione el destino
browse = Buscar...
selectAtLeastOneProcess = Por favor, seleccione al menos un proceso
searchProcess = Proceso de b\u00fasqueda...
validationFailedTitle = Error de validaci\u00f3n\n
stoppingWebServer = Detenci\u00f3n del servidor web ...
startingWebServer = Iniciando el servidor web...
applyingLooknFeel = Aplicaci\u00f3n de apariencia...
loginAs = Defina el nombre de usuario y su contrase\u00f1a que se utilizar\u00e1n para iniciar la sesi\u00f3n en el Portal
defaultUserXPThemeLabel=Default Look'n'Feel para
BonitaPreferenceDialog_UserXP_Settings = Servidor
userNameLLabel = Nombre de usuario
userPasswordLabel = Contrase\u00f1a
consolePreferencePortLabel = & Puerto
consolePreferenceHostLabel = Host
portAlreadyUseTitle = Puerto no disponible
portAlreadyUseMsg = El puerto {0} ya se utiliza por otra aplicaci\u00f3n.\nPor favor elija otro valor de puerto entre 1024 y 65535.
updatingServerPort = Actualizando puerto del servidor
exportErrorOccuredMsg = Build ha fallado con los siguientes errores
errorValidationContinueAnywayMessage = \  \u00bfDesea continuar de todos modos?
errorValidationInDiagramToExport=Se han encontrado algunos errores en los diagramas a continuaci\u00f3n\:
warningValidationInDiagramToExport=Algunas advertencias se han encontrado en los diagramas a continuaci\u00f3n\:
loginFailed=Intento de inicio de sesi\u00f3n con el usuario {0} ha fallado\! Por favor comprueba que este usuario existe en la organizaci\u00f3n activa o que la contrase\u00f1a es correcta en la configuraci\u00f3n de su ejecuci\u00f3n.
errorActorMappingGroup = Error en la definici\u00f3n del grupo de la siguiente Mapeo de Actor
running = Ejecutando...
restartingWebServer = Reiniciar el servidor web...
resetingEngine = Limpieza de base de datos de motor...
undeploymentFailedMessage = Run ha fallado durante la implementaci\u00f3n del proceso
cannotStartTomcatTitle=Tomcat no puede ser lanzado
cannotStartTomcatMessage=Tomcat no se puede lanzar\:\nel puerto podr\u00eda estar siendo utilizado por otra aplicaci\u00f3n.\nLas causas posibles son\:\n\u2022 otro Studio u otro Tomcat ya est\u00e1 en ejecuci\u00f3n.\n\u2022 configur\u00f3 argumentos adicionales de JVM Tomcat no v\u00e1lidos. 
noInitiatorDefinedTitle=No hay iniciador definido
noInitiatorDefinedMessage=No hay iniciador del proceso definido para {0}. Usted ser\u00e1 redirigido a la aplicaci\u00f3n de usuario.
dontaskagain=No mostrar la pr\u00f3xima vez.
configure=Configurar
processEnableFailedTitle=Activar proceso fallido
processEnableFailedMessage=El proceso no se puede resolver. Por favor, cambie la configuraci\u00f3n para corregir los siguientes problemas. Para los Datos de Negocio, compruebe el Modelo de Datos de Negocio.
disablingProcessDefinition=Deshabilitando {0}...
deletingProcessInstances=Eliminando {0} instancias...
deletingProcessDefinition=Eliminando {0} definici\u00f3n...
updatePortWarningMessage=Actualizar el n\u00famero de puerto eliminar\u00e1 trabajos no guardados en el {0}. Aseg\u00farese de guardar cualquier elemento abiertos en el {0}.
updatePortWarningTitle=Actualiza el n\u00famero de puerto
buildingBar=Construyendo {0} ({1})...
contractButNoFormTitle=Proceso definido con contrato pero sin formulario
contractButNoFormMessage=El proceso {0} ({1}) declara un contrato de proceso pero no tiene un formulario de instanciaci\u00f3n, ha sido desplegado pero debe ser instanciado usando Bonita API o una actividad de llamada. Ser\u00e1s redirigido a la aplicaci\u00f3n de usuario.
resetingEngineFailed=Se ha producido un error al reiniciar el motor.
resetEngine=Reiniciar motor
resetEngineSuccess=Todas las definiciones de proceso desplegadas as\u00ed como sus instancias (archivadas incluidas) se han eliminado con \u00e9xito.
engineLazyLoad=Iniciar servidor de motor perezosamente
diagramDoesntExist=El diagrama %s no existe.
deploymentFailed=Se ha producido un error al desplegar el proceso
deployDoneTitle=Desplegado con \u00e9xito
deployDoneMessage=Los procesos han sido desplegados con \u00e9xito
deployFailedMessage=Se ha producido un error durante el despliegue '%s'.
deploySuccessMessage='%s' %s desplegado
deployingPage=Desplegando p\u00e1gina %s...
deployFailedTitle=Despliegue fallido
tomcatXmxOption=Tomcat M\u00e1xima asignaci\u00f3n de memoria (en Mb)
restartServer=Reiniciar el servidor
restartServerConfirmationMsg=Es necesario reiniciar el servidor para aplicar los cambios. \u00bfDesea reiniciar ahora?
tomcatExtraParams=Tomcat JVM argumentos adicionales
noProcessToRunTitle=Ning\u00fan proceso seleccionado
noProcessToRun=Debe seleccionar un proceso para ejecutar, en el explorador del proyecto o en el diagrama.
buildDoneTitle=compilaci\u00f3n satisfactoria
buildDoneMessage=El proceso %s se ha construido correctamente en %s.
buildFailedTitle=Error de compilaci\u00f3n
startingEngineServer=Arrancando el servidor del motor...
deployingProcessesFrom=Desplegando todos los procesos de %s...
restartServerMsg=Reiniciar servidor en segundo plano. Tambi\u00e9n puede eliminar la base de datos del motor al reiniciar el servidor. Se recrear\u00e1 la base de datos desde cero, todas las instancias ejecutadas y archivadas se perder\u00e1n. La base de datos de datos de negocios no se descarta en el proceso.
dropEngineDatabase=Eliminar base de datos de motor
uidExtraParams=UI Designer JVM options
missingRestAPIStatus='%s' requiere %s extensi\u00f3n(es) API. Despliegue primero las extensiones de API restantes correspondientes.
debugCustomPageMode=Modo de depuraci\u00f3n de p\u00e1gina personalizada
debugCustomPageModeHint=Cuando est\u00e1 habilitado, el classloader de p\u00e1ginas personalizadas se reconstruye en cada llamada. Puede ser \u00fatil al actualizar el codigo fuente de la p\u00e1gina personalizada directamente desde la carpeta de cach\u00e9 (<tomcat_folder>/server/temp/bonita_portal_<id>@hostname/tenants/<id>/pages/<custompage_folder>)
deployWithWarningMessage=Se han desplegado con \u00e9xito los procesos, pero se han encontrado algunas advertencias.
additionalResourceProjectPathNotSet=%s (%s) error de construcci\u00f3n\: No hay archivo establecido para '%s' recurso adicional.
additionalResourceFileNotFound=%s (%s) error de construcci\u00f3n\: archivo '%s' no existe para '%s' recurso adicional.
restartServerNotificationTitle=Reiniciando el servidor Bonita
restartServerNotificationMessage=El servidor Bonita se est\u00e1 reiniciando.\nAlgunas funcionalidades (Bonita Portal, Bonita REST API's ...) no estar\u00e1n disponibles mientras el servidor no est\u00e9 funcionando.
restartServerCompletedNotificationTitle=Servidor Bonita reiniciado
serverRunningNotificationMessage=El servidor Bonita se est\u00e1 ejecutando, todas las funcionalidades est\u00e1n disponibles.
startServerNotificationTitle=Iniciando servidor Bonita
startServerCompletedNotificationTitle=Servidor Bonita iniciado
engineLazyModeNotificationLink=Al abrir un proyecto Bonita, el servidor Bonita est\u00e1 configurado para iniciarse autom\u00e1ticamente.\nPuede actualizar este comportamiento en <a>las preferencias </a>.
none=Ninguno
configuration=Configuraci\u00f3n
invalidConfigurationForEnv=Se han encontrado configuraciones de proceso no v\u00e1lidas para el entorno %s
processDeployedButNoUserAppFound=%s (%s) ha sido desplegado con \u00e9xito pero no se ha encontrado ninguna aplicaci\u00f3n de usuario. \u00bfDesea abrir el directorio de aplicaciones en su lugar?
processDeployedTitle=Proceso desplegado
runButtonTooltip=Construye y despliegue el proceso seleccionado y abre el formulario de instanciaci\u00f3n de proceso en la aplicaci\u00f3n de usuario si existe.
userAppToken=Token de aplicaci\u00f3n de usuario (Usar con el proceso 'Ejecutar')