linkGoToIsNull = {0} \u306e\u5c5e\u6027\u3078\u306e\u9032\u307f\u5148\u3092\u6307\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
initializingProcessEngine=\u30d7\u30ed\u30bb\u30b9 \u30a8\u30f3\u30b8\u30f3\u306e\u521d\u671f\u5316
deploymentFailedMessage = \u30d7\u30ed\u30bb\u30b9\u3092\u30c7\u30d7\u30ed\u30a4\u4e2d\u306b\u5b9f\u884c\u304c\u5931\u6557\u3057\u307e\u3057\u305f\u3002
deployingProcess = \u30d7\u30ed\u30bb\u30b9 {0} \u3092\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3057\u3066\u3044\u307e\u3059...
exportErrorOccured = \u30d3\u30eb\u30c9\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
exportProcessMessage = \u3053\u306e\u30c0\u30a4\u30a2\u30b0\u30e9\u30e0\u5185\u306e\u3059\u3079\u3066\u306e\u30d7\u30ed\u30bb\u30b9\u306f\u3001\u9078\u629e\u3057\u305f\u6307\u5b9a\u5148\u30d5\u30a9\u30eb\u30c0\u5185\u306e\u500b \u306e *.bar \u30d5\u30a1\u30a4\u30eb\u3068\u3057\u3066\u30a8\u30af\u30b9\u30dd\u30fc\u30c8\u3055\u308c\u307e\u3059\u3002
exportProcessTitle = \u30d7\u30ed\u30bb\u30b9\u3092 .bar \u30d5\u30a1\u30a4\u30eb\u3068\u3057\u3066\u30a8\u30af\u30b9\u30dd\u30fc\u30c8\u3057\u307e\u3059\u3002
cantDeployEmptyPool = \u7a7a\u306e\u30d7\u30ed\u30bb\u30b9\u3092\u5b9f\u884c\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
confirmSaveMessage = \u8981\u6c42\u3055\u308c\u305f\u64cd\u4f5c\u306f\u3001\u51e6\u7406\u306e\u524d\u306b\u30d7\u30ed\u30bb\u30b9\u3092\u4fdd\u5b58\u3059\u308b\u3053\u3068\u3092\u6c42\u3081\u3066\u3044\u307e\u3059\u3002\u4eca\u3059\u3050\u4fdd\u5b58\u3057\u307e\u3059\u304b\uff1f
confirmSaveTitle = \u4fdd\u5b58
OpenUserXPButtonLabel = Applications
RunButtonLabel = \u5b9f\u884c
engineConfigurations = \u30a8\u30f3\u30b8\u30f3\u306e\u69cb\u6210\u8a2d\u5b9a
defaultConfiguration = \u65e2\u5b9a\u306e\u69cb\u6210\u8a2d\u5b9a
exporting = \u30a8\u30af\u30b9\u30dd\u30fc\u30c8\u3057\u3066\u3044\u307e\u3059...
exportSuccessTitle = \u30d3\u30eb\u30c9
exportSuccessMsg=\u30d3\u30eb\u30c9\u304c\u6b63\u5e38\u306b\u7d42\u4e86\u3057\u307e\u3057\u305f \uff01
initializingUserXP = \u30dd\u30fc\u30bf\u30eb\u3092\u521d\u671f\u5316\u3057\u3066\u3044\u307e\u3059...
waitingForEngineToStart=\u30b5\u30fc\u30d0\u30fc\u306e\u8d77\u52d5\u3092\u5f85\u3063\u3066\u3044\u307e\u3059... 
enablingProcess = {0} \u3092\u6709\u52b9\u306b\u3057\u3066\u3044\u307e\u3059...
undeploying = {0} \u306e\u4ee5\u524d\u306e\u5b9a\u7fa9\u3092\u524a\u9664\u3057\u3066\u3044\u307e\u3059...
selectProcessToExport = \u30a8\u30af\u30b9\u30dd\u30fc\u30c8\u3059\u308b\u30d7\u30ed\u30bb\u30b9\u3092\u9078\u629e
buildTitle = \u554f\u984c\u306e\u306a\u3044\u30d3\u30eb\u30c9\u3092\u751f\u6210
buildDesc=\u30d7\u30ed\u30bb\u30b9\u304b\u3089\u5b9f\u884c\u53ef\u80fd\u306a\u30d3\u30b8\u30cd\u30b9 \u30a2\u30fc\u30ab\u30a4\u30d6\u3092\u4f5c\u6210\u3057\u307e\u3059\u3002
destinationPath = \u30bf\u30fc\u30b2\u30c3\u30c8 \u30d1\u30b9
selectDestinationTitle=\u6307\u5b9a\u5148\u306e\u9078\u629e
browse = \u53c2\u7167...
selectAtLeastOneProcess = \u5c11\u306a\u304f\u3068\u3082 1 \u3064\u306e\u30d7\u30ed\u30bb\u30b9\u3092\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044\u3002
searchProcess = \u30d7\u30ed\u30bb\u30b9\u3092\u691c\u7d22\u4e2d...
validationFailedTitle = \u691c\u8a3c\u306b\u5931\u6557\u3057\u307e\u3057\u305f
stoppingWebServer = Web \u30b5\u30fc\u30d0\u30fc\u3092\u505c\u6b62\u3057\u3066\u3044\u307e\u3059...
startingWebServer = Web \u30b5\u30fc\u30d0\u30fc\u3092\u958b\u59cb\u3057\u3066\u3044\u307e\u3059...
applyingLooknFeel = \u30eb\u30c3\u30af\uff06\u30d5\u30a3\u30fc\u30eb\u3092\u9069\u7528\u3057\u3066\u3044\u307e\u3059...
loginAs = \ \u30dd\u30fc\u30bf\u30eb\u306b\u30ed\u30b0\u30a4\u30f3\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3059\u308b\u5229\u7528\u8005\u306e\u30e6\u30fc\u30b6\u30fc\u540d\u3068\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u9078\u629e\u3057\u307e\u3059\u3002
defaultUserXPThemeLabel=Bonita \u30dd\u30fc\u30bf\u30eb\u306e\u30c7\u30d5\u30a9\u30eb\u30c8 \u30eb\u30c3\u30af\uff06\u30d5\u30a3\u30fc\u30eb
BonitaPreferenceDialog_UserXP_Settings = \u30b5\u30fc\u30d0\u30fc\u306e\u8a2d\u5b9a
userNameLLabel = \u30e6\u30fc\u30b6\u30fc\u540d
userPasswordLabel = \u30d1\u30b9\u30ef\u30fc\u30c9
consolePreferencePortLabel = \u30dd\u30fc\u30c8(&P)
consolePreferenceHostLabel = \u30db\u30b9\u30c8 \u30a2\u30c9\u30ec\u30b9
portAlreadyUseTitle = \u30dd\u30fc\u30c8\u304c\u5229\u7528\u3067\u304d\u307e\u305b\u3093\u3002
portAlreadyUseMsg = \u30dd\u30fc\u30c8 {0} \u306f\u65e2\u306b\u5225\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3067\u4f7f\u7528\u3055\u308c\u3066\u3044\u307e\u3059\u3002\n\u5225\u306e\u30dd\u30fc\u30c8\u5024 \uff081024  \uff5e 65535 \u306e\u5024\uff09\u3092\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044\u3002
updatingServerPort = \u30b5\u30fc\u30d0\u30fc\u306e\u30dd\u30fc\u30c8\u3092\u66f4\u65b0\u3057\u3066\u3044\u307e\u3059
exportErrorOccuredMsg = \u30d3\u30eb\u30c9\u306b\u6b21\u306e\u30a8\u30e9\u30fc\u3067\u5931\u6557\u3057\u307e\u3057\u305f
errorValidationContinueAnywayMessage = \u7d9a\u884c\u3057\u307e\u3059\u304b\uff1f
errorValidationInDiagramToExport=\u4e0b\u306e\u30c0\u30a4\u30a2\u30b0\u30e9\u30e0\u3067\u3001\u3044\u304f\u3064\u304b\u306e\u30a8\u30e9\u30fc\u304c\u898b\u3064\u304b\u308a\u307e\u3057\u305f\uff1a
warningValidationInDiagramToExport=\u4ee5\u4e0b\u306e\u30c0\u30a4\u30a2\u30b0\u30e9\u30e0\u306b\u3044\u304f\u3064\u304b\u306e\u8b66\u544a\u304c\u3042\u308a\u307e\u3059\:
loginFailed=\u30e6\u30fc\u30b6\u30fc {0} \u3067\u30ed\u30b0\u30a4\u30f3\u306b\u5931\u6557\u3057\u307e\u3057\u305f \uff01\u3053\u306e\u5229\u7528\u8005\u306f\u30a2\u30af\u30c6\u30a3\u30d6\u306a\u7d44\u7e54\u304c\u5b58\u5728\u3057\u3066\u3044\u308b\u304b\u3001\u304a\u3088\u3073/\u307e\u305f\u306f\u30d1\u30b9\u30ef\u30fc\u30c9\u304c\u3001{1} ({2}) \u306e\u5b9f\u884c\u69cb\u6210\u8a2d\u5b9a\u3067\u6b63\u3057\u3044\u304b\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
errorActorMappingGroup = \u6b21\u306e\u62c5\u5f53\u8005\u30de\u30c3\u30d4\u30f3\u30b0\u306e\u30b0\u30eb\u30fc\u30d7\u5b9a\u7fa9\u306b \u30a8\u30e9\u30fc\u304c\u3042\u308a\u307e\u3059\u3002
running = \u5b9f\u884c\u4e2d...
restartingWebServer = Web \u30b5\u30fc\u30d0\u30fc\u3092\u518d\u8d77\u52d5\u4e2d...
resetingEngine = \u30a8\u30f3\u30b8\u30f3\u306e\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u3092\u30af\u30ea\u30fc\u30cb\u30f3\u30b0\u4e2d...
undeploymentFailedMessage = \u30d7\u30ed\u30bb\u30b9\u3092\u30c7\u30d7\u30ed\u30a4\u4e2d\u306b\u5b9f\u884c\u304c\u5931\u6557\u3057\u307e\u3057\u305f\u3002
cannotStartTomcatTitle=Tomcat \u304c\u8d77\u52d5\u3067\u304d\u307e\u305b\u3093\u3002
cannotStartTomcatMessage=Tomcat\u3092\u8d77\u52d5\u3067\u304d\u307e\u305b\u3093\uff1a\n\u30dd\u30fc\u30c8\u306f\u3059\u3067\u306b\u5225\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306b\u3088\u3063\u3066\u4f7f\u7528\u3055\u308c\u3066\u3044\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\n\u8003\u3048\u3089\u308c\u308b\u539f\u56e0\u306f\u6b21\u306e\u3068\u304a\u308a\u3067\u3059\u3002\n\u2022\u5225\u306eStudio\u307e\u305f\u306f\u5225\u306eTomcat\u304c\u3059\u3067\u306b\u5b9f\u884c\u3055\u308c\u3066\u3044\u308b\u3002\n\u2022\u7121\u52b9\u306aTomcat JVM\u306e\u8ffd\u52a0\u5f15\u6570\u3092\u8a2d\u5b9a\u3057\u305f\u3002
noInitiatorDefinedTitle=\u8d77\u6848\u8005\u304c\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u307e\u305b\u3093
noInitiatorDefinedMessage={0} \u306b\u30d7\u30ed\u30bb\u30b9\u8d77\u6848\u8005\u304c\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002{1} \u306b\u30ea\u30c0\u30a4\u30ec\u30af\u30c8\u3055\u308c\u307e\u3059\u3002
dontaskagain=\u6b21\u56de\u306f\u8868\u793a\u3057\u306a\u3044\u3002
configure=\u69cb\u6210\u8a2d\u5b9a
processEnableFailedTitle=\u30a8\u30e9\u30fc\u306b\u306a\u3063\u305f\u30d7\u30ed\u30bb\u30b9\u3092\u6709\u52b9\u306b\u3057\u307e\u3059
processEnableFailedMessage=\u30d7\u30ed\u30bb\u30b9\u3092\u89e3\u6c7a\u3067\u304d\u307e\u305b\u3093\u3002\u6b21\u306e\u554f\u984c\u3092\u89e3\u6c7a\u3059\u308b\u305f\u3081\u306b\u69cb\u6210\u3092\u5909\u66f4\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u30d3\u30b8\u30cd\u30b9 \u30c7\u30fc\u30bf\u306e\u554f\u984c\u306b\u3064\u3044\u3066\u306f\u3001\u30d3\u30b8\u30cd\u30b9 \u30c7\u30fc\u30bf \u30e2\u30c7\u30eb\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
disablingProcessDefinition={0} \u3092\u7121\u52b9\u306b\u3057\u3066\u3044\u307e\u3059...
deletingProcessInstances={0} \u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u3092\u524a\u9664\u3057\u3066\u3044\u307e\u3059...
deletingProcessDefinition={0} \u306e\u5b9a\u7fa9\u3092\u524a\u9664\u3057\u3066\u3044\u307e\u3059...
updatePortWarningMessage=\u66f4\u65b0\u4e2d\u306e\u30dd\u30fc\u30c8\u756a\u53f7\u306f\u3001{0} \u306b\u4fdd\u5b58\u3057\u3066\u3044\u306a\u3044\u4f5c\u696d\u3092\u524a\u9664\u3057\u307e\u3059\u3002{0} \u3067\u958b\u304b\u308c\u305f\u8981\u7d20\u3092\u4fdd\u5b58\u3057\u305f\u304b\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
updatePortWarningTitle=\u30dd\u30fc\u30c8\u756a\u53f7\u3092\u66f4\u65b0\u3057\u307e\u3059
buildingBar={0} ({1}) \u3092\u30d3\u30eb\u30c9\u4e2d...
contractButNoFormTitle=\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u306f\u6301\u3064\u304c\u3001\u30d5\u30a9\u30fc\u30e0\u3092\u6301\u305f\u305a\u306b\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u308b\u30d7\u30ed\u30bb\u30b9
contractButNoFormMessage=\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u306f\u6301\u3064\u304c\u3001\u30d5\u30a9\u30fc\u30e0\u3092\u6301\u305f\u305a\u306b\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u308b {0} \u30d7\u30ed\u30bb\u30b9\u3002{1} \u306b\u30ea\u30c0\u30a4\u30ec\u30af\u30c8\u3055\u308c\u307e\u3059\u3002
resetingEngineFailed=\u30a8\u30f3\u30b8\u30f3 \u30ea\u30bb\u30c3\u30c8\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
resetEngine=\u30a8\u30f3\u30b8\u30f3\u3092\u518d\u8d77\u52d5
resetEngineSuccess=\u30c7\u30d7\u30ed\u30a4\u6e08\u307f\u306e\u3059\u3079\u3066\u306e\u30d7\u30ed\u30bb\u30b9\u5b9a\u7fa9\u3068\u305d\u308c\u3089\u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\uff08\u5b8c\u4e86\u6e08\u307f\u3092\u542b\u3080\uff09\u306f\u3001\u6b63\u5e38\u306b\u524a\u9664\u3055\u308c\u307e\u3057\u305f\u3002
engineLazyLoad=\u30a8\u30f3\u30b8\u30f3\u30b5\u30fc\u30d0\u30fc\u3092\u9045\u5ef6\u8d77\u52d5\u3057\u307e\u3059
diagramDoesntExist=\u30c0\u30a4\u30a2\u30b0\u30e9\u30e0 %s \u306f\u5b58\u5728\u3057\u307e\u305b\u3093\u3002
deploymentFailed=\u30d7\u30ed\u30bb\u30b9\u306e\u30c7\u30d7\u30ed\u30a4\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f
deployDoneTitle=\u30c7\u30d7\u30ed\u30a4\u306b\u6210\u529f\u3057\u307e\u3057\u305f
deployDoneMessage=\u30d7\u30ed\u30bb\u30b9\u306f\u6b63\u5e38\u306b\u30c7\u30d7\u30ed\u30a4\u3055\u308c\u307e\u3057\u305f
deployFailedMessage='%s' \u3092\u30c7\u30d7\u30ed\u30a4\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
deploySuccessMessage='%s' %s \u304c\u30c7\u30d7\u30ed\u30a4\u3055\u308c\u307e\u3057\u305f
deployingPage=\u30da\u30fc\u30b8 %s \u3092\u30c7\u30d7\u30ed\u30a4\u3057\u3066\u3044\u307e\u3059...
deployFailedTitle=\u30c7\u30d7\u30ed\u30a4\u306b\u5931\u6557\u3057\u307e\u3057\u305f
tomcatXmxOption=Tomcat \u6700\u5927\u30e1\u30e2\u30ea\u5272\u308a\u5f53\u3066 (Mb)
restartServer=\u30b5\u30fc\u30d0\u30fc\u3092\u518d\u8d77\u52d5
restartServerConfirmationMsg=\u30a2\u30c3\u30d7\u30c7\u30fc\u30c8\u3092\u9069\u7528\u3059\u308b\u306b\u306f\u30b5\u30fc\u30d0\u30fc\u3092\u518d\u8d77\u52d5\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002\n\u4eca\u3059\u3050\u518d\u8d77\u52d5\u3057\u307e\u3059\u304b\uff1f
tomcatExtraParams=Tomcat JVM \u306e\u8ffd\u52a0\u5f15\u6570
noProcessToRunTitle=\u30d7\u30ed\u30bb\u30b9\u304c\u9078\u629e\u3055\u308c\u3066\u3044\u307e\u305b\u3093
noProcessToRun=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u30a8\u30af\u30b9\u30d7\u30ed\u30fc\u30e9\u307e\u305f\u306f\u30c0\u30a4\u30a2\u30b0\u30e9\u30e0\u3067\u5b9f\u884c\u3059\u308b\u30d7\u30ed\u30bb\u30b9\u3092\u9078\u629e\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
buildDoneTitle=\u30d3\u30eb\u30c9
buildDoneMessage=\u30d7\u30ed\u30bb\u30b9 %s \u304c %s \u3067\u6b63\u5e38\u306b\u30d3\u30eb\u30c9\u3055\u308c\u307e\u3057\u305f\u3002
buildFailedTitle=\u30d3\u30eb\u30c9\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
startingEngineServer=\u30a8\u30f3\u30b8\u30f3\u30b5\u30fc\u30d0\u30fc\u3092\u8d77\u52d5\u3057\u3066\u3044\u307e\u3059...
deployingProcessesFrom=%s \u304b\u3089\u306e\u3059\u3079\u3066\u306e\u30d7\u30ed\u30bb\u30b9\u3092\u30c7\u30d7\u30ed\u30a4\u3057\u3066\u3044\u307e\u3059...
restartServerMsg=\u30d0\u30c3\u30af\u30b0\u30e9\u30a6\u30f3\u30c9\u3067\u30a8\u30f3\u30b8\u30f3 \u30b5\u30fc\u30d0\u30fc\u3092\u518d\u8d77\u52d5\u3057\u307e\u3059\u3002\u30b5\u30fc\u30d0\u30fc\u306e\u518d\u8d77\u52d5\u6642\u306b\u30a8\u30f3\u30b8\u30f3 \u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u3092\u524a\u9664\u3059\u308b\u3053\u3068\u3082\u3067\u304d\u307e\u3059\u3002 \u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u3092\u6700\u521d\u304b\u3089\u518d\u4f5c\u6210\u3057\u307e\u3059\u3002\u5b9f\u884c\u4e2d\u304a\u3088\u3073\u30a2\u30fc\u30ab\u30a4\u30d6\u3055\u308c\u305f\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306f\u3059\u3079\u3066\u5931\u308f\u308c\u307e\u3059\u3002\u30d3\u30b8\u30cd\u30b9 \u30c7\u30fc\u30bf \u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306f\u30d7\u30ed\u30bb\u30b9\u3067\u524a\u9664\u3055\u308c\u307e\u305b\u3093\u3002
dropEngineDatabase=\u30a8\u30f3\u30b8\u30f3\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u3092\u30c9\u30ed\u30c3\u30d7
uidExtraParams=UI Designer JVM options
missingRestAPIStatus='%s' \u306f %s API \u62e1\u5f35\u304c\u5fc5\u8981\u3067\u3059\u3002\u5bfe\u5fdc\u3059\u308b REST API \u62e1\u5f35\u3092\u6700\u521d\u306b\u30c7\u30d7\u30ed\u30a4\u3057\u3066\u304f\u3060\u3055\u3044\u3002
debugCustomPageMode=\u30ab\u30b9\u30bf\u30e0\u30da\u30fc\u30b8 \u30c7\u30d0\u30c3\u30b0\u30e2\u30fc\u30c9
debugCustomPageModeHint=\u6709\u52b9\u306b\u3059\u308b\u3068\u3001\u30ab\u30b9\u30bf\u30e0\u30da\u30fc\u30b8\u306e\u30af\u30e9\u30b9\u30ed\u30fc\u30c0\u30fc\u306fcall\u3054\u3068\u306b\u518d\u69cb\u7bc9\u3055\u308c\u307e\u3059\u3002 \u30ad\u30e3\u30c3\u30b7\u30e5\u30d5\u30a9\u30eb\u30c0\u304b\u3089\u76f4\u63a5\u30ab\u30b9\u30bf\u30e0\u30da\u30fc\u30b8\u30bd\u30fc\u30b9\u3092\u66f4\u65b0\u3059\u308b\u5834\u5408\u306b\u4fbf\u5229\u3067\u3059 (<tomcat_folder>/server/temp/bonita_portal_<id>@hostname/tenants/<id>/pages/<custompage_folder>)
deployWithWarningMessage=\u30d7\u30ed\u30bb\u30b9\u306f\u6b63\u5e38\u306b\u30c7\u30d7\u30ed\u30a4\u3055\u308c\u307e\u3057\u305f\u304c\u3001\u3044\u304f\u3064\u304b\u306e\u8b66\u544a\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
additionalResourceProjectPathNotSet=%s (%s)\u30d3\u30eb\u30c9\u30a8\u30e9\u30fc\uff1a  '%s'\u8ffd\u52a0\u30ea\u30bd\u30fc\u30b9\u306b\u30d5\u30a1\u30a4\u30eb\u304c\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
additionalResourceFileNotFound=%s (%s) \u30d3\u30eb\u30c9\u30a8\u30e9\u30fc\uff1a\u30d5\u30a1\u30a4\u30eb '%s' \u306f '%s' \u8ffd\u52a0\u30ea\u30bd\u30fc\u30b9\u306b\u5b58\u5728\u3057\u307e\u305b\u3093\u3002
restartServerNotificationTitle=Bonita \u30b5\u30fc\u30d0\u30fc\u3092\u518d\u8d77\u52d5\u4e2d
restartServerNotificationMessage=Bonita \u30b5\u30fc\u30d0\u30fc\u3092\u518d\u8d77\u52d5\u3057\u3066\u3044\u307e\u3059\u3002\n\u4e00\u90e8\u306e\u6a5f\u80fd\uff08Bonita \u30dd\u30fc\u30bf\u30eb\u3001Bonita REST API\u306a\u3069\uff09\u306f\u3001\u30b5\u30fc\u30d0\u30fc\u304c\u5b9f\u884c\u3055\u308c\u3066\u3044\u306a\u3044\u9593\u306f\u4f7f\u7528\u3067\u304d\u307e\u305b\u3093\u3002
restartServerCompletedNotificationTitle=Bonita \u30b5\u30fc\u30d0\u30fc\u3092\u518d\u8d77\u52d5\u3057\u307e\u3057\u305f
serverRunningNotificationMessage=Bonita \u30b5\u30fc\u30d0\u30fc\u304c\u5b9f\u884c\u3055\u308c\u3066\u304a\u308a\u5168\u3066\u306e\u6a5f\u80fd\u304c\u5229\u7528\u53ef\u80fd\u3067\u3059\u3002
startServerNotificationTitle=Bonita \u30b5\u30fc\u30d0\u30fc\u3092\u8d77\u52d5\u3057\u3066\u3044\u307e\u3059
startServerCompletedNotificationTitle=Bonita \u30b5\u30fc\u30d0\u30fc\u3092\u8d77\u52d5\u3057\u307e\u3057\u305f
engineLazyModeNotificationLink=Bonita \u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u958b\u304f\u6642\u3001Bonita \u30b5\u30fc\u30d0\u30fc\u306f\u81ea\u52d5\u7684\u306b\u958b\u59cb\u3055\u308c\u308b\u3088\u3046\u306b\u69cb\u6210\u3055\u308c\u3066\u3044\u307e\u3059\u3002\n\u3053\u306e\u52d5\u4f5c\u306f <a>\u74b0\u5883\u8a2d\u5b9a</a> \u3067\u66f4\u65b0\u3067\u304d\u307e\u3059\u3002
none=\uff1c\u306a\u3057\uff1e
configuration=\u69cb\u6210\u8a2d\u5b9a
invalidConfigurationForEnv=%s \u74b0\u5883\u306b\u304a\u3044\u3066\u4e0d\u6b63\u306a\u30d7\u30ed\u30bb\u30b9\u8a2d\u5b9a\u304c\u898b\u3064\u304b\u308a\u307e\u3057\u305f