testButtonLabel=Evaluer
functionDocTitle=Documentation
functionTitle=Fonctions
categoriesTitle=Cat\u00e9gories
noProcessVariableAvailable=Aucune variable disponible
selectData=S\u00e9lectionner...
groovyDocumentationLink=Guide d'utilisation Groovy
browseJava=Parcourir votre Objet Java
scriptEvaluation=\u00c9valuation du script...
returnType=Type de retour
add=Ajouter...
remove=Supprimer
automaticResolution=R\u00e9solution automatique des d\u00e9pendances
unknownVariableLabel=Variables inconnues
processVariableLabel=Variables de processus
groovyUnresolved=Ne peut pas \u00eatre r\u00e9solu. \u00c7a peut conduire \u00e0 des erreurs d'ex\u00e9cution.
evaluationResults=\u00c9valuation des r\u00e9sultats
testGroovyScriptDialogDescription=Pour chaque variable ci-dessous une valeur est n\u00e9cessaire afin d'\u00e9valuer le script groovy.
nameHelp=Le nom du script correspond \u00e0 la classe Groovy qui le contient, voir la documentation Groovy pour plus d'informations.
warningAssigningAVariableWithSameNameAsProcessVariable={0} est une donn\u00e9e de processus; il est recommand\u00e9 de ne pas la surcharger dans un script.
maxScriptLengthTitle=Longueur maximale du script
maxScriptLength=La longueur maximale d'un script groovy dans Bonita Studio est de 64 ko.\nLa limite est atteinte, donc les caract\u00e8res suppl\u00e9mentaires ne seront pas enregistr\u00e9s.\nNous vous sugg\u00e9rons de fractionner votre logique m\u00e9tier en plusieurs scripts.
onlyReadOnly=\u26a0 Dans les scripts Groovy, les API de Bonita doivent uniquement \u00eatre utilis\u00e9es pour faire des <a>appels en lecture seule</a>.
createNewGroovyFile=Cr\u00e9ez une nouvelle classe Groovy
open=Ouvrir
openExistingGroovyScript=Ouvrir les scripts Groovy existants
openExistingGroovyScriptDescription=Ouvrez les scripts Groovy existants et \u00e9ditez-les avec un \u00e9diteur Groovy.
deleteExistingGroovyScript=Supprimer des scripts Groovy existants
deleteExistingGroovyScriptDescription=Supprimer les scripts Groovy existants de votre d\u00e9p\u00f4t local.
search=Rechercher
noDescription=Aucune description disponible
codeTemplates=Mod\u00e8les de code
usersTemplates=Utilisateurs Bonita
userDefined=Personnalis\u00e9
businessQueries=Requ\u00eates m\u00e9tiers
documents=Documents
stepVariables=Variable de t\u00e2che
processVariables=Variables de processus
businessVariables=Variables m\u00e9tier
executionContext=Contexte d'ex\u00e9cution
parameterCategoryDescription=Les param\u00e8tres sont d\u00e9finis au niveau du processus et peuvent \u00eatre valoris\u00e9s par environnement.
contractInputCategoryDescription=Les entr\u00e9es de contrat sont les entr\u00e9es requises d\u00e9finis sur un processus ou une t\u00e2che humaine n\u00e9cessaire \u00e0 leur ex\u00e9cution.
connectorOutputCategoryDescription=D\u00e9fini dans la d\u00e9finition du connecteur, une sortie de connecteur est une donn\u00e9e produite par l'ex\u00e9cution d'un connecteur.
stepVariablesCategoryDescription=Les variables d\u00e9finies au niveau des \u00e9tapes. Leur port\u00e9e est limit\u00e9e \u00e0 cette \u00e9tape.
processVariablesCategoryDescription=Les variables d\u00e9finies au niveau du processus. Elles ont une port\u00e9e de processus et peuvent \u00eatre utilis\u00e9es dans toutes les expressions du processus. 
businessVariablesCategoryDescription=Variables d\u00e9finies au niveau du processus. Elles ont une port\u00e9e de processus et peuvent \u00eatre utilis\u00e9es dans toutes les expressions du processus. Contrairement aux variables de processus, les variables m\u00e9tier sont stock\u00e9es dans leur propre base de donn\u00e9es et peuvent \u00eatre partag\u00e9es entre plusieurs processus.
businessQueriesCategoryDescription=Chaque Objet M\u00e9tier d\u00e9fini dans le Mod\u00e8le de Donn\u00e9es M\u00e9tier peut \u00eatre interrog\u00e9 \u00e0 l'aide d'un Data Access Object g\u00e9n\u00e9r\u00e9 (DAO). Des requ\u00eates par d\u00e9faut sont g\u00e9n\u00e9r\u00e9es pour tous les objets m\u00e9tier, vous pouvez \u00e9galement d\u00e9finir des requ\u00eates personnalis\u00e9es dans l'\u00e9diteur du BDM.
documentsCategoryDescription=Les documents sont d\u00e9finis au niveau du processus, ils peuvent \u00eatre utilis\u00e9s pour stocker des donn\u00e9es binaires ou comme redirection vers un stockage de documents externe.
executionContextCategoryDescription=Le contexte d'ex\u00e9cution contient des variables pertinentes \u00e0 l'\u00e9tat actuel du syst\u00e8me lors de l'\u00e9valuation de cette expression.
codeTemplatesCategoryDescription=Les mod\u00e8les de code sont des blocs de code pr\u00e9d\u00e9finis qui fournissent une aide rapide pour d\u00e9velopper des expressions.
userDefinedCategoryDescription=Fonctions Groovy d\u00e9finies par l'utilisateur
usersTemplatesCategoryDescription=Mod\u00e8les de code mainpulant les utilisateurs Bonita
automaticResolutionHint=By default, all the expression dependencies are resolved automatically.\nIn case the automatic resolution doesn't complete successfully,\nyou can uncheck this property and add the missing dependencies manually.