testButtonLabel=Avaliar
functionDocTitle=Documenta\u00e7\u00e3o
functionTitle=Fun\u00e7\u00f5es
categoriesTitle=Categorias
noProcessVariableAvailable=Nenhuma vari\u00e1vel dispon\u00edvel
selectData=Selecionar...
groovyDocumentationLink=In\u00edcio r\u00e1pido com Groovy
browseJava=Percorrer o seu objeto Java
scriptEvaluation=Avalia\u00e7\u00e3o de script...
returnType=Tipo de retorno
add=Adicionar...
remove=Remover
automaticResolution=Resolu\u00e7\u00e3o autom\u00e1tica de depend\u00eancias
unknownVariableLabel=Vari\u00e1veis desconhecidas
processVariableLabel=Vari\u00e1veis de processo
groovyUnresolved=n\u00e3o pode ser resolvido. Pode levar a erros de tempo de execu\u00e7\u00e3o.
evaluationResults=Resultados da avalia\u00e7\u00e3o
testGroovyScriptDialogDescription=Para cada dado abaixo um valor \u00e9 necess\u00e1rio para avaliar o script groovy.
nameHelp=O nome do script corresponde \u00e0 classe de Groovy gerada que o cont\u00eam. consulte a documenta\u00e7\u00e3o Groovy para obter mais informa\u00e7\u00f5es.
warningAssigningAVariableWithSameNameAsProcessVariable={0} \u00e9 uma vari\u00e1vel de processo e n\u00e3o deve ser usada em uma instru\u00e7\u00e3o de declara\u00e7\u00e3o.
maxScriptLengthTitle=Tamanho m\u00e1ximo do script
maxScriptLength=O tamanho m\u00e1xima de um groovy script no Bonita Studio \u00e9 de 64 kilobytes.\nVoc\u00ea atingiu esse limite, os caracteres adicionais n\u00e3o ser\u00e3o salvos.\nSugerimos que voc\u00ea divida sua l\u00f3gica de neg\u00f3cios em v\u00e1rios scripts.
onlyReadOnly=\u26a0 A API do Bonita deve ser usada somente para <a>chamadas somente de leitura</a> em scripts grrovy.
createNewGroovyFile=Criar um novo arquivo Groovy
open=Abrir
openExistingGroovyScript=Abrir scripts Groovy existentes
openExistingGroovyScriptDescription=Abra scripts Groovy existentes e edite-os com um editor Groovy.
deleteExistingGroovyScript=Excluir scripts Groovy existentes
deleteExistingGroovyScriptDescription=Excluir scripts Groovy existentes do seu reposit\u00f3rio local.
search=Pesquisar
noDescription=Sem descri\u00e7\u00e3o
codeTemplates=Modelos de C\u00f3digo
usersTemplates=Usu\u00e1rios Bonita BPM
userDefined=Definidos pelo usu\u00e1rio
businessQueries=Consultas de Neg\u00f3cios
documents=Documentos
stepVariables=Vari\u00e1veis de Etapa
processVariables=Vari\u00e1veis de processo
businessVariables=Vari\u00e1veis de neg\u00f3cio
executionContext=Contexto de execu\u00e7\u00e3o
parameterCategoryDescription=Os par\u00e2metros s\u00e3o definidos no n\u00edvel do processo e podem ser valorizados para um determinado ambiente.
contractInputCategoryDescription=A entrada de contrato \u00e9 a entrada necess\u00e1ria definida em um processo ou uma tarefa humana necess\u00e1ria para a sua execu\u00e7\u00e3o.
connectorOutputCategoryDescription=Definido na defini\u00e7\u00e3o do conector, a sa\u00edda do conector s\u00e3o dados produzidos por uma execu\u00e7\u00e3o do conector.
stepVariablesCategoryDescription=Vari\u00e1veis definidas no n\u00edvel da etapa. Seu escopo est\u00e1 limitado este passo.
processVariablesCategoryDescription=Vari\u00e1veis definidas no n\u00edvel do processo. Eles t\u00eam um escopo do processo e podem ser usadas em todas as express\u00f5es do processo. 
businessVariablesCategoryDescription=Vari\u00e1veis definidas no n\u00edvel do processo. Eles t\u00eam um escopo do processo e podem ser usadas em todas as express\u00f5es do processo. Enquanto que as vari\u00e1veis do processo, as vari\u00e1veis de neg\u00f3cio s\u00e3o armazenadas em sua pr\u00f3pria base de dados e podem ser compartilhadas entre v\u00e1rios processos.
businessQueriesCategoryDescription=Cada objeto de neg\u00f3cio definido no Modelo de Dados de Neg\u00f3cio pode ser consultado usando um objeto gerado por Acesso de Dados (DAO). Consultas padr\u00e3o s\u00e3o geradas para todos os Objetos de Neg\u00f3cio, voc\u00ea tamb\u00e9m pode definir consultas personalizadas no editor BDM.
documentsCategoryDescription=Os documentos s\u00e3o definidos no n\u00edvel de processo, eles podem ser usados para armazenar dados bin\u00e1rios ou como um redirecionamento para um reposit\u00f3rio de documentos externos.
executionContextCategoryDescription=O contexto de execu\u00e7\u00e3o cont\u00e9m vari\u00e1veis que s\u00e3o relevantes para o estado atual do sistema ao avaliar esta express\u00e3o.
codeTemplatesCategoryDescription=Os modelos de c\u00f3digo s\u00e3o blocos de c\u00f3digo predefinidos que fornecem uma ajuda r\u00e1pida para o desenvolvimento de express\u00f5es.
userDefinedCategoryDescription=Fun\u00e7\u00f5es Groovy definidas pelo usu\u00e1rio
usersTemplatesCategoryDescription=Modelos de c\u00f3digo para usu\u00e1rios Bonita BPM
automaticResolutionHint=By default, all the expression dependencies are resolved automatically.\nIn case the automatic resolution doesn't complete successfully,\nyou can uncheck this property and add the missing dependencies manually.