testButtonLabel=Evaluar
functionDocTitle=Documentaci\u00f3n
functionTitle=Funciones
categoriesTitle=Categor\u00edas
noProcessVariableAvailable=Ninguna variable disponible
selectData=Seleccionar...
groovyDocumentationLink=Inicio r\u00e1pido con Groovy
browseJava=Buscar sus objetos Java
scriptEvaluation=Evaluaci\u00f3n de la secuencia de comandos...
returnType=tipo de retorno
add=Agregar...
remove=Eliminar
automaticResolution=Resoluci\u00f3n autom\u00e1tica de dependencias
unknownVariableLabel=Variables desconocidas
processVariableLabel=Variables de proceso
groovyUnresolved=no se puede resolver. Puede conducir a errores de tiempo de ejecuci\u00f3n.
evaluationResults=Evaluacion de resultados
testGroovyScriptDialogDescription=Para esto se necesita cada dato por debajo de un valor con el fin de evaluar groovy script.
nameHelp=El nombre de la secuencia corresponde a la clase Groovy generado que encierra, consulte la documentaci\u00f3n Groovy para m\u00e1s informaci\u00f3n.
warningAssigningAVariableWithSameNameAsProcessVariable={0} es una variable de proceso y no debe utilizarse en una declaraci\u00f3n.
maxScriptLengthTitle=M\u00e1xima longitud del script
maxScriptLength=La longitud m\u00e1xima para un script groovy en Bonita Studio es 64 kilobytes. Se a alcanzado este l\u00edmite, los caracteres adicionales no se guardar\u00e1n. Sugerimos dividir la l\u00f3gica de negocio en varios scripts.
onlyReadOnly=Bonita API solo se debe utilizar para <a> llamadas de s\u00f3lo lectura</a>en los scripts de groovy.
createNewGroovyFile=Crear un nueva clase Groovy
open=Abrir
openExistingGroovyScript=Abrir scripts Groovy existentes
openExistingGroovyScriptDescription=Abre los scripts Groovy existentes y editalos con un editor Groovy.
deleteExistingGroovyScript=Eliminar scripts Groovy existentes
deleteExistingGroovyScriptDescription=Eliminar scripts Groovy existentes de su repositorio local.
search=Buscar
noDescription=No hay descripci\u00f3n
codeTemplates=Plantillas de c\u00f3digo
usersTemplates=Usuarios de Bonita
userDefined=Definidas por el Usuario
businessQueries=Consultas de Negocio
documents=Documentos
stepVariables=Variables de tarea
processVariables=Variables de proceso
businessVariables=Variables de negocio
executionContext=Contexto de ejecuci\u00f3n
parameterCategoryDescription=Los par\u00e1metros se definen a nivel de proceso y se pueden valorar para un entorno determinado.
contractInputCategoryDescription=La entrada del contrato es la entrada requerida definida en un proceso o una tarea humana necesaria para su ejecuci\u00f3n.
connectorOutputCategoryDescription=Definida en la definici\u00f3n del conector, la salida del conector son datos producidos por una ejecuci\u00f3n del conector.
stepVariablesCategoryDescription=Variables definidas a nivel de tarea. Su alcance est\u00e1 limitado a esta tarea.
processVariablesCategoryDescription=Variables definidas a nivel de proceso; tienen un \u00e1mbito de proceso y pueden ser utilizadas en todas las expresiones del proceso. 
businessVariablesCategoryDescription=Variables definidas a nivel de proceso; tienen un \u00e1mbito de proceso y pueden ser utilizadas en todas las expresiones del proceso. A diferencia de las variables de proceso, las variables de negocio se almacenan en su propia base de datos y se pueden compartir a trav\u00e9s de m\u00faltiples procesos.
businessQueriesCategoryDescription=Cada Objeto de Negocio definido en el Modelo de Datos de Negocio puede ser consultado usando un Objeto de Acceso de Datos generado (DAO). Las consultas predeterminadas se generan para todos los Objetos de Negocio, tambi\u00e9n puede definir consultas personalizadas en el editor BDM.
documentsCategoryDescription=Los documentos se definen a nivel de proceso, se pueden utilizar para almacenar datos binarios o como redirecci\u00f3n a un almac\u00e9n de documentos externo.
executionContextCategoryDescription=El contexto de ejecuci\u00f3n contiene variables que son relevantes al estado actual del sistema al evaluar esta expresi\u00f3n.
codeTemplatesCategoryDescription=Las plantillas de c\u00f3digo son bloques de c\u00f3digo predefinidos que proporcionan una ayuda r\u00e1pida para desarrollar expresiones.
userDefinedCategoryDescription=Funciones Groovy definidas por el usuario
usersTemplatesCategoryDescription=Plantillas de c\u00f3digo de usuarios Bonita
automaticResolutionHint=Por defecto, todas las dependencias de expresiones se resuelven autom\u00e1ticamente.\nEn caso de que la resoluci\u00f3n autom\u00e1tica no se complete con \u00e9xito,\npuede desmarcar esta propiedad y a\u00f1adir manualmente las dependencias que faltan.