testButtonLabel=\u30c6\u30b9\u30c8
functionDocTitle=\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8
functionTitle=\u95a2\u6570
categoriesTitle=\u30ab\u30c6\u30b4\u30ea
noProcessVariableAvailable=\u5909\u6570\u304c\u3042\u308a\u307e\u305b\u3093
selectData=\u9078\u629e...
groovyDocumentationLink=Groovy\u30af\u30a4\u30c3\u30af\u30b9\u30bf\u30fc\u30c8
browseJava=\u3042\u306a\u305f\u306eJava\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3092\u53c2\u7167
scriptEvaluation=\u30b9\u30af\u30ea\u30d7\u30c8\u306e\u30c6\u30b9\u30c8...
returnType=\u623b\u308a\u5024\u306e\u578b
add=\u8ffd\u52a0...
remove=\u524a\u9664
automaticResolution=\u4f9d\u5b58\u95a2\u4fc2\u3092\u81ea\u52d5\u89e3\u6c7a
unknownVariableLabel=\u672a\u77e5\u306e\u5909\u6570
processVariableLabel=\u30d7\u30fc\u30eb\u5909\u6570
groovyUnresolved=\u304c\u89e3\u6c7a\u3067\u304d\u3066\u3044\u307e\u305b\u3093\u3002\u30e9\u30f3\u30bf\u30a4\u30e0 \u30a8\u30e9\u30fc\u306b\u3064\u306a\u304c\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
evaluationResults=\u30c6\u30b9\u30c8\u7d50\u679c
testGroovyScriptDialogDescription=Groovy\u30b9\u30af\u30ea\u30d7\u30c8\u3092\u30c6\u30b9\u30c8\u3059\u308b\u305f\u3081\u306b\u306f\u3001\u4ee5\u4e0b\u306e\u30c7\u30fc\u30bf\u306e\u5024\u304c\u5fc5\u8981\u3067\u3059
nameHelp=\u30b9\u30af\u30ea\u30d7\u30c8\u540d\u306f\u3001\u305d\u308c\u3092\u5185\u5305\u3057\u305f\u751f\u6210\u6e08\u307f\u306eGroovy\u30af\u30e9\u30b9\u306b\u5bfe\u5fdc\u3057\u307e\u3059\u3002\u3088\u308a\u8a73\u3057\u3044\u60c5\u5831\u306b\u3064\u3044\u3066\u306f\u3001Groovy\u306e\u30de\u30cb\u30e5\u30a2\u30eb\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
warningAssigningAVariableWithSameNameAsProcessVariable={0} \u306f\u3001\u30d7\u30ed\u30bb\u30b9\u5909\u6570\u3067\u3042\u308b\u306e\u3067\u3001\u5ba3\u8a00\u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u3067\u306f\u4f7f\u7528\u3057\u306a\u3044\u3067\u304f\u3060\u3055\u3044\u3002
maxScriptLengthTitle=\u30b9\u30af\u30ea\u30d7\u30c8\u306e\u6700\u5927\u9577
maxScriptLength=Bonita Studio \u3067\u306e groovy \u30b9\u30af\u30ea\u30d7\u30c8\u306e\u6700\u5927\u9577\u306f\u300164 \u30ad\u30ed\u30d0\u30a4\u30c8\u3067\u3059\u3002\n\u3053\u306e\u5236\u9650\u306b\u9054\u3057\u305f\u5834\u5408\u306f\u3001\u8ffd\u52a0\u306e\u6587\u5b57\u306f\u4fdd\u5b58\u3055\u308c\u307e\u305b\u3093\u3002\n\u30d3\u30b8\u30cd\u30b9 \u30ed\u30b8\u30c3\u30af\u3092\u3044\u304f\u3064\u304b\u306e\u30b9\u30af\u30ea\u30d7\u30c8\u306b\u5206\u5272\u3059\u308b\u3053\u3068\u3092\u304a\u52e7\u3081\u3057\u307e\u3059\u3002
onlyReadOnly=\u26a0 Bonita API should only be used for <a>read only calls</a> in groovy scripts.
createNewGroovyFile=Create a new Groovy file
open=\u958b\u304f
openExistingGroovyScript=Open existing Groovy scripts
openExistingGroovyScriptDescription=Open existing Groovy scripts and edit them with a Groovy editor.
deleteExistingGroovyScript=Delete existing Groovy scripts
deleteExistingGroovyScriptDescription=Delete existing Groovy scripts from your local repository.
search=Search
noDescription=No description
codeTemplates=Code Templates
usersTemplates=Bonita Users
userDefined=User Defined
businessQueries=Business Queries
documents=Documents
stepVariables=Step Variables
processVariables=Process Variables
businessVariables=Business Variables
executionContext=Execution Context
parameterCategoryDescription=Parameters are defined at process level and can be valued for a given environment.
contractInputCategoryDescription=Contract input are the required input defined on a process or a human task needed for their execution.
connectorOutputCategoryDescription=Defined in the connector definition, connector output are data produced by a connector execution.
stepVariablesCategoryDescription=Variables defined at step level. Their scope is limited this step.
processVariablesCategoryDescription=Variables defined at process level. They have a process scope and can be used in all the expressions of the process. 
businessVariablesCategoryDescription=Variables defined at process level. They have a process scope and can be used in all the expressions of the process. Whereas the process variables, business variables are stored in their own database and can be shared across multiple processes.
businessQueriesCategoryDescription=Each Business Object defined in the Business Data Model can be queried using a generated Data Access Object (DAO). Default queries are generated for all Business Objects, you can also defined custom queries in the BDM editor.
documentsCategoryDescription=Documents are defined at process level, they can be used to store binary data or as a redirection to an external document store.
executionContextCategoryDescription=The execution context contains variables that are relevant to the current state of the system when evaluating this expression.
codeTemplatesCategoryDescription=Code templates are predefined code blocks that provide a quick assist to develop expressions.
userDefinedCategoryDescription=User defined Groovy functions
usersTemplatesCategoryDescription=Bonita users code templates
automaticResolutionHint=By default, all the expression dependencies are resolved automatically.\nIn case the automatic resolution doesn't complete successfully,\nyou can uncheck this property and add the missing dependencies manually.