testButtonLabel=\u30c6\u30b9\u30c8
functionDocTitle=\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8
functionTitle=\u95a2\u6570
categoriesTitle=\u30ab\u30c6\u30b4\u30ea
noProcessVariableAvailable=\u5909\u6570\u304c\u3042\u308a\u307e\u305b\u3093
selectData=\u9078\u629e...
groovyDocumentationLink=Groovy\u30af\u30a4\u30c3\u30af\u30b9\u30bf\u30fc\u30c8
browseJava=\u3042\u306a\u305f\u306eJava\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3092\u53c2\u7167
scriptEvaluation=\u30b9\u30af\u30ea\u30d7\u30c8\u306e\u30c6\u30b9\u30c8...
returnType=\u623b\u308a\u5024\u306e\u578b
add=\u8ffd\u52a0...
remove=\u524a\u9664
automaticResolution=\u4f9d\u5b58\u95a2\u4fc2\u3092\u81ea\u52d5\u89e3\u6c7a
unknownVariableLabel=\u672a\u77e5\u306e\u5909\u6570
processVariableLabel=\u30d7\u30fc\u30eb\u5909\u6570
groovyUnresolved=\u304c\u89e3\u6c7a\u3067\u304d\u3066\u3044\u307e\u305b\u3093\u3002\u30e9\u30f3\u30bf\u30a4\u30e0 \u30a8\u30e9\u30fc\u306b\u3064\u306a\u304c\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
evaluationResults=\u30c6\u30b9\u30c8\u7d50\u679c
testGroovyScriptDialogDescription=Groovy\u30b9\u30af\u30ea\u30d7\u30c8\u3092\u30c6\u30b9\u30c8\u3059\u308b\u305f\u3081\u306b\u306f\u3001\u4ee5\u4e0b\u306e\u30c7\u30fc\u30bf\u306e\u5024\u304c\u5fc5\u8981\u3067\u3059
nameHelp=\u30b9\u30af\u30ea\u30d7\u30c8\u540d\u306f\u3001\u305d\u308c\u3092\u5185\u5305\u3057\u305f\u751f\u6210\u6e08\u307f\u306eGroovy\u30af\u30e9\u30b9\u306b\u5bfe\u5fdc\u3057\u307e\u3059\u3002\u3088\u308a\u8a73\u3057\u3044\u60c5\u5831\u306b\u3064\u3044\u3066\u306f\u3001Groovy\u306e\u30de\u30cb\u30e5\u30a2\u30eb\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
warningAssigningAVariableWithSameNameAsProcessVariable={0} \u306f\u3001\u30d7\u30ed\u30bb\u30b9\u5909\u6570\u3067\u3042\u308b\u306e\u3067\u3001\u5ba3\u8a00\u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u3067\u306f\u4f7f\u7528\u3057\u306a\u3044\u3067\u304f\u3060\u3055\u3044\u3002
maxScriptLengthTitle=\u30b9\u30af\u30ea\u30d7\u30c8\u306e\u6700\u5927\u9577
maxScriptLength=Bonita Studio \u3067\u306e groovy \u30b9\u30af\u30ea\u30d7\u30c8\u306e\u6700\u5927\u9577\u306f\u300164 \u30ad\u30ed\u30d0\u30a4\u30c8\u3067\u3059\u3002\n\u3053\u306e\u5236\u9650\u306b\u9054\u3057\u305f\u5834\u5408\u306f\u3001\u8ffd\u52a0\u306e\u6587\u5b57\u306f\u4fdd\u5b58\u3055\u308c\u307e\u305b\u3093\u3002\n\u30d3\u30b8\u30cd\u30b9 \u30ed\u30b8\u30c3\u30af\u3092\u3044\u304f\u3064\u304b\u306e\u30b9\u30af\u30ea\u30d7\u30c8\u306b\u5206\u5272\u3059\u308b\u3053\u3068\u3092\u304a\u52e7\u3081\u3057\u307e\u3059\u3002
onlyReadOnly=\u26a0 Bonita API \u306f\u3001Groovy \u30b9\u30af\u30ea\u30d7\u30c8\u306e <a>\u8aad\u307f\u53d6\u308a\u5c02\u7528call</a> \u306b\u4f7f\u7528\u3055\u308c\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093\u3002
createNewGroovyFile=Create a new Groovy file
open=\u958b\u304f
openExistingGroovyScript=\u65e2\u5b58\u306eGroovy\u30b9\u30af\u30ea\u30d7\u30c8\u3092\u958b\u304f
openExistingGroovyScriptDescription=\u65e2\u5b58\u306eGroovy\u30b9\u30af\u30ea\u30d7\u30c8\u3092\u958b\u304d\u3001Groovy\u30a8\u30c7\u30a3\u30bf\u3067\u7de8\u96c6\u3057\u307e\u3059\u3002
deleteExistingGroovyScript=\u65e2\u5b58\u306eGroovy\u30b9\u30af\u30ea\u30d7\u30c8\u3092\u524a\u9664
deleteExistingGroovyScriptDescription=\u30ed\u30fc\u30ab\u30eb\u30ea\u30dd\u30b8\u30c8\u30ea\u304b\u3089\u65e2\u5b58\u306e Groovy \u30b9\u30af\u30ea\u30d7\u30c8\u3092\u524a\u9664\u3057\u307e\u3059\u3002
search=\u691c\u7d22
noDescription=\u8aac\u660e\u304c\u3042\u308a\u307e\u305b\u3093
codeTemplates=\u30b3\u30fc\u30c9\u30fb\u30c6\u30f3\u30d7\u30ec\u30fc\u30c8
usersTemplates=Bonita \u30e6\u30fc\u30b6\u30fc
userDefined=\u30e6\u30fc\u30b6\u30fc\u5b9a\u7fa9
businessQueries=\u30d3\u30b8\u30cd\u30b9 \u30af\u30a8\u30ea
documents=\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8
stepVariables=\u30b9\u30c6\u30c3\u30d7\u5909\u6570
processVariables=\u30d7\u30ed\u30bb\u30b9\u5909\u6570
businessVariables=\u30d3\u30b8\u30cd\u30b9\u5909\u6570
executionContext=\u5b9f\u884c\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8
parameterCategoryDescription=\u30d1\u30e9\u30e1\u30fc\u30bf\u306f\u30d7\u30ed\u30bb\u30b9\u30ec\u30d9\u30eb\u3067\u5b9a\u7fa9\u3055\u308c\u3001\u4e0e\u3048\u3089\u308c\u305f\u74b0\u5883\u3067\u8a55\u4fa1\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002
contractInputCategoryDescription=\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u5165\u529b\u306b\u306f\u30d7\u30ed\u30bb\u30b9\u3067\u5b9a\u7fa9\u3055\u308c\u305f\u5165\u529b\u3001\u307e\u305f\u306f\u305d\u308c\u3089\u306e\u5b9f\u884c\u306b\u5fc5\u8981\u306a\u30d2\u30e5\u30fc\u30de\u30f3\u30bf\u30b9\u30af\u304c\u5fc5\u8981\u3067\u3059\u3002
connectorOutputCategoryDescription=\u30b3\u30cd\u30af\u30bf\u5b9a\u7fa9\u3067\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u308b\u30b3\u30cd\u30af\u30bf\u51fa\u529b\u306f\u3001\u30b3\u30cd\u30af\u30bf\u306e\u5b9f\u884c\u306b\u3088\u3063\u3066\u751f\u6210\u3055\u308c\u308b\u30c7\u30fc\u30bf\u3067\u3059\u3002
stepVariablesCategoryDescription=\u30b9\u30c6\u30c3\u30d7\u30ec\u30d9\u30eb\u3067\u5b9a\u7fa9\u3055\u308c\u305f\u5909\u6570\u3002\u30b9\u30b3\u30fc\u30d7\u306f\u3053\u306e\u30b9\u30c6\u30c3\u30d7\u306b\u9650\u5b9a\u3055\u308c\u3066\u3044\u307e\u3059\u3002
processVariablesCategoryDescription=\u30d7\u30ed\u30bb\u30b9 \u30ec\u30d9\u30eb\u3067\u5b9a\u7fa9\u3055\u308c\u305f\u5909\u6570\u3002\u30d7\u30ed\u30bb\u30b9\u306e\u30b9\u30b3\u30fc\u30d7\u3092\u6301\u3061\u30d7\u30ed\u30bb\u30b9\u306e\u3059\u3079\u3066\u306e\u5f0f\u3067\u4f7f\u7528\u3067\u304d\u307e\u3059\u3002 
businessVariablesCategoryDescription=\u30d7\u30ed\u30bb\u30b9 \u30ec\u30d9\u30eb\u3067\u5b9a\u7fa9\u3055\u308c\u305f\u5909\u6570\u3002\u305d\u308c\u3089\u306f\u30d7\u30ed\u30bb\u30b9\u306e\u30b9\u30b3\u30fc\u30d7\u3092\u6301\u3061\u3001\u30d7\u30ed\u30bb\u30b9\u306e\u5168\u3066\u306e\u5f0f\u3067\u4f7f\u7528\u3067\u304d\u307e\u3059\u3002 \u30d7\u30ed\u30bb\u30b9\u5909\u6570\u306b\u5bfe\u3057\u3066\u3001\u30d3\u30b8\u30cd\u30b9\u5909\u6570\u306f\u72ec\u81ea\u306e\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306b\u683c\u7d0d\u3055\u308c\u8907\u6570\u306e\u30d7\u30ed\u30bb\u30b9\u3067\u5171\u6709\u3067\u304d\u307e\u3059\u3002
businessQueriesCategoryDescription=\u30d3\u30b8\u30cd\u30b9 \u30c7\u30fc\u30bf \u30e2\u30c7\u30eb\u3067\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u308b\u5404\u30d3\u30b8\u30cd\u30b9 \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306f\u3001\u751f\u6210\u3055\u308c\u305f\u30c7\u30fc\u30bf \u30a2\u30af\u30bb\u30b9 \u30aa\u30d6\u30b8\u30a7\u30af\u30c8 (DAO) \u3092\u4f7f\u7528\u3057\u3066\u7167\u4f1a\u3067\u304d\u307e\u3059\u3002 \u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u30af\u30a8\u30ea\u306f\u3059\u3079\u3066\u306e\u30d3\u30b8\u30cd\u30b9 \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306b\u5bfe\u3057\u3066\u751f\u6210\u3055\u308c\u3001BDM \u30a8\u30c7\u30a3\u30bf\u30fc\u3067\u30ab\u30b9\u30bf\u30e0\u30af\u30a8\u30ea\u3092\u5b9a\u7fa9\u3059\u308b\u3053\u3068\u3082\u3067\u304d\u307e\u3059\u3002
documentsCategoryDescription=\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8\u306f\u30d7\u30ed\u30bb\u30b9 \u30ec\u30d9\u30eb\u3067\u5b9a\u7fa9\u3055\u308c\u3001\u30d0\u30a4\u30ca\u30ea\u30c7\u30fc\u30bf\u3092\u4fdd\u5b58\u3057\u305f\u308a\u3001\u5916\u90e8\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8\u30b9\u30c8\u30a2\u3078\u306e\u30ea\u30c0\u30a4\u30ec\u30af\u30c8\u3068\u3057\u3066\u4f7f\u7528\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002
executionContextCategoryDescription=\u5b9f\u884c\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u306b\u306f\u3001\u3053\u306e\u5f0f\u3092\u8a55\u4fa1\u3059\u308b\u969b\u306b\u30b7\u30b9\u30c6\u30e0\u306e\u73fe\u5728\u306e\u72b6\u614b\u306b\u95a2\u9023\u3059\u308b\u5909\u6570\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002
codeTemplatesCategoryDescription=\u30b3\u30fc\u30c9\u30c6\u30f3\u30d7\u30ec\u30fc\u30c8\u306f\u5b9a\u7fa9\u6e08\u307f\u306e\u30b3\u30fc\u30c9\u30d6\u30ed\u30c3\u30af\u3067\u3001\u5f0f\u306e\u958b\u767a\u3092\u8fc5\u901f\u306b\u652f\u63f4\u3057\u307e\u3059\u3002
userDefinedCategoryDescription=\u30e6\u30fc\u30b6\u30fc\u5b9a\u7fa9\u306eGroovy\u95a2\u6570
usersTemplatesCategoryDescription=Bonita \u30e6\u30fc\u30b6\u30fc \u30b3\u30fc\u30c9 \u30c6\u30f3\u30d7\u30ec\u30fc\u30c8
automaticResolutionHint=By default, all the expression dependencies are resolved automatically.\nIn case the automatic resolution doesn't complete successfully,\nyou can uncheck this property and add the missing dependencies manually.
