#X-Generator: crowdin.com
generatedJavaRepository=\u751f\u6210\u3055\u308c\u305f Java \u30bf\u30a4\u30d7
name=\u540d\u524d
packageName=\u30d1\u30c3\u30b1\u30fc\u30b8
error=\u30a8\u30e9\u30fc
error_emptyName=\u540d\u524d\u304c\u5fc5\u8981\u3067\u3059
type=\u30bf\u30a4\u30d7
Remove=\u524a\u9664
selectBusinessObjectWizardTitle=\u30d3\u30b8\u30cd\u30b9 \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3092\u9078\u629e
selectBusinessObjectWizardMessage=\u7de8\u96c6\u3059\u308b\u65e2\u5b58\u306e\u30d3\u30b8\u30cd\u30b9 \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3092\u9078\u629e\u3057\u307e\u3059\u3002
businessObjectRepositoryStoreName=\u30d3\u30b8\u30cd\u30b9 \u30aa\u30d6\u30b8\u30a7\u30af\u30c8
errorMessageSameDataTypeNames=\u4ed6\u306e\u30c7\u30fc\u30bf\u578b\u3068\u540c\u3058\u540d\u524d\u304c\u65e2\u306b\u5b58\u5728\u3057\u307e\u3059\u3002
errorMessageNoWhitespaceInDataTypeNames=\u30d3\u30b8\u30cd\u30b9 \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u540d\u306b\u306f\u7a7a\u767d\u306f\u8a31\u3055\u308c\u307e\u305b\u3093\u3002
noBusinessObjectSelected=\u30d3\u30b8\u30cd\u30b9 \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3092\u9078\u629e
addBusinessObjectDataTitle=\u65b0\u3057\u3044\u30d3\u30b8\u30cd\u30b9\u5909\u6570\u3092 {0} \u306b\u8ffd\u52a0
addBusinessObjectDataDescription=\u300c\u958b\u767a\u300d > \u300c\u30d3\u30b8\u30cd\u30b9 \u30c7\u30fc\u30bf \u30e2\u30c7\u30eb \u30e1\u30cb\u30e5\u30fc\u300d\u3067\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u308b\u30d3\u30b8\u30cd\u30b9 \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306e\u65b0\u3057\u3044\u53c2\u7167\u3092\u4f5c\u6210 
description=\u8aac\u660e
businessObject=\u30d3\u30b8\u30cd\u30b9 \u30aa\u30d6\u30b8\u30a7\u30af\u30c8
dataWithSameNameAlreadyExists=\u540c\u3058\u540d\u524d\u3092\u6301\u3064\u30c7\u30fc\u30bf\u304c\u65e2\u306b\u5b58\u5728\u3057\u307e\u3059\u3002
editBusinessObjectDataWindowTitle=\u30d3\u30b8\u30cd\u30b9\u5909\u6570\u3092\u7de8\u96c6
editBusinessObjectDataTitle=\u30d3\u30b8\u30cd\u30b9\u5909\u6570\u3092\u7de8\u96c6
editBusinessObjectDataDescription=\u65e2\u5b58\u306e\u30d3\u30b8\u30cd\u30b9\u5909\u6570\u3092\u7de8\u96c6
createNewBusinessObject=<A>... \u65b0\u3057\u3044\u30d3\u30b8\u30cd\u30b9 \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306e\u4f5c\u6210</A>
businessObjectNotFound=\u30d3\u30b8\u30cd\u30b9 \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306e {0} \u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093
errorWhileDeployingBDR=\u30d3\u30b8\u30cd\u30b9 \u30c7\u30fc\u30bf \u30e2\u30c7\u30eb\u306e\u767a\u884c\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f
publish=\u767a\u884c
publishBusinessObjectTitle=\u30d3\u30b8\u30cd\u30b9 \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3092\u767a\u884c
publishBusinessObjectDescription=\u30a8\u30f3\u30b8\u30f3\u306b\u9078\u629e\u3055\u308c\u3066\u3044\u308b\u30d3\u30b8\u30cd\u30b9 \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3092\u767a\u884c\u3057\u307e\u3059\u3002
businessObjectPublishedMessage=\u30d3\u30b8\u30cd\u30b9 \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306f\u6b63\u5e38\u306b\u767a\u884c\u3055\u308c\u307e\u3057\u305f\u3002
businessObjectPublishedTitle=\u30d3\u30b8\u30cd\u30b9 \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3092\u767a\u884c
export=\u30a8\u30af\u30b9\u30dd\u30fc\u30c8
exportBusinessDataModelTitle=\u30d3\u30b8\u30cd\u30b9 \u30c7\u30fc\u30bf \u30e2\u30c7\u30eb\u3092\u30a8\u30af\u30b9\u30dd\u30fc\u30c8
exportBusinessDataModelDescription={0} \u306b\u30c7\u30d7\u30ed\u30a4\u3059\u308b\u30d3\u30b8\u30cd\u30b9 \u30c7\u30fc\u30bf \u30e2\u30c7\u30eb\u3092\u30a8\u30af\u30b9\u30dd\u30fc\u30c8\u3057\u307e\u3059\u3002\n\u751f\u6210\u3055\u308c\u305f\u30a2\u30fc\u30ab\u30a4\u30d6 \u30d5\u30a1\u30a4\u30eb\u540d\u306f"bdm.zip"\u306b\u306a\u308a\u307e\u3059\u3002
exportBusinessDataModelSuccessFull=\u30d3\u30b8\u30cd\u30b9 \u30c7\u30fc\u30bf \u30e2\u30c7\u30eb\u306f {0} \u3092\u6b63\u5e38\u306b\u30a8\u30af\u30b9\u30dd\u30fc\u30c8\u3055\u308c\u307e\u3057\u305f\u3002
exportingBusinessDataModel=\u30d3\u30b8\u30cd\u30b9 \u30c7\u30fc\u30bf \u30e2\u30c7\u30eb\u3092\u30a8\u30af\u30b9\u30dd\u30fc\u30c8\u3057\u3066\u3044\u307e\u3059...
destinationPath=\u51fa\u529b\u5148\u306e\u30d1\u30b9
invalidDestinationPath=\u5b9b\u5148\u306e\u30d1\u30b9\u306f\u6709\u52b9\u306a\u30d5\u30a9\u30eb\u30c0\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002
browse=\u53c2\u7167...
deployingBusinessObjects=\u30d3\u30b8\u30cd\u30b9 \u30c7\u30fc\u30bf \u30e2\u30c7\u30eb\u3092\u30c7\u30d7\u30ed\u30a4\u3057\u3066\u3044\u307e\u3059...
add=\u8ffd\u52a0
delete=\u524a\u9664
listOfBusinessObjects=\u30d3\u30b8\u30cd\u30b9 \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306e\u30ea\u30b9\u30c8
selectABusinessObjectToEdit=\u7de8\u96c6\u3059\u308b\u30d3\u30b8\u30cd\u30b9 \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3092\u9078\u629e
up=\u4e0a\u3078
down=\u4e0b\u3078
length=\u9577\u3055
mandatory=\u5fc5\u9808
fieldNameAlreadyExists=\u5c5e\u6027\u540d\u306f\u65e2\u306b\u5b58\u5728\u3057\u307e\u3059
constraintNameAlreadyExists=\u5236\u7d04\u540d\u306f\u65e2\u306b\u5b58\u5728\u3057\u307e\u3059
deleteBOConfirmTitle=\u30d3\u30b8\u30cd\u30b9 \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3092\u524a\u9664\u3057\u307e\u3059\u304b\uff1f
deleteBOConfirmMessage=\u30d3\u30b8\u30cd\u30b9 \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u300c{0}\u300d\u3092\u524a\u9664\u3057\u3066\u3082\u3088\u308d\u3057\u3044\u3067\u3059\u304b\uff1f
attribute=attribute
error_emptyPackageName=\u30d1\u30c3\u30b1\u30fc\u30b8\u540d\u304c\u7a7a\u3067\u3059
modelValidationFailedTitle=\u691c\u8a3c\u306b\u5931\u6557\u3057\u307e\u3057\u305f
validatingBDM=\u691c\u8a3c\u3057\u3066\u3044\u307e\u3059...
atLeastOneAttributeShouldExists={0} \u306f\u3001\u5c11\u306a\u304f\u3068\u3082 1 \u3064\u306e\u5c5e\u6027\u304c\u5fc5\u8981\u3067\u3059\u3002
manageBusinessDataModelTitle=\u30d3\u30b8\u30cd\u30b9 \u30c7\u30fc\u30bf \u30e2\u30c7\u30eb\u3092\u7ba1\u7406
manageBusinessDataModelDesc=\u30d3\u30b8\u30cd\u30b9 \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3092\u30ea\u30b9\u30c8\u306b\u8ffd\u52a0\u3057\u3001\u53f3\u5074\u306e\u30da\u30a4\u30f3\u30bf\u30d6\u5185\u3067\u305d\u308c\u3089\u306e\u8a73\u7d30\u3092\u7de8\u96c6\u3057\u307e\u3059\u3002
reservedKeyWord={0} \u306f\u4e88\u7d04\u6e08\u307f\u306e\u30ad\u30fc\u30ef\u30fc\u30c9\u3067\u3059
saving=\u4fdd\u5b58\u4e2d...
constraints=Constraints
businessDataModel=\u30d3\u30b8\u30cd\u30b9 \u30c7\u30fc\u30bf \u30e2\u30c7\u30eb
selectUniqueConstraintFieldsMessage=\u30e6\u30cb\u30fc\u30af\u5236\u7d04\u304c\u9069\u7528\u3055\u308c\u308b\u5c5e\u6027\u306e\u7d44\u307f\u5408\u308f\u305b\u3092\u9078\u629e\u3057\u307e\u3059\u3002
selectUniqueConstraintFieldsTitle=\u5c5e\u6027\u3092\u9078\u629e
attributes=\u5c5e\u6027
atLeastOneAttributeShouldBelongToConstraint=\u30e6\u30cb\u30fc\u30af\u5236\u7d04 {0} \u306b\u306f\u3001\u5c11\u306a\u304f\u3068\u3082 1 \u3064\u306e\u5c5e\u6027\u3092\u5b9a\u7fa9\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059
attributeInConstraintNotExists=\u30e6\u30cb\u30fc\u30af\u5236\u7d04 {1} \u5185\u306e\u5c5e\u6027 {0} \u304c\u5b58\u5728\u3057\u307e\u305b\u3093
atLeastOneAttributeShouldBelongToIndex=\u30a4\u30f3\u30c7\u30c3\u30af\u30b9 {0} \u306b\u306f\u3001\u5c11\u306a\u304f\u3068\u3082 1 \u3064\u306e\u5c5e\u6027\u3092\u5b9a\u7fa9\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
attributeInIndexNotExists=\u30a4\u30f3\u30c7\u30c3\u30af\u30b9 {1} \u5185\u306b\u5c5e\u6027 {0} \u304c\u5b58\u5728\u3057\u307e\u305b\u3093
atLeastOneBusinessObjectShouldExists=\u5c11\u306a\u304f\u3068\u3082 1 \u3064\u306e\u30d3\u30b8\u30cd\u30b9 \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3092\u5b9a\u7fa9\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059
invalidSQLIdentifier={0} \u306f\u6709\u52b9\u306a SQL \u8b58\u5225\u5b50\u3067\u306f\u3042\u308a\u307e\u305b\u3093
queries=\u30af\u30a8\u30ea
queryNameAlreadyExists=\u30af\u30a8\u30ea\u540d\u306f\u65e2\u306b\u5b58\u5728\u3057\u307e\u3059
query=\u30af\u30a8\u30ea
parameters=\u30d1\u30e9\u30e1\u30fc\u30bf
parameter=param
queryParameterNameAlreadyExists=\u30d1\u30e9\u30e1\u30fc\u30bf {0} \u306f\u65e2\u306b\u5b58\u5728\u3057\u307e\u3059
newQuery={0} \u306b\u5bfe\u3059\u308b\u30af\u30a8\u30ea\u3092\u4f5c\u6210\u3057\u307e\u3059
newQueryDescription=JPQL \u3092\u4f7f\u7528\u3057\u3066\u30af\u30a8\u30ea\u3092\u5165\u529b\u3057\u307e\u3059\u3002\u63d0\u4f9b\u3055\u308c\u3066\u3044\u308b\u4f8b\u793a\u3092\u4f7f\u7528\u307e\u305f\u306f\u7834\u68c4\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002\n\u305d\u306e\u5f8c\u3001\u30d1\u30e9\u30e1\u30fc\u30bf\u306e\u30c7\u30d5\u30a9\u30eb\u30c8\u30fb\u30ea\u30b9\u30c8\u3092\u8abf\u6574\u3057\u307e\u3059\u3002\u5fc5\u8981\u306b\u5fdc\u3058\u3066\u3001\u7d50\u679c\u306e\u578b\u3092\u4fee\u6b63\u3057\u307e\u3059\u3002
editQuery=Edit query
editQueryDescription=You need to use JPQL to write this query.
parameterNotUsedInQueryWarning={0} \u306f\u3001\u30d1\u30e9\u30e1\u30fc\u30bf\u306e\u30ea\u30b9\u30c8\u306b\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u307e\u3059\u304c\u3001\u30af\u30a8\u30ea\u3067\u306f\u4f7f\u7528\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
undefinedParameter={0} \u306f\u3001\u30d1\u30e9\u30e1\u30fc\u30bf\u306e\u30ea\u30b9\u30c8\u306b\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u307e\u305b\u3093
exportCompleted=\u30a8\u30af\u30b9\u30dd\u30fc\u30c8\u304c\u5b8c\u4e86\u3057\u307e\u3057\u305f
queryResultType=\u7d50\u679c\u306e\u578b
multipleReturnType=\u8907\u6570\u914d\u5217 (java.util.List)
multiple=\u8907\u6570
single=\u5358\u4e00 ({0})
numeric=\u6570\u5024 (java.util.Long)
queryLink=JPQL \u30af\u30a8\u30ea * <a>?</a>
jpqlParametersHint=\u4e0a\u8a18\u306e\u30af\u30a8\u30ea\u3067\u4f7f\u7528\u3059\u308b\u30d1\u30e9\u30e1\u30fc\u30bf\u3092\u5b9a\u7fa9
emptyQueryError=JPQL \u30af\u30a8\u30ea\u3092\u7a7a\u306b\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093
queryNameReserved={0} \u306f\u4e88\u7d04\u6e08\u307f\u306e\u30af\u30a8\u30ea\u540d\uff08\u30e6\u30cb\u30fc\u30af\u5236\u7d04\u304b\u3089\u751f\u6210\u3055\u308c\u308b\u30af\u30a8\u30ea\uff09\u3067\u3059\u3002
queryExpressionLabel=\u30af\u30a8\u30ea
queryContent=\u30af\u30a8\u30ea\u306e\u30b3\u30f3\u30c6\u30f3\u30c4
value=\u5024
returnType=\u623b\u308a\u5024\u306e\u578b
dropBusinessDataDBOnExit=\u7d42\u4e86\u6642\u306b\u30d3\u30b8\u30cd\u30b9 \u30c7\u30fc\u30bf \u30e2\u30c7\u30eb\u306e\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u3092\u304d\u308c\u3044\u306b\u3059\u308b
dropBusinessDataDBOnBDMChanges=\u5909\u66f4\u6642\u306b\u30d3\u30b8\u30cd\u30b9 \u30c7\u30fc\u30bf \u30e2\u30c7\u30eb\u306e\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u3092\u304d\u308c\u3044\u306b\u3059\u308b
queryExpressionGuidance=\u30d3\u30b8\u30cd\u30b9 \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3068\u3001\u305d\u308c\u306b\u5bfe\u5fdc\u3059\u308b\u5b9f\u884c\u30af\u30a8\u30ea\u3092\u3092\u9078\u629e\u3057\u307e\u3059\u3002\u30af\u30a8\u30ea\u306b\u5fc5\u8981\u306a\u5404\u30d1\u30e9\u30e1\u30fc\u30bf\u306e\u5024\u3092\u8a2d\u5b9a\u3057\u307e\u3059\u3002
bdmCompatibilityTitle=Compatible changes
bdmCompatibilityMsg=\u3053\u306e BDM \u306f\u3001REST API \u30b3\u30fc\u30eb\u3092\u4f7f\u7528\u3057\u3066 Studio \u5185\u306e\u3059\u3079\u3066\u306e\u30d7\u30ed\u30bb\u30b9\u3068\u30da\u30fc\u30b8\u3067\u5229\u7528\u53ef\u80fd\u3067\u3059\u3002BDM \u306e\u5909\u66f4\u306f\u3001\u4e0d\u6574\u5408\u3092\u767a\u751f\u3055\u305b\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\nBDM \u306e\u66f4\u65b0\u5f8c\u3001\u5404\u30c0\u30a4\u30a2\u30b0\u30e9\u30e0\u3092\u691c\u8a3c\u3057\u3066\u3001\u3042\u306a\u305f\u306e\u30da\u30fc\u30b8\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002\n\u5c5e\u6027\u306e\u300c\u5fc5\u9808\u300d\u307e\u305f\u306f\u300c\u8907\u6570\u300d\u306e\u8a2d\u5b9a\u3092\u5909\u66f4\u3057\u305f\u5834\u5408\u3001\u307e\u305f\u306f\u30e6\u30cb\u30fc\u30af\u5236\u7d04\u3092\u5909\u66f4\u3057\u305f\u5834\u5408\u306f\u3001\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306e\u30d3\u30b8\u30cd\u30b9 \u30c7\u30fc\u30bf\u306e\u5024\u3092\u30af\u30ea\u30a2\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
clearExistingBusinessData=\u30c7\u30fc\u30bf\u3092\u30af\u30ea\u30a2
businessObjectNameAlreadyExists=\u540c\u3058\u540d\u524d\u306e\u30d3\u30b8\u30cd\u30b9 \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u304c\u65e2\u306b\u5b58\u5728\u3057\u307e\u3059
installFailedTitle=\u30c7\u30d7\u30ed\u30a4\u306b\u5931\u6557\u3057\u307e\u3057\u305f
installFailedMessage=\u30d3\u30b8\u30cd\u30b9 \u30c7\u30fc\u30bf \u30e2\u30c7\u30eb\u3092\u30a8\u30f3\u30b8\u30f3\u306b\u30c7\u30d7\u30ed\u30a4\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f
defaultQueriesOption=\u30c7\u30d5\u30a9\u30eb\u30c8
customQueriesOption=\u30ab\u30b9\u30bf\u30e0
defaultQueriesHint=Default queries are provided based on Business Object fields and unique constraints
providedQuery=\u63d0\u4f9b\u3055\u308c\u305f\u30af\u30a8\u30ea
providedQueryDescription=\u3053\u306e\u30af\u30a8\u30ea\u306e\u30b3\u30f3\u30c6\u30f3\u30c4\u3092\u8868\u793a
queryParameterNameReservedForPagination={0} \u306f\u6539\u30da\u30fc\u30b8\u306e\u305f\u3081\u306e\u4e88\u7d04\u6e08\u307f\u30ad\u30fc\u30ef\u30fc\u30c9\u3067\u3059
orderByMissingWarning=\u30d3\u30b8\u30cd\u30b9 \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306e\u30ea\u30b9\u30c8\u3092\u8fd4\u3059\u30af\u30a8\u30ea\u3092\u5b9a\u7fa9\u3057\u307e\u3057\u305f\u3002\u30ea\u30b9\u30c8\u3092\u8fd4\u3059\u3068\u304d\u306b ORDER BY \u53e5\u3092\u4f7f\u7528\u3059\u308b\u3053\u3068\u3092\u304a\u52e7\u3081\u3057\u307e\u3059\u3002
paginationParameterHint=2 \u3064\u306e\u6539\u30da\u30fc\u30b8\u8abf\u6574\u30d1\u30e9\u30e1\u30fc\u30bf\u304c\u63d0\u4f9b\u3055\u308c\u3066\u3044\u307e\u3059\u3002\u305d\u308c\u3089\u306fAPI \u3092\u901a\u3058\u3066\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002\nstartIndex \u306f\u6700\u521d\u306b\u8868\u793a\u3059\u308b\u7d50\u679c\u30ea\u30b9\u30c8\u5185\u306e\u30a4\u30f3\u30c7\u30c3\u30af\u30b9\u3001maxResults \u306f\u30da\u30fc\u30b8\u306b\u8868\u793a\u3059\u308b\u9805\u76ee\u6570\u306b\u306a\u308a\u307e\u3059\u3002\n\u6ce8\: \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3 \u30d5\u30a9\u30fc\u30e0\u5185\u3067\u306f\u3001\u30a6\u30a3\u30b8\u30a7\u30c3\u30c8\u3060\u3051\u304c\u8981\u7d20\u3092\u30da\u30fc\u30b8\u30f3\u30b0\u3057\u3066\u8868\u793a\u3057\u307e\u3059\u3002
newQueryTitle=\u30af\u30a8\u30ea\u3092\u4f5c\u6210
editQueryTitle=Edit query
howToUseBusinessObjects=\u30d3\u30b8\u30cd\u30b9 \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3092\u4f7f\u7528\u3059\u308b\u65b9\u6cd5
howToUseBusinessObjectsContent=\u30d7\u30ed\u30bb\u30b9\u3067\u30d3\u30b8\u30cd\u30b9 \u30c7\u30fc\u30bf\u3092\u4f7f\u7528\u3059\u308b\u306b\u306f\u3001\u30d7\u30fc\u30eb \u30ec\u30d9\u30eb\u3067\u30d3\u30b8\u30cd\u30b9\u5909\u6570\u3092\u5b9a\u7fa9\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002\n\u30d7\u30ed\u30bb\u30b9\u3067\u30d3\u30b8\u30cd\u30b9 \u30c7\u30fc\u30bf\u3092\u8aad\u307f\u53d6\u308b\u306b\u306f\u3001 Groovy \u30b9\u30af\u30ea\u30d7\u30c8\u5185\u306e\u30d3\u30b8\u30cd\u30b9 \u30aa\u30d6\u30b8\u30a7\u30af\u30c8 DAO \u3001\u307e\u305f\u306f\u30af\u30a8\u30ea\u5f0f\u3092\u4f7f\u7528\u3059\u308b\u3053\u3068\u3082\u3067\u304d\u307e\u3059\u3002 \n\n\u30d5\u30a9\u30fc\u30e0\u307e\u305f\u306f\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3 \u30da\u30fc\u30b8\u3067\u30d3\u30b8\u30cd\u30b9 \u30c7\u30fc\u30bf\u3092\u4f7f\u7528\u3059\u308b\u306b\u306f\u3001\u30a6\u30a3\u30b8\u30a7\u30c3\u30c8\u306e\u5024\u30d7\u30ed\u30d1\u30c6\u30a3\u306b REST API \u3092\u4f7f\u7528\u3057\u307e\u3059\u3002
multipleBusinessData=\u8907\u6570\uff08\u914d\u5217\uff09
composition=\u30b3\u30f3\u30dd\u30b8\u30b7\u30e7\u30f3\uff08composition\uff09
aggregation=\u96c6\u7d04\uff08aggregation\uff09
relation=\u95a2\u9023
indexes=\u30a4\u30f3\u30c7\u30c3\u30af\u30b9
indexNameAlreadyExists=\u30a4\u30f3\u30c7\u30c3\u30af\u30b9\u540d\u306f\u65e2\u306b\u5b58\u5728\u3057\u307e\u3059
indexedAttributes=\u30a4\u30f3\u30c7\u30c3\u30af\u30b9\u4ed8\u304d\u5c5e\u6027
availableAttributes=\u4f7f\u7528\u53ef\u80fd\u306a\u5c5e\u6027
selectIndexFieldsTitle={0} \u306e\u5c5e\u6027\u3092\u9078\u629e\u3057\u307e\u3059
selectIndexFieldsMessages=\u3053\u306e\u30a4\u30f3\u30c7\u30c3\u30af\u30b9\u306e\u5c5e\u6027\u3092\u9078\u629e\u3057\u307e\u3059\u3002\u3053\u306e\u30af\u30a8\u30ea \u30d5\u30a3\u30eb\u30bf\u30fc\u306e\u30d1\u30d5\u30a9\u30fc\u30de\u30f3\u30b9\u306f\u3001\u9078\u629e\u3057\u305f\u5c5e\u6027\u304a\u3088\u3073\u30bd\u30fc\u30c8\u9806\u306b\u3088\u308a\u307e\u3059\u304c\u3001\u5927\u5e45\u306b\u5411\u4e0a\u3057\u307e\u3059\u3002
businessObjectDAO=\u30d3\u30b8\u30cd\u30b9 \u30aa\u30d6\u30b8\u30a7\u30af\u30c8 DAO
mandatoryColumnTooltip=\u300c\u8907\u6570\u300d\u3068\u300c\u5fc5\u9808\u300d\u3092\u30c1\u30a7\u30c3\u30af\u3059\u308b\u5834\u5408\u306f\u3001\u5c11\u306a\u304f\u3068\u3082 1 \u3064\u306e\u5024\u306f\u5fc5\u9808\u3067\u3059\u3002
stringLengthTooltip=\u6587\u5b57\u5217\u5024\u306b\u5bfe\u3057\u3066\u8a31\u5bb9\u3055\u308c\u308b\u6700\u5927\u9577\u3002
lengthCannotBeEmpty=\u9577\u3055\u3092\u6709\u52b9\u306a\u6b63\u306e\u6574\u6570\u306b\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059
noDetailsAvailable=\u8a73\u7d30\u304c\u3042\u308a\u307e\u305b\u3093
details=\u8a73\u7d30\u60c5\u5831
detailsFor={0} \u306e\u8a73\u7d30
realtionTooltip=- \u96c6\u7d04\uff08aggregation\uff09\u306f\u3001\u300c\uff5e\u306b\u3088\u3063\u3066\u96c6\u7d04\u3055\u308c\u3066\u3044\u308b\u300d\u3092\u610f\u5473\u3057\u307e\u3059\: \u95a2\u9023\u3059\u308b\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306f\u305d\u308c\u81ea\u8eab\u304c\u72ec\u7acb\u3057\u3066\u5b58\u5728\u3057\u307e\u3059;\n\u96c6\u7d04\u3059\u308b\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u304c\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306b\u4fdd\u5b58\u3055\u308c\u308b\u3068\u304d\u3001\u305d\u306e\u95a2\u9023\u3059\u308b\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306f\u5909\u66f4\u3055\u308c\u307e\u305b\u3093\u3002\n- \u30b3\u30f3\u30dd\u30b8\u30b7\u30e7\u30f3\uff08composition\uff09\u306f\u3001\u300c\u306e\u4e00\u90e8\u3067\u3059\u300d\u3092\u610f\u5473\u3057\u307e\u3059\: \u89aa\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u304c\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306b\u4fdd\u5b58\u3055\u308c\u308b\u3068\u304d\u306b\u3001\u95a2\u9023\u3059\u308b\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3082\u5909\u66f4\u3055\u308c\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
errorMessageNoUnderscoreInBoNames=\u30d3\u30b8\u30cd\u30b9 \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306e\u540d\u524d\u5185\u3067 '_' \u306e\u4f7f\u7528\u306f\u3001\u8a31\u53ef\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
loadOnDemand=\u95a2\u9023\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306f\u5fc5\u8981\u306a\u3068\u304d\u306b\u3060\u3051\u8aad\u307f\u8fbc\u3080
loadOnDemandHint=\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u304c\u89aa\u306e\u30d3\u30b8\u30cd\u30b9 \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3092\u4e00\u7dd2\u306b\u306f\u3001\u307e\u308c\u306b\u3057\u304b\u8868\u793a\u307e\u305f\u306f\u3001\u5909\u66f4\u3055\u308c\u306a\u3044\u5834\u5408\u306f\u3001\u3053\u306e\u30aa\u30d7\u30b7\u30e7\u30f3\u3092\u304a\u52e7\u3081\u3057\u307e\u3059\u3002
alwaysLoad=\u5e38\u306b\u95a2\u9023\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3092\u8aad\u307f\u8fbc\u3080
alwaysLoadHint=\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u304c\u89aa\u306e\u30d3\u30b8\u30cd\u30b9 \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3092\u4e00\u7dd2\u306b\u306f\u3001\u307e\u308c\u306b\u3057\u304b\u8868\u793a\u307e\u305f\u306f\u3001\u5909\u66f4\u3055\u308c\u306a\u3044\u5834\u5408\u306f\u3001\u3053\u306e\u30aa\u30d7\u30b7\u30e7\u30f3\u3092\u304a\u52e7\u3081\u3057\u307e\u3059\u3002
createBusinessDataVariable=\u30d3\u30b8\u30cd\u30b9 \u30c7\u30fc\u30bf\u3092\u4f5c\u6210...
error_reservedPackagePrefix={0} \u306f\u3001\u4e88\u7d04\u6e08\u307f\u306e\u30d1\u30c3\u30b1\u30fc\u30b8\u306e\u63a5\u982d\u8f9e\u3067\u3059\u3002
warning_reservedPackagePrefix={0} \u306f\u3001\u63a8\u5968\u3067\u304d\u306a\u3044\u30d1\u30c3\u30b1\u30fc\u30b8\u982d\u8f9e\u3067\u3059\u3002
disabledMandatoryTooltip=\u8907\u6570\u306e\u5c5e\u6027\u3092\u5fc5\u9808\u306b\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
defaultValue=\u30c7\u30d5\u30a9\u30eb\u30c8\u5024
defaultValueReturnTypeValidationMessage=\u30c7\u30d5\u30a9\u30eb\u30c8\u5024\u306e\u5f0f\u306f\u3001{0} \u3092\u8fd4\u3057\u307e\u3059\u304c {1} \u304c\u671f\u5f85\u5024\u3067\u3059\u3002
addBusinessObjectDataWindowTitle=\u65b0\u3057\u3044\u30d3\u30b8\u30cd\u30b9\u5909\u6570
defaultValueBusinessDataTooltip=\u30d3\u30b8\u30cd\u30b9 \u30c7\u30fc\u30bf\u306f\u3001\u65e2\u5b58\u306e\u30d3\u30b8\u30cd\u30b9 \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3092\u30af\u30a8\u30ea\u3067\u30a2\u30af\u30bb\u30b9\u3057\u3001\u305d\u306e\u53d6\u5f97\u30c7\u30fc\u30bf\u3067\u521d\u671f\u5316\u3067\u304d\u307e\u3059\u3002\u307e\u305f\u306f dao \u5909\u6570 (XXXDAO.newInstance()) \u3092\u4f7f\u7528\u3057\u305f Groovy \u30b9\u30af\u30ea\u30d7\u30c8\u3067\u65b0\u3057\u3044\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u3092\u4f5c\u6210\u3059\u308b\u3053\u3068\u306b\u3088\u3063\u3066\u3082\u521d\u671f\u5316\u3067\u304d\u307e\u3059\u3002
cleaningBusinessObjects=\u30d3\u30b8\u30cd\u30b9 \u30c7\u30fc\u30bf\u30e2\u30c7\u30eb\u3092\u30af\u30ea\u30fc\u30cb\u30f3\u30b0\u3059\u308b...
countQueryInfo=\u3053\u306e\u30d3\u30b8\u30cd\u30b9 \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306e \u30da\u30fc\u30b8\u30f3\u30b0\u3055\u308c\u305f\u7d50\u679c\u3092REST API \u30af\u30a8\u30ea\u3067\u53d6\u5f97\u3059\u308b\u306b\u306f\u3001\u95a2\u9023\u3059\u308b\u30ab\u30a6\u30f3\u30c8 \u30af\u30a8\u30ea\u3092\u4f5c\u6210\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002\u300cQueryName\u300d\u3068\u3044\u3046\u540d\u524d\u3067\u7d50\u679c\u306e\u5408\u8a08\u6570\u3092\u30ab\u30a6\u30f3\u30c8\u3059\u308b"countForQueryName"\u3068\u3044\u3046\u540d\u524d\u306e\u30af\u30a8\u30ea\u3092\u4f5c\u6210\u3057\u307e\u3059\u3002
missingCountQuery=\u3053\u306e REST API \u30af\u30a8\u30ea\u7d50\u679c\u3092\u30da\u30fc\u30b8\u30f3\u30b0\u3067\u304d\u308b\u3088\u3046\u306b\u30ab\u30a6\u30f3\u30c8 \u30af\u30a8\u30ea {0} \u3092\u5b9a\u7fa9\u3067\u304d\u307e\u3059\u3002
