#X-Generator: crowdin.com
callActivityTargetNameMigrationDescription=Le nom de l'activit\u00e9 appelante a \u00e9t\u00e9 transform\u00e9 en une expression lors de la migration.
callActivityTargetVersionMigrationDescription=La version de l'activit\u00e9 appelante a \u00e9t\u00e9 transform\u00e9e en une expression lors de la migration.
callActivityTargetNameProperty=Nom du sous-processus
callActivityTargetVersionProperty=Version du sous-processus
dataProperty=Donn\u00e9es
document=Document
documentProperty=Documents
documentCreationDescription=Un document a \u00e9t\u00e9 cr\u00e9\u00e9 \u00e0 partir d'une donn\u00e9e de type pi\u00e8ce jointe. La donn\u00e9e de type pi\u00e8ce jointe n'existe plus en v6.
dataDefaultValueMigrationDescription=La valeur par d\u00e9faut de cette variable a \u00e9t\u00e9 convertie en une expression.
dataDefaultValueProperty=Valeur par d\u00e9faut
dataDefaultValueWithOtherDataDependencyMigrationDescription=Une valeur par d\u00e9faut d'une variable d\u00e9pendant d'une autre variable du m\u00eame conteneur n'est pas support\u00e9e.
sequenceFlowConditionMigrationDescription=La condition de ce flux de s\u00e9quence a \u00e9t\u00e9 convertie en une expression.
sequenceFlowConditionProperty=Condition du flux de s\u00e9quence
removeDeadlinesMigrationDescription=Le concept de "deadline" n'existe plus, vous devez revoir votre conception afin d'obtenir un comportement \u00e9quivalent.
connectorProperty=Connecteurs
loopMaximumScriptMigrationDescription=Le script de boucle maximale a \u00e9t\u00e9 converti en une expression.
loopConditionScriptMigrationDescription=Le script de condition de boucle a \u00e9t\u00e9 converti en une expression.
iterationProperty=It\u00e9ration
dynamicLabelMigrationDescription=Le script d'affichage du nom a \u00e9t\u00e9 transform\u00e9 en une expression.
portalProperty=Portail
dynamicDescriptionMigrationDescription=Affichage du script de description qui a \u00e9t\u00e9 converti en une expression.
stepSummaryMigrationDescription=Le script de la description apr\u00e8s compl\u00e9tion  a \u00e9t\u00e9 convertie en une expression.
removeConnectorMigrationDescription=Le connecteur a \u00e9t\u00e9 supprim\u00e9.
removeCustomConnectorMigrationDescription=Le connecteur a \u00e9t\u00e9 supprim\u00e9 car aucune d\u00e9finition n'a \u00e9t\u00e9 trouv\u00e9e. Pour les connecteurs personnalis\u00e9s, v\u00e9rifiez qu'ils sont bien export\u00e9s dans le fichier .bar. 
removeGroupMigrationDescription=Ce s\u00e9lecteur d'acteur a \u00e9t\u00e9 supprim\u00e9.
actorProperty=Acteurs
actorSelector=S\u00e9lecteur d'acteur
redirectionUrlMigrationDescription=Script de redirection url a \u00e9t\u00e9 converti en une expression.
entryPageflowProperty=Formulaire
confirmationProperty=Confirmation
confirmationMessageMigrationDescription=Script de message de confirmation a \u00e9t\u00e9 transform\u00e9 en une expression.
redirectionActionMigrationDescription=Une action de redirection a \u00e9t\u00e9 convertie en une op\u00e9ration.
viewPageflowProperty=Formulaire de consultation
recapPageflowProperty=Formulaire r\u00e9capitulatif
pageFlowTransitionMigrationDescription=Le script de transition de formulaire a \u00e9t\u00e9 converti en une expression.
messageContentMigrationDescription=Le contenu du message a \u00e9t\u00e9 converti en expressions.
messagesProperty=Messages
targetProcessNameMigrationDescription=Nom du processus cible a \u00e9t\u00e9 convertie en une expression.
targetElementNameMigrationDescription=Le nom de l'\u00e9l\u00e9ment cible a \u00e9t\u00e9 converti en une expression.
correlationMigrationDescription=Les valeurs et les cl\u00e9s de corr\u00e9lation ont \u00e9t\u00e9 converties en expressions.
correlationProperty=Corr\u00e9lation
timerConditionProperty=Condition de minuterie
timerConditionMigrationDescription=La condition sur la minuterie a \u00e9t\u00e9 convertie en une expression.
removeFilterMigrationDescription=Ce filtre a \u00e9t\u00e9 supprim\u00e9.
formActionsMigrationDescription=Les actions de formulaire ont \u00e9t\u00e9 converties en op\u00e9rations.
actionProperty=Actions
widgetActionsMigrationDescription=L'op\u00e9ration de sortie de widget a \u00e9t\u00e9 convertie en op\u00e9rations.
widgetModifierMigrationDescription=Le modificateur de type de retour de widget a \u00e9t\u00e9 d\u00e9fini.
widgetDataInputAtProcessLevelMigrationDescription=Le Widget utilisait une variable pour initialiser sa valeur par d\u00e9faut. Toutefois les variables ne sont plus accessibles sur le formulaire d'instanciation.
widgetDataInputMigrationDescription=L'entr\u00e9e du Widget a \u00e9t\u00e9 convertie en une expression.
generalProperty=G\u00e9n\u00e9ral
userAidsProperty=Aide utilisateur
tooltipMigrationDescription=L'info-bulle a \u00e9t\u00e9 convertie en une expression.
helpMessageMigrationDescription=Le message d'aide a \u00e9t\u00e9 converti en une expression.
displayAfterEventConditionMigrationDescription=La condition \u00ab Indiquer quand un champ de contingence a chang\u00e9 \u00bb a \u00e9t\u00e9 convertie en une expression.
contingencyProperty=D\u00e9pendances
showImmediatelyConditionMigrationDescription=La condition \u00ab Montrer imm\u00e9diatement \u00bb a \u00e9t\u00e9 convertie en une expression.
optionsProperty=Options
updateSelectedValueMigrationDescription=La valeur s\u00e9lectionn\u00e9e apr\u00e8s que le script de mise \u00e0 jour de contingences a \u00e9t\u00e9 convertie en une expression.
updateAvailableValueMigrationDescription=Les valeurs disponibles apr\u00e8s le script de mise \u00e0 jour de contingences ont \u00e9t\u00e9 converties en une expression.
updateValueMigrationDescription=Le script de mise \u00e0 jour de valeur de contingences a \u00e9t\u00e9 convertie en une expression.
displayLabelMigrationDescription=Le libell\u00e9 a \u00e9t\u00e9 converti en une expression.
exampleMigrationDescription=Le script d'exemple a \u00e9t\u00e9 converti en une expression.
initialValueMigrationDescription=La valeur initiale a \u00e9t\u00e9 convertie en une expression.
buttonActionsMigrationDescription=Les actions li\u00e9es au bouton d'envoi ont \u00e9t\u00e9 converties en op\u00e9rations.
validatorParameterMigrationDescription=Param\u00e8tre du validateur a \u00e9t\u00e9 converti en une expression.
validatorsProperty=Validateurs
appearanceProperty=Apparence
maxNumberMigrationDescription=Le nombre max de duplications a \u00e9t\u00e9 converti en une expression.
minNumberMigrationDescription=Le nombre max de duplications a \u00e9t\u00e9 converti en une expression.
displayLabelForAddMigrationDescription=Le label \u00ab Ajouter \u00bb a \u00e9t\u00e9 converti en une expression.
displayLabelForRemoveMigrationDescription=Le label \u00ab Retirer \u00bb a \u00e9t\u00e9 converti en une expression.
tooltipForAddMigrationDescription=Le label de l'info-bulle pour 'Ajouter' a \u00e9t\u00e9 converti en une expression.
tooltipForRemoveMigrationDescription=Ll'info-bulle pour 'Ajouter' a \u00e9t\u00e9 convertie en une expression.
imgPathMigrationDescription=Le chemin de l'image a \u00e9t\u00e9 converti en une expression.
validatorDisplayNameMigrationDescription=Le message d'erreur du validateur a \u00e9t\u00e9 converti en une expression.
changeGatewayTypeToInclusiveGatewayMigrationDescription=Porte parall\u00e8le remplac\u00e9e par une porte inclusive (BPMN2 conformit\u00e9).
changeInclusiveGatewayMigrationDescription=Porte inclusive modifi\u00e9e.
changeParallelGatewayWithIncomingConditionsMigrationDescription=Porte parall\u00e8le avec les conditions sur les transitions entrantes modifi\u00e9es.
changeParallelGatewayWithOutgoingConditionsMigrationDescription=Porte parall\u00e8le avec les conditions sur les transitions sortantes modifi\u00e9es.
mandatoryLabelMigrationDescription=Le champ obligatoire a \u00e9t\u00e9 converti en une expression.
mandatorySymbolMigrationDescription=Le symbole obligatoire a \u00e9t\u00e9 convertie en une expression.
verticalHeaderMigrationDescription=Le script a \u00e9t\u00e9 converti en une expression.
horizontalHeaderMigrationDescription=Le script a \u00e9t\u00e9 converti en une expression.
cellExpressionMigrationDescription=Le contenu de la table a \u00e9t\u00e9 converti en une expression.
kpiBinding=Kpi binding
bamProperty=BAM
removeKpiMigrationDescription=La migration de KPI n'est pas prise en charge et a \u00e9t\u00e9 supprim\u00e9e.
maxRowForPaginationMigrationDescription=La ligne max pour la pagination a \u00e9t\u00e9 convertie en une expression.
columnForInitialIndexMigrationDescription=La colonne pour l'index de d\u00e9part a \u00e9t\u00e9 converti en expression.
selectedValuesMigrationDescription=Les valeurs s\u00e9lectionn\u00e9es ont \u00e9t\u00e9 converties en une expression.
minNumberOfColumnMigrationDescription=Le nombre minimal de lignes a \u00e9t\u00e9 converti en une expression.
maxNumberOfColumnMigrationDescription=Le nombre maximal de colonnes a \u00e9t\u00e9 converti en une expression.
maxNumberOfRowMigrationDescription=Le nombre maximal de lignes a \u00e9t\u00e9 converti en une expression.
minNumberOfRowMigrationDescription=Nombre minimal de lignes a \u00e9t\u00e9 converti en une expression.
simDataExpressionMigrationDescription=Les donn\u00e9es de simulation ont \u00e9t\u00e9 converties en une expression.
simDataChangeValueMigrationDescription=La mise \u00e0 jour de donn\u00e9es de simulation a \u00e9t\u00e9 convertie en une expression.
migrationReportOf=Rapport d''import pour {0}
removeMultiInstantiationMigrationDescription=Supprimer Multi-instanciation
deadlinesToNonInterruptingEventMigrationDescription=La deadline a \u00e9t\u00e9 remplac\u00e9e par un autre type d'\u00e9l\u00e9ment. Ce concept est maintenant li\u00e9 \u00e0 un non interrupting boundary timer event. Le connecteur li\u00e9 \u00e0 l'ancienne deadline a \u00e9t\u00e9 supprim\u00e9.
removeMessageEventFromSendTaskDescription=Le message \u00e9v\u00e9nement {0} a \u00e9t\u00e9 supprim\u00e9 de la t\u00e2che d''envoie afin de respecter le BPMN. Seul un message  Les t\u00e2ches d''envoie ne supporte qu''un seul message \u00e9v\u00e9nement.
attachementDataRemovedFromMessage=La pi\u00e8ce jointe de donn\u00e9es {0} a \u00e9t\u00e9 retir\u00e9e du contenu du message.
invalidArchiveStructure=La structure du fichier BAR {0} n''est pas correcte. Le fichier .proc est introuvable.\nVous avez peut-\u00eatre essay\u00e9 d''importer un fichier BAR de version 6.x alors que seules les versions 5.9 et + sont support\u00e9es.
startTimerCycleMigration=Le format de la condition de r\u00e9currence de la minuterie a \u00e9t\u00e9 migr\u00e9 en une expression de type "cron". \nLes conditions de r\u00e9currence de format date ne sont plus support\u00e9es.
timerCondition=Condition de minuterie
connectorMigrationDescription=Le connecteur a \u00e9t\u00e9 migr\u00e9. \nVeuillez v\u00e9rifier la coh\u00e9rence des param\u00e8tres d'entr\u00e9e et de sortie. 
development=D\u00e9veloppement
customConnectorMigrationDescription=Ce connecteur personnalis\u00e9 a \u00e9t\u00e9 migr\u00e9 en un connecteur compos\u00e9 d'une d\u00e9finition et d'une impl\u00e9mentation. Son impl\u00e9mentation doit \u00eatre revue pour qu'il fonctionne comme pr\u00e9vu.
customConnector=Connecteur personnalis\u00e9
connectorMigrationSetVarConnectorOnEnterOrOnStartDescription=Le connecteur Mis \u00e0 jour de variable, {0}, a \u00e9t\u00e9 converti en une ou plusieurs op\u00e9rations d''\u00e9tape.\nLes \u00e9v\u00e9nements d''ex\u00e9cution n''ont de ce fait pas \u00e9t\u00e9 pris en compte, les op\u00e9rations seront ex\u00e9cuter \u00e0 la fin de l''\u00e9tape. Notez que dans le cas de tache humaine, ces op\u00e9rations seront ex\u00e9cut\u00e9es apr\u00e8s la soumission du formulaire. Si le comportement n''est pas celui attendu veuillez d\u00e9placer ces op\u00e9rations dans une \u00e9tape pr\u00e9c\u00e9dente.
connectorMigrationSetVarConnectorOnFinishDescription=Le connecteur Mis \u00e0 jour de variable, {0}  a \u00e9t\u00e9 converti en une ou plusieurs op\u00e9rations d''\u00e9tape.
connectorMigrationFinishTaskDescription=Avec Bonita v6, le cycle de vie des activit\u00e9s a \u00e9t\u00e9 modifi\u00e9 et l'action de finir une t\u00e2che n'est plus disponible.
connectorMigrationStartInstanceDescription=Veuillez utiliser un Message ou un Signal pour d\u00e9marrer une instance de processus.
connectorMigrationUseScriptAndApiDescription=Vous devez utiliser un script Groovy. Vous pouvez utiliser directement l'API ou r\u00e9utiliser les m\u00e9thodes fournies dans la cat\u00e9gorie Bonita.
customConnectorMigrationFailureDescription=Ce connecteur personnalis\u00e9 n''a pas pu \u00eatre migr\u00e9. Des d\u00e9pendances semblent manquantes dans le fichier BAR original \:\n{0}
unsupportedVersionMessage=La version de votre processus est {0}. La migration est support\u00e9e pour les verisons {1}.
descripitonProperty=Description
tooLongDescriptionHasBeenTruncated=Une description de cet \u00e9l\u00e9ment a \u00e9t\u00e9 tronqu\u00e9e car elle d\u00e9passait le nouveau nombre maximum de caract\u00e8res autoris\u00e9s
warningImageFormat=Format d'image non valide
warningImageFormatMessage={0} n''a pas pu \u00eatre import\u00e9 car son format n''est pas support\u00e9. Merci d''utiliser l''un des formats suivants \: .gif;.jpg;.jpeg;.png;*.bmp.
migratingCustomConnector=Migration en cours du connecteur personnalis\u00e9 {0}...
groovyForNameWarningDescription=Une Groovy reflection a \u00e9t\u00e9 d\u00e9tect\u00e9 dans le script. La gestion du classpath a chang\u00e9 et vous devriez modifier le script ou placer les librairies dans un classpath partag\u00e9.
groovyForNameWarningPropertyName=Contenu du script
widgetDataInputTooManyConnectorMigrationDescription=Plusieurs connecteurs ont \u00e9t\u00e9 utilis\u00e9s en entr\u00e9es de widget. Seul le premier a \u00e9t\u00e9 migr\u00e9.
widgetContigencyConnectorMigrationDescription=Plusieurs connecteurs ont \u00e9t\u00e9 utilis\u00e9s dans les d\u00e9pendances entre champs de formulaire. Seul le premier a \u00e9t\u00e9 migr\u00e9.
