GeneralSection_Name=Nombre
GeneralSection_Description=Descripci\u00f3n
GeneralSection_Version=Versi\u00f3n
defaultFlowLabel=Flujo por defecto
activityType=Tipo de Actividad
activityType_task=Tarea Humana
activityType_receiveTask=Tarea Receptora
activityType_sendTask=Enviar Mensaje
activityType_serviceTask=Servicio de Tarea
activityType_scriptTask=Script
gatwetypeAnd=AND (Y)
gatwetypeXor=XOR (O exclusiva)
gatewayType=Tipo de Compuerta
newCategory=Nueva Categor\u00eda
estimatadExecutionTimeLabel=Tiempo de ejecuci\u00f3n estimado
dynamicLabelLabel=T\u00edtulo din\u00e1mico
dynamicDescriptionLabel=Descripci\u00f3n din\u00e1mica
dataNameLabel=Nombre *
dataDescriptionLabel=Descripci\u00f3n
datatypeLabel=Tipo de Dato
defaultValueLabel=Valor predeterminado
updateConnector=Editar...
removeConnector=Eliminar
addConnector=Agregar...
removeConnectorConfirmTitle=Eliminar estos conectores?
removeConnectorConfirmMessage=Est\u00e1 seguro que desea eliminar los siguientes conectores\:
connectorAdd_tooltip=Agregar a esta tarea
createForm_title=Crear un nuevo Formulario
createForm_defaultName=Formulario
createForm_noData=No existen Datos en la tarea, presione finalizar para crear un Formulario vac\u00edo..
error_allreadyExists=Ya existe un Formulario con ese nombre
error_empty=El campo nombre no puede estar vac\u00edo
duplicateForm_desc=Crear un nuevo Formulario o duplicarlo desde la lista
duplicateForm_title=Nuevo Formulario
duplicateForm_radioCreate=Crear un nuevo formulario (haga clic en "siguiente >" para seleccionar los datos que se utilizar\u00e1n al iniciar el formulario.)
duplicateForm_radioDuplicate=Duplicar un Formulario de la siguiente lista
addForm=Agregar...
addFormTitle=Agregar el formulario...
removeForm=Eliminar
editForm=Editar
formUp=Arriba
formDown=Abajo
selectAll=Seleccionar todo
formRemoveFormCommand=Eliminar formulario seleccionado
FormsSection_wizardVarsGroup_Title=Agregar widgets basado en...
FormsSection_wizardVarsGroup_Tooltip=Seleccionar los datos que desea tener en el Formulario
FormsSection_ConfirmationTemplate=Plantilla de Confirmaci\u00f3n
subprocess=Sub-proceso
connectionConnection=Condici\u00f3n
ResourceSection_ProcessTemplate=Plantilla de proceso
ResourceSection_PageTemplate=Plantilla Global de p\u00e1gina
ResourceSection_ErrorTemplate=P\u00e1gina de Error
ResourceSection_ProcessTemplate_hint=Dise\u00f1o que se usa alrededor de todas los formularios del proceso
ResourceSection_PageTemplate_hint=Plantilla utilizada para generar los formularios de entrada
ResourceSection_ErrorTemplate_hint=Dise\u00f1o que se usa para mostrar un mensaje de error
ResourceSection_ViewTemplate_hint=Plantilla utilizada para generar los formularios de resumen
ResourceSection_LoginPage=P\u00e1gina de Autenticaci\u00f3n
Browse=Buscar...
Clear=Limpiar
Remove=Eliminar
File=Agregar archivo...
Folder=Agregar carpeta...
Add=A\u00f1adir
Download=Descargar predeterminado...
Error=Error
up=Arriba
down=Abajo
durationLabel=Duraci\u00f3n
priority=Prioridad
assignTo=Asignado a
sourceParameter=Datos del padre
messageEventAddWizardPageDesc=Un mensaje puede ser enviado a otro proceso.\nPuede agregar data al mensaje con el objetivo de reusar la data cuando el mensaje sea recibido
messageEventAddWizardPageTitle=Agregar Mensaje
messageEventAddWizardPageName=Nombre de P\u00e1gina de Evento de Mensaje
removeEventConfirmTitle=Est Seguro ?
removeEventConfirmMessage=Realmente desea borrar el(los) evento(s) \:
selectMessageEventLabel=Capturar Mensaje
messageFlowEventChoice=Seleccionar Mensaje
eventType_messageStart=Mensaje de Inicio
eventType_messageEnd=Mensaje Fin
eventType_intermediateCatch=Capturar Mensaje
eventType_intermediateThrow=Lanzar Mensaje
messageEventType=Tipo Mensaje
editCondition=Editar...
timerCondition=Condici\u00f3n de temporizador
timerConditionWizardTitle=Editar la condici\u00f3n de temporizador
eventNameLabel=Elemento destino
processNameLabel=Proceso
isMandatory=Es requerido
addTargetEventDialogTitle=Agregar Evento Destino
gotoLabel=Ir a
fromLinksLabel=Desde enlaces
linkType=Tipo de Enlace
catchLink=Capturar enlace
throwLink=Lanzar Enlace
selectSignalEventLabel=Se\u00f1al
testBeforeLabel=Probar Antes
testAfterLabel=Probar Despu\u00e9s
loopConditionLabel=Condici\u00f3n de Bucle
maximumLoopLabel=Ciclos m\u00e1ximos
noneLabel=Ninguno
optionalLabel=(Opcional)
confirmationMessage=Mensaje de confirmaci\u00f3n
localTemplate=Aplicar Aspecto
name=Nombre
version=Versi\u00f3n
selectLocalTemplateWizardPageTitle=Seleccione una Plantilla Web
selectLocalTemplateWizardPageDescription=Seleccione una Plantilla Web de la lista anterior
webTemplates=Plantillas Web
saveAsTemplate_title=Guardar como plantilla
saveAsTemplate_templateLabel=Nombre de plantilla
saveAsTemplate_previewPathLabel=Vista Previa
ResourceSection_SaveAsTemplate=Guardar como plantilla
Edit=Editar...
ResourceSection_importTemplate=Importar...
ResourceSection_export=Exportar...
ResourceSection_ViewTemplate=P\u00e1gina de consulta Global
StepSummarySectionContribution_title=Resumen de Tareas
save=Guardar
gatwetypeInclusive=Inclusivo
ResourceSection_AutoLogin=Auto login
ResourceSection_AutoLoginTooltip=Marque esta opci\u00f3n para saltar el inicio de sesi\u00f3n para un usuario espec\u00edfico (puede ser utilizado para el acceso an\u00f3nimo)
showLabel=T\u00edtulo din\u00e1mico
errorEvent_error=Error Asociado
endErrorEvent_error=C\u00f3digo de error
mustBeSet=Se debe establecer
errorEvent_errorCodeHint=Este es el c\u00f3digo del error que ser\u00e1 lanzado
errorEvent_errorCodeCatchHint=Este es el c\u00f3digo del error que se capturar\u00e1, si no se establece ning\u00fan c\u00f3digo de error se capturar\u00e1 todo tipo de error (incluso errores de los conectores)
january=Enero
february=Febrero
march=Marzo
april=Abril
may=Mayo
june=Junio
july=Julio
august=Agosto
september=Septiembre
october=Octubre
november=Noviembre
december=Diciembre
monday=Lunes
tuesday=Martes
wednesday=Mi\u00e9rcoles
thursday=Jueves
friday=Viernes
saturday=S\u00e1bado
sunday=Domingo
dynamicLabelHint=Usted puede personalizar la etiqueta de esta tarea que se muestra en el userXp (por ejemplo\: Validar Solicitud de ${loggedUser} )
dynamicDescriptionHint=Usted puede personalizar la descripci\u00f3n de la tarea mostrada en el userXp (por ejemplo\: ${loggedUser} est\u00e1 solicitando tomar ${nbDays} d\u00edas de vacaciones)
stepSummaryHint=Usted puede personalizar la descripci\u00f3n despu\u00e9s de la finalizaci\u00f3n de esta tarea que se muestra en el userXp (por ejemplo\: la solicitud de ${loggedUser} ha sido aceptada por ${managerName})
executionTimeHint=Tiempo asignado a esta tarea. Se utiliza en el userXP para detectar las tareas "en riesgo" y "atrasados".
targetProcessMessageHint=Elija un proceso existente o introduzca el nombre del proceso destino
targetEventMessageHint=Elija un evento de capturaci\u00f3n de mensaje existente o una tarea de recepci\u00f3n o introduzca un nombre
signalEvent_catchHint=Es el c\u00f3digo de la se\u00f1al que se capturar\u00e1
signalEvent_throwHint=Es el c\u00f3digo de la se\u00f1al que se lanzar\u00e1
confirmDeleteFile_title=\u00bfEst\u00e1 seguro?
confirmDeleteFile_msg=Borrando los ficheros seleccionados , desea continuar?
pageFlow=Formulario Web
skip=Omitir
pageFlowTransientDataConnectors=Conectores de inicializaci\u00f3n de dato
pageFlowTransientData=Datos transitorios
messageEventAddWizardNameAlreadyExists=El nombre ya existe
formsTabLabel=Formularios
transientDatTabLabel=Datos transitorios
chooseFont=Escojer Letra...
ChooseFigure=Seleccione una figura existente...
applyStyle=Aplicar mismo estilo
activityType_callActivity=Actividad de Llamada
skipPageFlowTooltip=Si habilitado, la tarea actuara en modo auto-enviar \: El usuario abre el formulario de la pagina, lo que resultara en ejecutar la tarea. No es lo mismo que una Tarea Abstracta
activityType_abstractTask=Abstracta
GeneralSection_ActivateValidation=Activar validaci\u00f3n
ResourceSection_OverWrite_title=\u00bfEst\u00e1 seguro?
ResourceSection_OverWrite_msg=Apariencia actual  se perder\u00e1 en la configuraci\u00f3n aplicada al proceso.
saveAsTemplate_error=No se puede guardar sus personalizaciones como un look ' sentir. Por favor, compruebe los registros.
saveAsTemplate_import_error=No se puede importar la apariencia. Por favor, compruebe los registros.
confirmationPathTooltip=Usted puede poner una plantilla de confirmaci\u00f3n s\u00f3lo si hay un flujo de pagina.
confirmationMessageTooltip=Usted puede poner una plantilla de confirmaci\u00f3n s\u00f3lo si hay un flujo de pagina.
ResourceSection_BasedOnLookAndFeel=Actualmente se basa en\:
widgetRemovedWarning_title=Advertencia
widgetRemovedWarning_msg=Se eliminar\u00e1 el widget no olvide sacar su dise\u00f1o modificado para requisitos particulares tambi\u00e9n\!
autoMap=Mapa automatico
autoMap_description=Mapea por nombre de variable y tipo de dato. Utiliza el contrato del proceso llamado.
addMessageContent=Contenido del mensaje
correlation=Correlaci\u00f3n entre instancias
correlationDescription=Utiliza la correlaci\u00f3n si necesita coordinar instancias especificas de dos procesos.
useCorrelationkeys=Use la correlaci\u00f3n por clave
AddCorrelation=A\u00f1adir
removeCorrelation=Eliminar
removeMessageContent=Eliminar
addMessageContentButton=A\u00f1adir
addMessageContentDescription=Puedes dejar el contenido de este mensaje vac\u00edo para sincronizar instancias entre dos procesos.\nPara seleccionar instancias especificas, use el panel "Correlaci\u00f3n entre instancias".
autoFillMessageContent=Auto-llenado
useExpression=Use la expresi\u00f3n
useDecisionTable=Utilizar la tabla de decisi\u00f3n
editDecisionTable=Editar la tabla de decisi\u00f3n...
and=Y
takeTransition=Tomar la Transici\u00f3n
dontTakeTransition=No tomar la transici\u00f3n
emptyName=El nombre est\u00e1 vac\u00edo
operationExplanation=Una operaci\u00f3n actualiza el valor de una variable despu\u00e9s de que la tarea se haya realizado. Las operaciones se ejecutan en el orden que aparecen. \u26a0 La operaci\u00f3n de eliminar debe definirse en una actividad dedicada. Otras operaciones que recrean o actualizan la variable deben ser manipuladas en una actividad separada.
highestPriority=Mayor
lowestPriority=Menor
underNormalPriority=bajo
aboveNormalPriority=alto
normalPriority=Normal
transitionOrderingExplanation=El orden de las transiciones determina c\u00f3mo se eval\u00faa la Compuerta. Cada transici\u00f3n tiene una condici\u00f3n. Estas condiciones se eval\u00faan en orden, y se toma la primera transici\u00f3n donde su condici\u00f3n sea 'true'. Si ninguna condici\u00f3n es cierta, se toma la transici\u00f3n por defecto. Para definir las condiciones de una transici\u00f3n, seleccione la transici\u00f3n y vaya al panel de detalles, ficha General, panel General.
transitionOrderingExplanation_Short=Con el fin de determinar qu\u00e9 flujo saliente de secuencia para activar, las condiciones se eval\u00faan en el orden especificado a continuaci\u00f3n.
AddSimple=Agregar...
description=Descripci\u00f3n
calledProcessVersionHint=Si la expresi\u00f3n esta en blanco o regresa nulo se utilizar\u00e1 la \u00faltima versi\u00f3n implementada
avoidElement=Evitar elementos
avoidElementHint=Evitar elementos usando la ruta m\u00e1s corta
clearSelection=Desactive la selecci\u00f3n de la casilla seleccionar
multiInstance_completionConditionLabel=Condici\u00f3n de culminaci\u00f3n temprana
multiInstance_completionConditionDescription=Opcional, cuando verdadero, los casos restantes no se ejecutar\u00e1n.
dublicateIdErrorMessage={0} id ya existe en la tabla {1}
messageContentIdExistenceWarning={0} id no est\u00e1 definido en mensaje {1}
NoIncomingMessageWarning=No hay ning\u00fan mensaje entrante en el proyecto
correlationKey=Clave de correlaci\u00f3n
correlationKeyHelp=Puedes definir hasta 5 claves de correlaci\u00f3n. El nombre de la clave y su valor son concatenados y el resultado se almacena en BD. El resultado no puede ser mayor de 128 car\u00e1cteres.
correlationValue=Valor de correlaci\u00f3n
messageContentID=Item de contenido
expressionName=Valor
generalPropertiesSectionDescription=Nombrar y describir el elemento seleccionado del diagrama.
diagramSectionDescription=Dar un nombre, una versi\u00f3n y una descripci\u00f3n al diagrama.
catchMessageContentEventSectionDescription=Un mensaje es la informaci\u00f3n enviada desde una tarea de enviar o lanzar mensaje evento en otro grupo. Definir c\u00f3mo gestionar los datos contenidos en este mensaje. El mensaje debe definirse ya en una tarea de enviar o lanzar mensaje de evento.
catchMessageEventCorrelationSectionDescription=Teclas de correlaci\u00f3n se utilizan para verificar que se recibe un mensaje enviado desde una tarea de enviar la tarea de recibir de la instancia de proceso relevantes. Definir c\u00f3mo manejar las llaves de correlaci\u00f3n contenidas en un mensaje que se recibe. Las llaves deben definirse ya en una tarea de enviar.
laneSectionDescription=Una senda es una subdivisi\u00f3n de un proceso. Las sendas se utilizan generalmente para tareas de grupo que se llevan a cabo por un grupo funcional o parte de una organizaci\u00f3n. Esto significa que todas las tareas en la senda pueden asignarse al mismo agente. Por lo tanto, es una buena pr\u00e1ctica nombrar la senda con el nombre del actor o del  grupo funcional. Tambi\u00e9n puede dar una descripci\u00f3n.
looknfeelPropertySectionDescription=Una definici\u00f3n de look'n'feel establece el dise\u00f1o y el estilo de formularios creados con el dise\u00f1ador de formularios 6.x.\nPuede modificar una plantilla existente o modificar el c\u00f3digo HTML.
resourcePropertySectionDescription=Estos recursos son los archivos utilizados por la interfaz de usuario de un proceso 6.x.
userXPSectionDescription=Esta es la informaci\u00f3n que aparece sobre una tarea en el Portal. La duraci\u00f3n estimada de la tarea se utiliza para calcular el tiempo restante es necesario para la tarea despu\u00e9s de que ha comenzado. Si no se especifica la informaci\u00f3n del Portal, se utilizan el nombre y la descripci\u00f3n en el panel General.
confirmationPropertySectionDescription=Se muestra un mensaje de confirmaci\u00f3n al final de una secuencia de pasos realizados por un usuario, mostrando que no hay m\u00e1s acciones son necesarias.
loopSectionDescription=Iteraci\u00f3n significa que una actividad de tarea o llamada se ejecuta varias veces hasta que se cumple una condici\u00f3n. Especifique la condici\u00f3n como una expresi\u00f3n o un n\u00famero de iteraciones. Para ejecutar varias instancias de la tarea al mismo tiempo, controlar m\u00faltiples instancias. Para ejecutar varias instancias de la tarea una tras otra, utilice el Bucle. Para ejecutar la tarea una vez (sin iteraci\u00f3n) marque Ninguno. Para ejecutar varias instancias de la tarea una tras otra, puede utilizar M\u00faltiples instancias o bucle.
exportSuccessfullTitle=Exportar resultado
exportSuccessfullMsg=Look ' sentir exportado con \u00e9xito.
exporting=Exportando ...
importResultTitle=Resultado de la importaci\u00f3n
importSuccessMsg=Aperiencia exportada con \u00e9xito.
oneCorrelationAtLeastNeeded=Debe especificar al menos una clave de correlaci\u00f3n.
valueShouldBeDefined=Un valor debe ser definido por ID {0}.
idShouldBeDefined=Debe definirse un id para el valor {0}.
conditionExpresssionHelpMessage=Ejemplos \: myvariable>500 ; \!isValid ; parameter1\=\=parameter2 ; etc
messagesSectionDescription=Una activaci\u00f3n autom\u00e1tica de mensajes "Send Task" o "Throw Message Event" env\u00eda mensajes para recibir tareas o Catch Eventos de mensajes de otros grupos. Defina los mensajes que se env\u00edan a otros grupos, como las teclas de correlaci\u00f3n y los datos contenidos en los mensajes.
minutes=Minutos
every=Cada
minuteLabel=minuto (s)
hourly=Por hora
daily=Diariamente
weekly=Semanalmente
monthly=Mensualmente
yearly=Anualmente
generateCronButtonLabel=Generar la expresi\u00f3n cron
at=En
hourLabel=hora (s)
startTime=Hora de inicio
everyWeekDay=Todos los d\u00edas de la semana
dayLabel=d\u00eda (s)
day=D\u00eda
ofEvery=de todos los
monthLabel=mes (es)
the=El
first=Primero
second=Segundo
third=Tercero
fourth=Cuarto
fifth=Quinto
of=de
startTimerConditionDescription=Define una condici\u00f3n de tiempo de inicio basada en un periodo, un fecha fija o una duraci\u00f3n.\nLa evaluaci\u00f3n de los periodos y las duraciones se har\u00e1 cuando el proceso este activado.
timerConditionDescription=Define una condici\u00f3n de temporizador basada en un periodo, un fecha fija o una duraci\u00f3n.\nLa evaluaci\u00f3n de los periodos y las duraciones se har\u00e1 cuando el proceso este activado.
startTimerConditionHint=Se esperaba una expresi\u00f3n cron (periodo), una java.util.Date (fecha fija) o un java.lang.Long (duraci\u00f3n)
timerConditionHint=Se esperaba una java.util.Date (fecha fija) o un java.lang.Long (duraci\u00f3n)
cronShortDescription=Basado en una expresi\u00f3n cron. <A href\="{0}">?</A>
invalidCronExpression=Expresi\u00f3n cron inv\u00e1lida
mustBeAnValueBetween=Debe ser un valor entre {0} y {1}.
notAValidNumber=No es un n\u00famero valido
mustBeGreaterThan=Debe ser mayor que {0}
cantBeGreaterThan=No puede ser mayor de {0}
cycle=Periodo
fixedDate=Fecha determinada
selectDateLabel=Seleccione una fecha fija
basedOn=Condici\u00f3n de temporizador basado en un
generateFixedDateLabel=Generar la expresi\u00f3n de fecha fija
selectDurationLabel=Seleccione una duraci\u00f3n
generateDurationLabel=Generar la expresi\u00f3n de duraci\u00f3n
notAValidInput=El valor [{0}] no es una entrada valida
errorDisplayLabelMaxLength=El texto es demasiado largo. El n\u00famero m\u00e1ximo de caracteres es {0}.
warningDisplayLabelMaxLength=El n\u00famero m\u00e1ximo de caracteres es {0} para la muestra de etiqueta, {1} para descripciones.
expressionCantBeEmpty=El contenido de la expresion no puede esta vacio
wiget=Widget
mandatory=Requerido
readOnly=Solo lectura
renamingDiagram=Renombrando diagrama...
standardLoop=Bucle est\u00e1ndar
parallelMultinstantition=Multi-instanciaci\u00f3n paralela
sequentialMultinstantition=Multi-instanciaci\u00f3n secuencial
dataBasedInstanceLabel=Crear instancias de una lista
definedNumberOfInstanceLabel=Crear un n\u00famero definido de instancias
input=Entrada
output=salida
numberOfInstancesToCreate=N\u00famero de instancias a crear
inputList=Lista
inputListHint=Lista o variable "m\u00faltiple" de la cual se generar\u00e1n las instancias.
outputList=Lista de resultados anexados
iterator=Iterador
iteratorHint=Referencia que toma el valor de cada elemento en la lista para crear una instancia.
outputData=Datos del resultado en cada instancia
storeOutputResult=Almacenar los resultados
type=Tipo
typeHint=Debe ser compatible con el tipo lista.
createForm_desc=Introduce el nombre y descripci\u00f3n del formulario. Seleccione los datos a mostrar y actualizar en el formulario. Haga click en las pesta\u00f1a para cambiar entre Datos de Proceso y Datos de Negocio. Elija el tupo de widget, dependiendo del tipo de atributo.
noBusinessDataAvailable=No hay Datos de Negocio disponibles.
noProcessDataAvailable=No hay Datos de Proceso disponibles.
generateInitialValueForBusinessData=Generar los valores iniciales del widget desde los atributos del Objeto de Negocio.
generateInitialValueForBusinessDataHint= El Dato de Negocio debe ser inicializado antes de mostrarse en el formulario.
processData=Variables de proceso
businessData=Variables de negocio
assignToContractInput=Asignado a la entrada de contrato
assignToData=Asignado a un dato
targetParameterForOutput=Dato de destino en el proceso llamado
targetParameterForInput=Destino en el proceso llamado
sectionDescriptionOverviewForm=Modo heredado para compatibilidad con versiones anteriores. \nPuede mantener un resumen existente aqu\u00ed hasta que sea migrado. \nPuede crear un resumen utilizando las herramientas tradicionales, pero recomendamos utilizar el UI Designer para crear cualquier nuevo Resumen. \nTambi\u00e9n hay una p\u00e1gina de resumen predeterminada disponible si selecciona el tipo de UI Designer. Si utiliza un flujo de p\u00e1gina de Resumen 6.x, vaya a Ejecuci\u00f3n > p\u00e1gina y seleccione el tipo de 6.x
sectionDescriptionEntryForm=Modo heredado para compatibilidad con versiones anteriores. \nPuede mantener los formularios existentes aqu\u00ed hasta que sean migrados. \nPuede crear un formulario mediante la herramienta heredada, pero recomendamos crear un contrato y usar el dise\u00f1ador de interfaz de usuario UI Designer para crear cualquier nuevo formulario. \nSi utiliza un formulario 6.x, vaya a Ejecuci\u00f3n > Formulario y seleccione el tipo 6.x
sectionDescriptionProcessEntryForm=Modo heredado para compatibilidad con versiones anteriores. \nPuede mantener los formularios existentes aqu\u00ed hasta que sean migrados. \nPuede crear un formulario mediante la herramienta heredada, pero recomendamos crear un contrato y usar el dise\u00f1ador de interfaz de usuario UI Designer para crear cualquier nuevo formulario. \nSi utiliza un formulario 6.x, vaya a Ejecuci\u00f3n > Formulario de instanciaci\u00f3n y seleccione el tipo 6.x
processScopeVariableWarning=S\u00f3lo las variables en el \u00e1mbito de proceso pueden ser utilizadas en expresiones m\u00e1s abajo
dataFromRootProcess=Datos del proceso ra\u00edz
dataInCalledProcess=Datos en el proceso llamado
dataFromCalledProcess= Datos del proceso llamado
dataInRootProcess=Datos en el proceso ra\u00edz
dataToSendSectionDescription=Defina aqu\u00ed los datos que pasar al proceso llamado. Estas son las variables o expresiones en el proceso ra\u00edz (al que pertenece esta actividad de llamada) que pasar a las entradas de contrato o variables en el proceso llamado. 'Recuperar el contrato' agrega autom\u00e1ticamente las asignaciones para las entradas de contrato del proceso llamado. Una vez ejecutado, puede actualizar sus resultados. Tambi\u00e9n se puede definir la asignaci\u00f3n manualmente.
dataToRecieveSectionDescription=Defina aqu\u00ed los datos que recuperar del proceso llamado una vez terminada la instancia. Estas son las variables del proceso llamado para asignar a las variables del proceso ra\u00edz (al que pertenece esta actividad de llamada).
configureDataToSend=Configure los datos para enviar >>
fetchContract=Recuperar el contrato
processNotFoundExcpetion=El proceso {0} ({1}) no se ha encontrado en el proyecto.
latest=M\u00e1s reciente
noProcessToCallDefined=No existe ning\u00fan proceso definido para llamar en la actividad de llamada ''{0}''.
noContractDefinedException=Ning\u00fan contrato de instanciaci\u00f3n definido para el proceso {0} ({1}).
dueDateCalculation=C\u00e1lculo de la fecha de caducidad
dueDateCalculationHint=Definir la duraci\u00f3n (en mili-segundos) entre cuando la tarea est\u00e1 lista y cuando est\u00e1 vencida.
displayName=T\u00edtulo din\u00e1mico
poolSectionDescription=La Pool es el elemento gr\u00e1fico de BPMN que define un proceso en Bonita. Debe tener un nombre \u00fanico en el proyecto.
poolNameHint=Un nombre t\u00e9cnico \u00fanico
aNameMustBeSet=Debe establecerse un nombre
maxNameLength=La longitud del nombre no puede exceder los %s caracteres
maxDescriptionLength=La longitud de la descripci\u00f3n no puede exceder los %s caracteres
aVersionMustBeSet=Debe establecerse una versi\u00f3n
maxVersionLength=La versi\u00f3n no puede exceder %s caracteres
technicalNameTooltip=Nombre t\u00e9cnico
maxDisplayNameLength=La longitud del nombre mostrado no puede exceder los %s caracteres
displayNameCaption=Si no se define, se utilizar\u00e1 el nombre
displayNameTooltip=El nombre del proceso mostrado a los usuarios del Bonita Portal. Est\u00e1tico.