GeneralSection_Name=\u540d\u524d
GeneralSection_Description=\u8aac\u660e
GeneralSection_Version=\u30d0\u30fc\u30b8\u30e7\u30f3
defaultFlowLabel=\u30c7\u30d5\u30a9\u30eb\u30c8\u30fb\u30b7\u30fc\u30b1\u30f3\u30b9\u30d5\u30ed\u30fc
activityType=\u30bf\u30b9\u30af\u30fb\u30bf\u30a4\u30d7
activityType_task=\u30d2\u30e5\u30fc\u30de\u30f3 \u30bf\u30b9\u30af
activityType_receiveTask=\u53d7\u4fe1
activityType_sendTask=\u9001\u4fe1
activityType_serviceTask=\u30b5\u30fc\u30d3\u30b9
activityType_scriptTask=\u30b9\u30af\u30ea\u30d7\u30c8
gatwetypeAnd=\u30d1\u30e9\u30ec\u30eb (AND)
gatwetypeXor=\u6392\u4ed6\uff08XOR\uff09
gatewayType=\u30b2\u30fc\u30c8\u30a6\u30a7\u30a4\u30fb\u30bf\u30a4\u30d7
newCategory=\u65b0\u898f\u30ab\u30c6\u30b4\u30ea\u30fc
estimatadExecutionTimeLabel=\u63a8\u5b9a\u6240\u8981\u6642\u9593
dynamicLabelLabel=\u8868\u793a\u540d
dynamicDescriptionLabel=\u30bf\u30b9\u30af\u306e\u8aac\u660e
dataNameLabel=\u540d\u524d *
dataDescriptionLabel=\u8aac\u660e
datatypeLabel=\u30c7\u30fc\u30bf\u578b
defaultValueLabel=\u30c7\u30d5\u30a9\u30eb\u30c8\u5024
updateConnector=\u7de8\u96c6...
removeConnector=\u524a\u9664
addConnector=\u8ffd\u52a0...
removeConnectorConfirmTitle=\u3053\u308c\u3089\u306e\u30b3\u30cd\u30af\u30bf\u3092\u524a\u9664\u3057\u307e\u3059\u304b\uff1f
removeConnectorConfirmMessage=\u4ee5\u4e0b\u306e\u30b3\u30cd\u30af\u30bf\u3092\u524a\u9664\u3057\u307e\u3059\u3002\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\uff1a
connectorAdd_tooltip=\u3053\u306e\u30bf\u30b9\u30af\u306b\u8ffd\u52a0\u3057\u307e\u3059
createForm_title=\u30d5\u30a9\u30fc\u30e0\u306e\u540d\u524d\u3068\u8aac\u660e\u3092\u5165\u529b\u3057\u307e\u3059\u3002
createForm_defaultName=\u30d5\u30a9\u30fc\u30e0
createForm_noData=\u3053\u306e\u30bf\u30b9\u30af\u306b\u306f\u30c7\u30fc\u30bf\u304c\u3042\u308a\u307e\u305b\u3093\u3002\u7a7a\u306e\u30d5\u30a9\u30fc\u30e0\u3092\u4f5c\u6210\u3059\u308b\u305f\u3081\u306b\u306f\u3001\u300c\u5b8c\u4e86\u300d\u3092\u30af\u30ea\u30c3\u30af\u3057\u307e\u3059\u3002
error_allreadyExists=\u540c\u3058\u540d\u524d\u3092\u6301\u3064\u30d5\u30a9\u30fc\u30e0\u304c\u65e2\u306b\u5b58\u5728\u3057\u307e\u3059
error_empty=\u540d\u524d\u306e\u30d5\u30a3\u30fc\u30eb\u30c9\u306f\u7a7a\u306b\u3067\u304d\u307e\u305b\u3093
duplicateForm_desc=\u65b0\u3057\u3044\u30d5\u30a9\u30fc\u30e0\u3092\u4f5c\u6210\u3059\u308b\u304b\u3001 \u3042\u308b\u3044\u306f\u30ea\u30b9\u30c8\u306e1 \u3064\u3092\u8907\u88fd\u3057\u307e\u3059
duplicateForm_title=\u65b0\u898f\u30d5\u30a9\u30fc\u30e0
duplicateForm_radioCreate=\u65b0\u3057\u3044\u30d5\u30a9\u30fc\u30e0\u3092\u4f5c\u6210\uff08\u300c\u6b21\u3078 \u300d\u30af\u30ea\u30c3\u30af\u3057\u3066\u30d5\u30a9\u30fc\u30e0\u521d\u671f\u5316\u3067\u4f7f\u7528\u3059\u308b\u30c7\u30fc\u30bf\u3092\u9078\u629e\u3057\u307e\u3059\uff09\u3002
duplicateForm_radioDuplicate=\u4ee5\u4e0b\u306e\u30ea\u30b9\u30c8\u304b\u3089\u30d5\u30a9\u30fc\u30e0\u3092\u8907\u88fd\u3057\u307e\u3059
addForm=\u8ffd\u52a0...
addFormTitle=\u30d5\u30a9\u30fc\u30e0\u3092\u8ffd\u52a0...
removeForm=\u524a\u9664
editForm=\u7de8\u96c6
formUp=\u4e0a\u3078
formDown=\u4e0b\u3078
selectAll=\u3059\u3079\u3066\u9078\u629e
formRemoveFormCommand=\u9078\u629e\u3057\u305f\u30d5\u30a9\u30fc\u30e0\u3092\u524a\u9664
FormsSection_wizardVarsGroup_Title=\u30d9\u30fc\u30b9\u306e\u30a6\u30a3\u30b8\u30a7\u30c3\u30c8\u3092\u8ffd\u52a0...
FormsSection_wizardVarsGroup_Tooltip=\u30d5\u30a9\u30fc\u30e0\u306b\u6301\u3061\u305f\u3044\u30c7\u30fc\u30bf\u3092\u9078\u629e\u3057\u307e\u3059
FormsSection_ConfirmationTemplate=\u78ba\u8a8d\u306e\u30ec\u30a4\u30a2\u30a6\u30c8
subprocess=\u30b5\u30d6\u30d7\u30ed\u30bb\u30b9
connectionConnection=\u6761\u4ef6
ResourceSection_ProcessTemplate=\u30d7\u30ed\u30bb\u30b9\u306e\u30ec\u30a4\u30a2\u30a6\u30c8
ResourceSection_PageTemplate=\u5165\u529b\u30d5\u30a9\u30fc\u30e0 \u30da\u30fc\u30b8 \u30c6\u30f3\u30d7\u30ec\u30fc\u30c8
ResourceSection_ErrorTemplate=\u30a8\u30e9\u30fc\u306e\u30ec\u30a4\u30a2\u30a6\u30c8
ResourceSection_ProcessTemplate_hint=\u30d7\u30ed\u30bb\u30b9\u306e\u3059\u3079\u3066\u306e\u30d5\u30a9\u30fc\u30e0\u306b\u4f7f\u7528\u3055\u308c\u308b\u30ec\u30a4\u30a2\u30a6\u30c8
ResourceSection_PageTemplate_hint=\u30d5\u30a9\u30fc\u30e0\u306e\u5165\u529b\u30da\u30fc\u30b8\u306e\u751f\u6210\u306b\u4f7f\u7528\u3059\u308b\u30c6\u30f3\u30d7\u30ec\u30fc\u30c8
ResourceSection_ErrorTemplate_hint=\u30a8\u30e9\u30fc\u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u8868\u793a\u306b\u4f7f\u7528\u3055\u308c\u308b\u30ec\u30a4\u30a2\u30a6\u30c8
ResourceSection_ViewTemplate_hint=\u30d5\u30a9\u30fc\u30e0\u306e\u8868\u793a\u30da\u30fc\u30b8\u306e\u751f\u6210\u306b\u4f7f\u7528\u3059\u308b\u30c6\u30f3\u30d7\u30ec\u30fc\u30c8
ResourceSection_LoginPage=\u30ed\u30b0\u30a4\u30f3 \u30da\u30fc\u30b8
Browse=\u53c2\u7167...
Clear=\u30af\u30ea\u30a2
Remove=\u524a\u9664
File=\u30d5\u30a1\u30a4\u30eb\u3092\u8ffd\u52a0...
Folder=\u30d5\u30a9\u30eb\u30c0\u3092\u8ffd\u52a0...
Add=\u8ffd\u52a0
Download=\u30c7\u30d5\u30a9\u30eb\u30c8\u3092\u30c0\u30a6\u30f3\u30ed\u30fc\u30c9...
Error=\u30a8\u30e9\u30fc
up=\u4e0a\u3078
down=\u4e0b\u3078
durationLabel=\u671f\u9593
priority=\u512a\u5148\u5ea6
assignTo=>>>\u30de\u30c3\u30d4\u30f3\u30b0>>>
sourceParameter=\u89aa\u30c7\u30fc\u30bf
messageEventAddWizardPageDesc=\u30e1\u30c3\u30bb\u30fc\u30b8\u306f\u3001\u5225\u306e\u30d7\u30fc\u30eb\u306b\u9001\u4fe1\u3055\u308c\u307e\u3059\u3002\n\u8ee2\u9001\u5148\u306e\u30d7\u30fc\u30eb\u3067\u4f7f\u7528\u3059\u308b\u30c7\u30fc\u30bf\u3092\u3053\u3053\u3067\u8ffd\u52a0\u3057\u307e\u3059\u3002
messageEventAddWizardPageTitle=\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u8ffd\u52a0
messageEventAddWizardPageName=\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30a4\u30d9\u30f3\u30c8\u306e\u30da\u30fc\u30b8\u540d
removeEventConfirmTitle=\u3088\u308d\u3057\u3044\u3067\u3059\u304b\uff1f
removeEventConfirmMessage=\u524a\u9664\u3059\u308b\u30a4\u30d9\u30f3\u30c8\u3067\u3059\u3002\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\uff1a
selectMessageEventLabel=\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30ad\u30e3\u30c3\u30c1\u30fb\u30a4\u30d9\u30f3\u30c8
messageFlowEventChoice=\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u9078\u629e
eventType_messageStart=\u30e1\u30c3\u30bb\u30fc\u30b8\u958b\u59cb\u30a4\u30d9\u30f3\u30c8
eventType_messageEnd=\u30e1\u30c3\u30bb\u30fc\u30b8\u7d42\u4e86\u30a4\u30d9\u30f3\u30c8
eventType_intermediateCatch=\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30ad\u30e3\u30c3\u30c1\u30fb\u30a4\u30d9\u30f3\u30c8
eventType_intermediateThrow=\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30b9\u30ed\u30fc\u30fb\u30a4\u30d9\u30f3\u30c8
messageEventType=\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30bf\u30a4\u30d7
editCondition=\u7de8\u96c6...
timerCondition=\u30bf\u30a4\u30de\u30fc\u6761\u4ef6
timerConditionWizardTitle=\u30bf\u30a4\u30de\u30fc\u6761\u4ef6\u3092\u7de8\u96c6
eventNameLabel=\u30bf\u30fc\u30b2\u30c3\u30c8\u8981\u7d20
processNameLabel=\u30bf\u30fc\u30b2\u30c3\u30c8\u306e\u30d7\u30fc\u30eb
isMandatory=\u306f\u5fc5\u9808\u3067\u3059\u3002
addTargetEventDialogTitle=\u30bf\u30fc\u30b2\u30c3\u30c8\u306e\u30a4\u30d9\u30f3\u30c8\u3092\u8ffd\u52a0
gotoLabel=\u30ea\u30f3\u30af\u5148
fromLinksLabel=\u30ea\u30f3\u30af\u5143
linkType=\u30ea\u30f3\u30af\u30fb\u30bf\u30a4\u30d7
catchLink=\u30ad\u30e3\u30c3\u30c1\u30fb\u30ea\u30f3\u30af
throwLink=\u30b9\u30ed\u30fc\u30fb\u30ea\u30f3\u30af
selectSignalEventLabel=\u30b7\u30b0\u30ca\u30eb
testBeforeLabel=\u6700\u521d\u306b\u6761\u4ef6\u3092\u8a55\u4fa1
testAfterLabel=\u6700\u5f8c\u306b\u6761\u4ef6\u3092\u8a55\u4fa1
loopConditionLabel=Loop while \u6761\u4ef6
maximumLoopLabel=\u6700\u5927\u30eb\u30fc\u30d7\u6570
noneLabel=\uff1c\u306a\u3057\uff1e
optionalLabel=\uff08\u7701\u7565\u53ef\u80fd\uff09
confirmationMessage=\u78ba\u8a8d\u30e1\u30c3\u30bb\u30fc\u30b8
localTemplate=\u30eb\u30c3\u30af\uff06\u30d5\u30a3\u30fc\u30eb\u3092\u9069\u7528
name=\u540d\u524d
version=\u30d0\u30fc\u30b8\u30e7\u30f3
selectLocalTemplateWizardPageTitle=Web\u30c6\u30f3\u30d7\u30ec\u30fc\u30c8\u3092\u9078\u629e
selectLocalTemplateWizardPageDescription=\u4e0a\u8a18\u306e\u30ea\u30b9\u30c8\u304b\u3089\u3001\u5b9a\u7fa9\u6e08\u307f\u306eweb\u30c6\u30f3\u30d7\u30ec\u30fc\u30c8\u3092\u9078\u629e\u3057\u307e\u3059
webTemplates=Web\u30c6\u30f3\u30d7\u30ec\u30fc\u30c8
saveAsTemplate_title=\u65b0\u898f\u30eb\u30c3\u30af\uff06\u30d5\u30a3\u30fc\u30eb\u3068\u3057\u3066\u4fdd\u5b58
saveAsTemplate_templateLabel=\u30c6\u30f3\u30d7\u30ec\u30fc\u30c8\u540d
saveAsTemplate_previewPathLabel=\u30d7\u30ec\u30d3\u30e5\u30fc
ResourceSection_SaveAsTemplate=\u65b0\u898f\u30eb\u30c3\u30af\uff06\u30d5\u30a3\u30fc\u30eb\u3068\u3057\u3066\u4fdd\u5b58
Edit=\u7de8\u96c6...
ResourceSection_importTemplate=\u30a4\u30f3\u30dd\u30fc\u30c8...
ResourceSection_export=\u30a8\u30af\u30b9\u30dd\u30fc\u30c8...
ResourceSection_ViewTemplate=\u30d5\u30a9\u30fc\u30e0 \u30da\u30fc\u30b8 \u30c6\u30f3\u30d7\u30ec\u30fc\u30c8\u306e\u69cb\u6210\u8a2d\u5b9a
StepSummarySectionContribution_title=\u5b8c\u4e86\u5f8c\u306e\u8aac\u660e
save=\u4fdd\u5b58
gatwetypeInclusive=\u5305\u542b\uff08OR\uff09
ResourceSection_AutoLogin=\u81ea\u52d5\u30ed\u30b0\u30a4\u30f3
ResourceSection_AutoLoginTooltip=\u533f\u540d\u30a2\u30af\u30bb\u30b9\u306e\u305f\u3081\u306b\u30ed\u30b0\u30a4\u30f3\u3092\u30b9\u30ad\u30c3\u30d7\u3059\u308b\u5834\u5408\u3001\u3053\u306e\u30aa\u30d7\u30b7\u30e7\u30f3\u3092\u30aa\u30f3\u3057\u307e\u3059
showLabel=\u8868\u793a\u540d
errorEvent_error=\u95a2\u9023\u3059\u308b\u30a8\u30e9\u30fc
endErrorEvent_error=\u30a8\u30e9\u30fc\u30b3\u30fc\u30c9
mustBeSet=\u8a2d\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059
errorEvent_errorCodeHint=\u3053\u308c\u306f\u3001\u30b9\u30ed\u30fc\u3055\u308c\u308b\u30a8\u30e9\u30fc\u30b3\u30fc\u30c9\u3067\u3059
errorEvent_errorCodeCatchHint=\u3053\u308c\u306f\u3001\u30a8\u30e9\u30fc\u30b3\u30fc\u30c9\u304c\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u306a\u3044\u5834\u5408\u306b\u30ad\u30e3\u30c3\u30c1\u3055\u308c\u308b\u30a8\u30e9\u30fc\u30b3\u30fc\u30c9\u3067\u3059\u3002\uff08\u30b3\u30cd\u30af\u30bf\u304b\u3089\u306e\u30a8\u30e9\u30fc\u3092\u542b\u3080\uff09\u3059\u3079\u3066\u306e\u7a2e\u985e\u306e\u30a8\u30e9\u30fc\u304c\u30ad\u30e3\u30c3\u30c1\u3055\u308c\u307e\u3059\u3002
january=1\u6708
february=2\u6708
march=3\u6708
april=4\u6708
may=5\u6708
june=6\u6708
july=7\u6708
august=8\u6708
september=9\u6708
october=10\u6708
november=11\u6708
december=12\u6708
monday=\u6708\u66dc\u65e5
tuesday=\u706b\u66dc\u65e5
wednesday=\u6c34\u66dc\u65e5
thursday=\u6728\u66dc\u65e5
friday=\u91d1\u66dc\u65e5
saturday=\u571f\u66dc\u65e5
sunday=\u65e5\u66dc\u65e5
dynamicLabelHint=\u30dd\u30fc\u30bf\u30eb\u306b\u8868\u793a\u3055\u308c\u308b\u3053\u306e\u30bf\u30b9\u30af\u306e\u30e9\u30d9\u30eb\u3092\u30ab\u30b9\u30bf\u30de\u30a4\u30ba\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059
dynamicDescriptionHint=\u30dd\u30fc\u30bf\u30eb\u306b\u8868\u793a\u3055\u308c\u308b\u3053\u306e\u30bf\u30b9\u30af\u306e\u8aac\u660e\u3092\u30ab\u30b9\u30bf\u30de\u30a4\u30ba\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059
stepSummaryHint=\u30dd\u30fc\u30bf\u30eb\u306b\u8868\u793a\u3055\u308c\u308b\u3053\u306e\u30bf\u30b9\u30af\u306e\u5b8c\u4e86\u5f8c\u306e\u8aac\u660e\u3092\u30ab\u30b9\u30bf\u30de\u30a4\u30ba\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059
executionTimeHint=\u3053\u306e\u30bf\u30b9\u30af\u306b\u30a2\u30b5\u30a4\u30f3\u3055\u308c\u3066\u3044\u308b\u6642\u9593\u3002\u30dd\u30fc\u30bf\u30eb\u3067\u6b8b\u308a\u6642\u9593\u3092\u8868\u793a\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u307e\u3059
targetProcessMessageHint=\u65e2\u5b58\u306e\u30d7\u30ed\u30bb\u30b9\u3092\u9078\u629e\u3059\u308b\u304b\u3001\u30bf\u30fc\u30b2\u30c3\u30c8\u306e\u30d7\u30ed\u30bb\u30b9\u306e\u540d\u524d\u3092\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044
targetEventMessageHint=\u65e2\u5b58\u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30ad\u30e3\u30c3\u30c1\u30fb\u30a4\u30d9\u30f3\u30c8\u307e\u305f\u306f\u53d7\u4fe1\u30bf\u30b9\u30af\u3092\u9078\u629e\u3057\u3066\u540d\u524d\u3092\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044
signalEvent_catchHint=\u3053\u308c\u306f\u3001\u30ad\u30e3\u30c3\u30c1\u3055\u308c\u308b\u30b7\u30b0\u30ca\u30eb\u306e\u30b3\u30fc\u30c9\u3067\u3059
signalEvent_throwHint=\u3053\u308c\u306f\u3001\u30b9\u30ed\u30fc\u3055\u308c\u308b\u30b7\u30b0\u30ca\u30eb\u306e\u30b3\u30fc\u30c9\u3067\u3059
confirmDeleteFile_title=\u3088\u308d\u3057\u3044\u3067\u3059\u304b\uff1f
confirmDeleteFile_msg=\u9078\u629e\u3057\u305f\u30d5\u30a1\u30a4\u30eb\u306f\u524a\u9664\u3055\u308c\u307e\u3059\u3002\u7d9a\u884c\u3057\u3066\u3088\u308d\u3057\u3044\u3067\u3059\u304b\uff1f
pageFlow=\u30da\u30fc\u30b8\u30d5\u30ed\u30fc
skip=\u30b9\u30ad\u30c3\u30d7
pageFlowTransientDataConnectors=\u30c7\u30fc\u30bf\u521d\u671f\u5316\u7528\u306e\u30b3\u30cd\u30af\u30bf
pageFlowTransientData=\u4e00\u6642\u7684\u306a\u30c7\u30fc\u30bf
messageEventAddWizardNameAlreadyExists=\u3053\u306e\u540d\u524d\u306f\u65e2\u306b\u5b58\u5728\u3057\u307e\u3059
formsTabLabel=\u30d5\u30a9\u30fc\u30e0
transientDatTabLabel=\u4e00\u6642\u7684\u306a\u30c7\u30fc\u30bf
chooseFont=\u30d5\u30a9\u30f3\u30c8\u3092\u9078\u629e...
ChooseFigure=\u65e2\u5b58\u306e\u56f3\u5f62\u3092\u9078\u629e...
applyStyle=\u540c\u3058\u30b9\u30bf\u30a4\u30eb\u3092\u9069\u7528\uff1a
activityType_callActivity=\u30b3\u30fc\u30eb\u30a2\u30af\u30c6\u30a3\u30d3\u30c6\u30a3
skipPageFlowTooltip=\u3053\u308c\u3092\u9078\u629e\u3059\u308b\u3068\u3001\u3053\u306e\u30bf\u30b9\u30af\u306f\u81ea\u52d5\u9001\u4fe1\u306b\u4f3c\u305f\u52d5\u304d\u3092\u3057\u307e\u3059\u3002\n\u3053\u306e\u30bf\u30b9\u30af\u306e\u30da\u30fc\u30b8\u3092\u958b\u304f\u3053\u3068\u3092\u30e6\u30fc\u30b6\u30fc\u306b\u8981\u6c42\u3057\u3066\u3001\u305d\u306e\u30da\u30fc\u30b8\u306f\u81ea\u52d5\u3067\u9001\u4fe1\u3055\u308c\u308b\u3053\u3068\u3092\u610f\u5473\u3057\u307e\u3059\u3002\u3053\u308c\u306f\u62bd\u8c61\u30bf\u30b9\u30af\u3068\u306f\u7570\u306a\u308a\u307e\u3059\u3002
activityType_abstractTask=\u62bd\u8c61
GeneralSection_ActivateValidation=\u691c\u8a3c\u3092\u6709\u52b9\u306b\u3059\u308b
ResourceSection_OverWrite_title=\u3088\u308d\u3057\u3044\u3067\u3059\u304b\uff1f
ResourceSection_OverWrite_msg=\u73fe\u5728\u3001\u30d7\u30ed\u30bb\u30b9\u306b\u9069\u7528\u3055\u308c\u3066\u3044\u308b\u30eb\u30c3\u30af\uff06\u30d5\u30a3\u30fc\u30eb\u306e\u8a2d\u5b9a\u306f\u5931\u308f\u308c\u307e\u3059
saveAsTemplate_error=\u3042\u306a\u305f\u306e\u30ab\u30b9\u30bf\u30de\u30a4\u30ba\u3092\u30eb\u30c3\u30af\uff06\u30d5\u30a3\u30fc\u30eb\u3068\u3057\u3066\u4fdd\u5b58\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3002\n\u3042\u306a\u305f\u306e\u30ed\u30b0\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
saveAsTemplate_import_error=\u30eb\u30c3\u30af\uff06\u30d5\u30a3\u30fc\u30eb\u3092\u30a4\u30f3\u30dd\u30fc\u30c8\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3002\n\u3042\u306a\u305f\u306e\u30ed\u30b0\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
confirmationPathTooltip=\u30da\u30fc\u30b8\u30d5\u30ed\u30fc\u304c\u3042\u308b\u5834\u5408\u306b\u306e\u307f\u3001\u78ba\u8a8d\u30c6\u30f3\u30d7\u30ec\u30fc\u30c8\u3092\u7f6e\u304f\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002
confirmationMessageTooltip=\u30da\u30fc\u30b8\u30d5\u30ed\u30fc\u304c\u3042\u308b\u5834\u5408\u306b\u306e\u307f\u3001\u78ba\u8a8d\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u7f6e\u304f\u3053\u3068\u304c\u3067\u304d\u307e\u3059
ResourceSection_BasedOnLookAndFeel=\u73fe\u5728\u306e\u30d9\u30fc\u30b9\u30fb\u30c6\u30f3\u30d7\u30ec\u30fc\u30c8\uff1a
widgetRemovedWarning_title=\u8b66\u544a
widgetRemovedWarning_msg=\u3042\u306a\u305f\u306e\u30a6\u30a3\u30b8\u30a7\u30c3\u30c8\u306f\u524a\u9664\u3055\u308c\u307e\u3059\u3002\n\u3042\u306a\u305f\u304c\u30ab\u30b9\u30bf\u30de\u30a4\u30ba\u3057\u305f\u30ec\u30a4\u30a2\u30a6\u30c8\u304b\u3089\u3082\u3001\u305d\u308c\u3092\u524a\u9664\u3059\u308b\u3053\u3068\u3092\u5fd8\u308c\u306a\u3044\u3067\u304f\u3060\u3055\u3044 \uff01
autoMap=\u81ea\u52d5\u30de\u30c3\u30d7
autoMap_description=\u5909\u6570\u540d\u3068\u30c7\u30fc\u30bf\u578b\u3067\u30de\u30c3\u30d7\u3057\u307e\u3059\u3002\u30b3\u30fc\u30eb\u3055\u308c\u308b\u30d7\u30ed\u30bb\u30b9\u306e\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002
addMessageContent=\u30e1\u30c3\u30bb\u30fc\u30b8 \u30b3\u30f3\u30c6\u30f3\u30c4
correlation=\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u9593\u306e\u76f8\u4e92\u95a2\u4fc2
correlationDescription=\uff12\u3064\u306e\u30d7\u30ed\u30bb\u30b9\u306e\u7279\u5b9a\u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u3092\u8abf\u6574\u3059\u308b\u5fc5\u8981\u304c\u3042\u308b\u5834\u5408\u306f\u3001\u76f8\u4e92\u95a2\u4fc2\u3092\u4f7f\u7528\u3057\u307e\u3059
useCorrelationkeys=\u30ad\u30fc \u30d9\u30fc\u30b9\u306e\u76f8\u4e92\u95a2\u4fc2\u3092\u4f7f\u7528\u3057\u307e\u3059
AddCorrelation=\u8ffd\u52a0
removeCorrelation=\u524a\u9664
removeMessageContent=\u524a\u9664
addMessageContentButton=\u8ffd\u52a0
addMessageContentDescription=\uff12\u3064\u306e\u30d7\u30ed\u30bb\u30b9 \u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u3092\u540c\u671f\u3059\u308b\u305f\u3081\u306b\u3001\u30e1\u30c3\u30bb\u30fc\u30b8 \u30b3\u30f3\u30c6\u30f3\u30c4\u3092\u7a7a\u306e\u307e\u307e\u306b\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002\n\u7279\u5b9a\u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u3092\u9078\u629e\u3059\u308b\u306b\u306f\u3001\u300c\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u9593\u306e\u76f8\u4e92\u95a2\u4fc2\u300d\u30bf\u30d6\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002
autoFillMessageContent=\u81ea\u52d5\u5165\u529b
useExpression=\u5f0f\u3092\u4f7f\u7528
useDecisionTable=\u30c7\u30b7\u30b8\u30e7\u30f3 \u30c6\u30fc\u30d6\u30eb\u3092\u4f7f\u7528
editDecisionTable=\u30c7\u30b7\u30b8\u30e7\u30f3 \u30c6\u30fc\u30d6\u30eb\u3092\u7de8\u96c6...
and=and
takeTransition=\u9077\u79fb\u3059\u308b
dontTakeTransition=\u9077\u79fb\u3057\u306a\u3044
emptyName=\u540d\u524d\u304c\u7a7a\u3067\u3059
operationExplanation=\u64cd\u4f5c\u306f\u3001\u30a2\u30af\u30c6\u30a3\u30d3\u30c6\u30a3\u306e\u5b9f\u884c\u5f8c\u306b\u5909\u6570\u306e\u5024\u3092\u66f4\u65b0\u3057\u307e\u3059\u3002\u64cd\u4f5c\u306f\u3001\u30ea\u30b9\u30c8\u3055\u308c\u3066\u3044\u308b\u9806\u756a\u3067\u5b9f\u884c\u3055\u308c\u307e\u3059\u3002\u26a0 A \u524a\u9664\u64cd\u4f5c\u306f\u3001\u5c02\u7528\u306e\u30a2\u30af\u30c6\u30a3\u30d3\u30c6\u30a3\u3067\u72ec\u81ea\u306b\u8a2d\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002\u5909\u6570\u3092\u518d\u4f5c\u6210\u3001\u307e\u305f\u306f\u66f4\u65b0\u3059\u308b\u305d\u306e\u4ed6\u306e\u64cd\u4f5c\u306f\u3001\u5225\u306e\u30a2\u30af\u30c6\u30a3\u30d3\u30c6\u30a3\u3067\u51e6\u7406\u3057\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093\u3002
highestPriority=\u6700\u9ad8
lowestPriority=\u6700\u4f4e
underNormalPriority=\u4f4e
aboveNormalPriority=\u9ad8
normalPriority=\u666e\u901a
transitionOrderingExplanation=\u30b7\u30fc\u30b1\u30f3\u30b9\u30d5\u30ed\u30fc\u306e\u9806\u5e8f\u306f\u3001\u30b2\u30fc\u30c8\u30a6\u30a7\u30a4\u304b\u3089\u6d41\u51fa\u3059\u308b\u30b7\u30fc\u30b1\u30f3\u30b9\u30d5\u30ed\u30fc\u306e\u3044\u305a\u308c\u304c\u6709\u52b9\u306b\u306a\u308b\u304b\u3067\u6c7a\u307e\u308a\u307e\u3059\u3002\u5404\u30b7\u30fc\u30b1\u30f3\u30b9\u30d5\u30ed\u30fc\u306f\u6761\u4ef6\u3092\u6301\u3063\u3066\u3044\u307e\u3059\u3002\u3053\u308c\u3089\u306e\u6761\u4ef6\u304c\u9806\u756a\u306b\u8a55\u4fa1\u3055\u308c\u3001\u771f\u3067\u3042\u308b\u6761\u4ef6\u3092\u6301\u3064\u30b7\u30fc\u30b1\u30f3\u30b9\u30d5\u30ed\u30fc\u304c\u6700\u521d\u306b\u63a1\u7528\u3055\u308c\u307e\u3059\u3002\u6761\u4ef6\u304c true \u3067\u306f\u306a\u3044\u5834\u5408\u3001\u30c7\u30d5\u30a9\u30eb\u30c8\u30fb\u30b7\u30fc\u30b1\u30f3\u30b9\u30d5\u30ed\u30fc\u304c\u63a1\u7528\u3055\u308c\u307e\u3059\u3002\u30b7\u30fc\u30b1\u30f3\u30b9\u30d5\u30ed\u30fc\u306e\u6761\u4ef6\u3092\u8a2d\u5b9a\u3059\u308b\u306b\u306f\u3001\u30b7\u30fc\u30b1\u30f3\u30b9\u30d5\u30ed\u30fc\u3092\u9078\u629e\u3057\u3001[\u8a73\u7d30] \u30d1\u30cd\u30eb\u3001[\u5168\u822c] \u30bf\u30d6\u3001[\u5168\u822c] \u30da\u30a4\u30f3\u306b\u79fb\u52d5\u3057\u307e\u3059\u3002
transitionOrderingExplanation_Short=\u3069\u306e\u6d41\u51fa\u30b7\u30fc\u30b1\u30f3\u30b9 \u30d5\u30ed\u30fc\u3092\u6709\u52b9\u306b\u3059\u308b\u304b\u3092\u6c7a\u5b9a\u3059\u308b\u305f\u3081\u306b\u3001\u6761\u4ef6\u306f\u4ee5\u4e0b\u306b\u6307\u5b9a\u3057\u305f\u9806\u5e8f\u3067\u8a55\u4fa1\u3055\u308c\u307e\u3059
AddSimple=\u8ffd\u52a0...
description=\u8aac\u660e
calledProcessVersionHint=\u5f0f\u304c\u7a7a\u767d\u307e\u305f\u306f\u623b\u308a \u5024\u304cnull\u306e\u5834\u5408\u306f\u3001\u30c7\u30d7\u30ed\u30a4\u3055\u308c\u305f\u6700\u65b0\u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u304c\u4f7f\u7528\u3055\u308c\u307e\u3059
avoidElement=\u8981\u7d20\u3092\u907f\u3051\u308b
avoidElementHint=\u6700\u77ed\u7d4c\u8def\u3067\u8981\u7d20\u3092\u8fc2\u56de\u3057\u307e\u3059
clearSelection=Select box\u306e\u9078\u629e\u3092\u89e3\u9664\u3057\u307e\u3059
multiInstance_completionConditionLabel=\u65e9\u671f\u5b8c\u4e86\u306e\u6761\u4ef6
multiInstance_completionConditionDescription=\u30aa\u30d7\u30b7\u30e7\u30f3\u3001\uff54rue \u3092\u6307\u5b9a\u3057\u305f\u5834\u5408\u306f\u3001\u6b8b\u308a\u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306f\u5b9f\u884c\u3055\u308c\u307e\u305b\u3093\u3002
dublicateIdErrorMessage={0} \u306e id \u306f\u3001 \u65e2\u306b {1} \u30c6\u30fc\u30d6\u30eb\u306b\u5b58\u5728\u3057\u307e\u3059
messageContentIdExistenceWarning=\ {0} \u306e id \u304c\u30b9\u30ed\u30fc\u3059\u308b\u30e1\u30c3\u30bb\u30fc\u30b8 {1} \u306b\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u307e\u305b\u3093
NoIncomingMessageWarning=There is no incoming message in project
correlationKey=\u76f8\u4e92\u95a2\u4fc2\u30ad\u30fc
correlationKeyHelp=\u6700\u5927\u3067\uff15\u3064\u306e\u76f8\u4e92\u95a2\u4fc2\u30ad\u30fc\u3092\u5b9a\u7fa9\u3067\u304d\u307e\u3059\u3002\u30ad\u30fc\u540d\u3068\u5024\u306f\u9023\u7d50\u3055\u308c\u3001\u305d\u306e\u7d50\u679c\u306f DB \u306b\u683c\u7d0d\u3055\u308c\u307e\u3059\u3002\u305d\u306e\u7d50\u679c\u306f128 \u6587\u5b57\u3092\u8d85\u3048\u3066\u306f\u3044\u3051\u307e\u305b\u3093\u3002
correlationValue=\u76f8\u4e92\u95a2\u4fc2\u30ad\u30fc\u306e\u5024
messageContentID=\u30b3\u30f3\u30c6\u30f3\u30c4\u306e\u9805\u76ee
expressionName=\u5024
generalPropertiesSectionDescription=\u30c0\u30a4\u30a2\u30b0\u30e9\u30e0\u5185\u306e\u9078\u629e\u3057\u305f\u8981\u7d20\u306b\u540d\u524d\u3092\u4ed8\u3051\u3066\u8aac\u660e\u3092\u8a18\u8ff0\u3057\u307e\u3059
diagramSectionDescription=\u3042\u306a\u305f\u306e\u30c0\u30a4\u30a2\u30b0\u30e9\u30e0\u306b\u540d\u524d\u3001\u30d0\u30fc\u30b8\u30e7\u30f3\u3001\u8aac\u660e\u3092\u4e0e\u3048\u307e\u3059
catchMessageContentEventSectionDescription=\u30e1\u30c3\u30bb\u30fc\u30b8\u3068\u306f\u3001\u9001\u4fe1\u30bf\u30b9\u30af\u307e\u305f\u306f\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30b9\u30ed\u30fc\u30fb\u30a4\u30d9\u30f3\u30c8\u304b\u3089\u5225\u306e\u30d7\u30fc\u30eb\u306b\u9001\u4fe1\u3059\u308b\u60c5\u5831\u3067\u3059\u3002\u3053\u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u306b\u542b\u307e\u308c\u308b\u30c7\u30fc\u30bf\u3092\u64cd\u4f5c\u3059\u308b\u65b9\u6cd5\u3092\u5b9a\u7fa9\u3057\u307e\u3059\u3002\u30e1\u30c3\u30bb\u30fc\u30b8\u306f\u3001\u9001\u4fe1\u30bf\u30b9\u30af\u307e\u305f\u306f\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30b9\u30ed\u30fc\u30fb\u30a4\u30d9\u30f3\u30c8\u5185\u306b\u65e2\u306b\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
catchMessageEventCorrelationSectionDescription=\u76f8\u4e92\u95a2\u4fc2\u30ad\u30fc\u306f\u3001\u9001\u4fe1\u30bf\u30b9\u30af\u304b\u3089\u9001\u4fe1\u3055\u308c\u305f\u30e1\u30c3\u30bb\u30fc\u30b8\u304c\u3000\u95a2\u9023\u3059\u308b\u30d7\u30ed\u30bb\u30b9 \u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306e\u53d7\u4fe1\u30bf\u30b9\u30af\u3067\u53d7\u4fe1\u3055\u308c\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002\u53d7\u4fe1\u3055\u308c\u308b\u30e1\u30c3\u30bb\u30fc\u30b8\u5185\u306b\u542b\u307e\u308c\u3066\u3044\u308b\u76f8\u4e92\u95a2\u4fc2\u30ad\u30fc\u306e\u53d6\u308a\u6271\u3044\u65b9\u6cd5\u3092\u5b9a\u7fa9\u3057\u307e\u3059\u3002\u3053\u306e\u30ad\u30fc\u306f\u9001\u4fe1\u30bf\u30b9\u30af\u3067\u65e2\u306b\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
laneSectionDescription=\u30ec\u30fc\u30f3\u3068\u306f\u30d7\u30ed\u30bb\u30b9\u306e\u4e0b\u4f4d\u533a\u5206\u3067\u3059\u3002\u30ec\u30fc\u30f3\u306f\u901a\u5e38\u3001\u6a5f\u80fd\u30b0\u30eb\u30fc\u30d7\u307e\u305f\u306f\u7d44\u7e54\u306e\u4e00\u90e8\u3067\u9042\u884c\u3055\u308c\u3066\u3044\u308b\u30bf\u30b9\u30af\uff08\u4f5c\u696d\uff09\u3092\u30b0\u30eb\u30fc\u30d7\u5316\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002\u3064\u307e\u308a\u3001\u30ec\u30fc\u30f3\u5185\u306e\u3059\u3079\u3066\u306e\u30bf\u30b9\u30af\u306f\u3001\u540c\u3058\u30a2\u30af\u30bf\u30fc\u306b\u30a2\u30b5\u30a4\u30f3\u3059\u308b\u3053\u3068\u3067\u304d\u307e\u3059\u3002\u3057\u305f\u304c\u3063\u3066\u3001\u30a2\u30af\u30bf\u30fc\u3001\u307e\u305f\u306f\u6a5f\u80fd\u30b0\u30eb\u30fc\u30d7\u306e\u540d\u524d\u3092\u4f7f\u3063\u3066\u30ec\u30fc\u30f3\u306b\u540d\u524d\u3092\u4ed8\u3051\u308b\u306e\u304c\u826f\u3044\u6163\u4f8b\u306b\u306a\u308a\u307e\u3059\u3002\u307e\u305f\u3001\u8aac\u660e\u3092\u4e0e\u3048\u308b\u3053\u3068\u3082\u3067\u304d\u307e\u3059\u3002
looknfeelPropertySectionDescription=\u30eb\u30c3\u30af\uff06\u30d5\u30a3\u30fc\u30eb\u306e\u5b9a\u7fa9\u306f\u30016.x \u306e\u30d5\u30a9\u30fc\u30e0 \u30c7\u30b6\u30a4\u30ca\u30fc\u3092\u4f7f\u7528\u3057\u3066\u30d5\u30a9\u30fc\u30e0\u306e\u30ec\u30a4\u30a2\u30a6\u30c8\u3068\u30b9\u30bf\u30a4\u30eb\u3092\u8a2d\u5b9a\u3057\u307e\u3059\u3002\nHTML\u3092\u5909\u66f4\u3059\u308b\u3053\u3068\u306b\u3088\u3063\u3066\u3001\u65e2\u5b58\u306e\u30ec\u30a4\u30a2\u30a6\u30c8\u3084\u30c6\u30f3\u30d7\u30ec\u30fc\u30c8\u3092\u5909\u66f4\u3067\u304d\u307e\u3059\u3002
resourcePropertySectionDescription=\u3053\u308c\u3089\u306e\u30ea\u30bd\u30fc\u30b9\u306f\u30016.x \u30d7\u30ed\u30bb\u30b9\u306b\u30e6\u30fc\u30b6\u30fc \u30a4\u30f3\u30bf\u30fc\u30d5\u30a7\u30a4\u30b9\u304c\u4f7f\u7528\u3059\u308b\u30d5\u30a1\u30a4\u30eb\u3067\u3059\u3002
userXPSectionDescription=\u3053\u308c\u306f\u3001\u30dd\u30fc\u30bf\u30eb\u3067\u306e\u30bf\u30b9\u30af\u306b\u3064\u3044\u3066\u8868\u793a\u3055\u308c\u308b\u60c5\u5831\u3067\u3059\u3002\u30bf\u30b9\u30af\u306e\u63a8\u5b9a\u6642\u9593\u306f\u3001\u30bf\u30b9\u30af\u304c\u958b\u59cb\u3055\u308c\u305f\u5f8c\u306b\u5fc5\u8981\u306a\u6b8b\u308a\u6642\u9593\u3092\u8a08\u7b97\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002\u30dd\u30fc\u30bf\u30eb\u60c5\u5831\u3092\u6307\u5b9a\u3057\u306a\u3044\u5834\u5408\u306f\u3001 [\u5168\u822c] \u30da\u30a4\u30f3\u306e\u8aac\u660e\u3068\u540d\u524d\u304c\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002
confirmationPropertySectionDescription=\u78ba\u8a8d\u30e1\u30c3\u30bb\u30fc\u30b8\u306f\u3001\u3042\u308b\u30e6\u30fc\u30b6\u30fc\u306b\u3088\u3063\u3066\u9042\u884c\u3055\u308c\u305f\u30b9\u30c6\u30c3\u30d7\u306e\u30b7\u30fc\u30b1\u30f3\u30b9\u30d5\u30ed\u30fc\u306e\u7d42\u4e86\u6642\u306b\u8868\u793a\u3055\u308c\u3001\u305d\u308c\u4ee5\u964d\u306e\u30a2\u30af\u30b7\u30e7\u30f3\u304c\u5fc5\u8981\u3067\u306a\u3044\u3053\u3068\u3092\u793a\u3057\u307e\u3059\u3002
loopSectionDescription=\u53cd\u5fa9\u51e6\u7406\u306f\u3001\u6761\u4ef6\u304c\u6e80\u305f\u3055\u308c\u308b\u307e\u3067\u3001\u30bf\u30b9\u30af\u307e\u305f\u306f\u30b3\u30fc\u30eb\u30a2\u30af\u30c6\u30a3\u30d3\u30c6\u30a3\u3092\u7e70\u308a\u8fd4\u3057\u5b9f\u884c\u3059\u308b\u3053\u3068\u3092\u610f\u5473\u3057\u307e\u3059\u3002\u3053\u306e\u6761\u4ef6\u306f\u3001\u5f0f\u307e\u305f\u306f\u53cd\u5fa9\u56de\u6570\u3067\u6307\u5b9a\u3057\u307e\u3059\u3002\u30bf\u30b9\u30af\u306e\u8907\u6570\u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u3092\u540c\u6642\u4e26\u884c\u3067\u5b9f\u884c\u3059\u308b\u5834\u5408\u306f\u3001\u30de\u30eb\u30c1 \u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u3092\u30c1\u30a7\u30c3\u30af\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u30bf\u30b9\u30af\u306e\u8907\u6570\u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u3092\uff11\u3064\uff11\u3064\u9023\u7d9a\u7684\uff08\u30b7\u30fc\u30b1\u30f3\u30b7\u30e3\u30eb\uff09\u306b\u5b9f\u884c\u3059\u308b\u5834\u5408\u306f\u3001\u6a19\u6e96\u7684\u306a\u30eb\u30fc\u30d7\u51e6\u7406\u3092\u30c1\u30a7\u30c3\u30af\u3057\u307e\u3059\u3002\u30bf\u30b9\u30af\u3092\u4e00\u5ea6 \uff08\u7e70\u308a\u8fd4\u3057\u306a\u3057\uff09\u3060\u3051\u5b9f\u884c\u3059\u308b\u5834\u5408\u3070\u3001\u300c\u306a\u3057\u300d\u3092\u30c1\u30a7\u30c3\u30af\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u30bf\u30b9\u30af\u306e\u8907\u6570\u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u3092\uff11\u3064\uff11\u3064\u5b9f\u884c\u3059\u308b\u306b\u306f\u3001\u30de\u30eb\u30c1 \u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306e\u30b7\u30fc\u30b1\u30f3\u30b7\u30e3\u30eb\u51e6\u7406\u3001\u307e\u305f\u306f\u30eb\u30fc\u30d7\u51e6\u7406\u3092\u4f7f\u7528\u3067\u304d\u307e\u3059\u3002
exportSuccessfullTitle=\u7d50\u679c\u3092\u30a8\u30af\u30b9\u30dd\u30fc\u30c8\u3057\u307e\u3059
exportSuccessfullMsg=\u30eb\u30c3\u30af\uff06\u30d5\u30a3\u30fc\u30eb\u306f\u6b63\u5e38\u306b\u30a8\u30af\u30b9\u30dd\u30fc\u30c8\u3055\u308c\u307e\u3057\u305f\u3002
exporting=\u30a8\u30af\u30b9\u30dd\u30fc\u30c8\u3057\u3066\u3044\u307e\u3059...
importResultTitle=\u30a4\u30f3\u30dd\u30fc\u30c8\u7d50\u679c
importSuccessMsg=\u30eb\u30c3\u30af\uff06\u30d5\u30a3\u30fc\u30eb\u306f\u6b63\u5e38\u306b\u30a4\u30f3\u30dd\u30fc\u30c8\u3055\u308c\u307e\u3057\u305f\u3002
oneCorrelationAtLeastNeeded=\u5c11\u306a\u304f\u3068\u3082 1 \u3064\u306e\u76f8\u4e92\u95a2\u4fc2\u30ad\u30fc\u3092\u6307\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
valueShouldBeDefined=Id {0} \u306e\u5024\u3092\u5b9a\u7fa9\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
idShouldBeDefined=\u5024 {0} \u306b\u5bfe\u3057\u3066Id \u3092\u5b9a\u7fa9\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
conditionExpresssionHelpMessage=\u4f8b \: myvariable>500 ; \!isValid ; parameter1\=\=parameter2 ; \u7b49
messagesSectionDescription=\u9001\u4fe1\u30bf\u30b9\u30af\u307e\u305f\u306f\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30b9\u30ed\u30fc\u30fb\u30a4\u30d9\u30f3\u30c8\u306f\u3001\u4ed6\u306e\u30d7\u30fc\u30eb\u5185\u306e\u53d7\u4fe1\u30bf\u30b9\u30af\u3001\u307e\u305f\u306f\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30ad\u30e3\u30c3\u30c1\u30fb\u30a4\u30d9\u30f3\u30c8\u306b\u30e1\u30c3\u30bb\u30fc\u30b8\u9001\u4fe1\u3057\u307e\u3059\u3002\u4ed6\u306e\u30d7\u30fc\u30eb\u3078\u9001\u4fe1\u3055\u308c\u308b\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u3001\u76f8\u4e92\u95a2\u4fc2\u30ad\u30fc\u304a\u3088\u3073\u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u30b3\u30f3\u30c6\u30f3\u30c4\u306b\u542b\u307e\u308c\u3066\u308b\u30c7\u30fc\u30bf\u3092\u542b\u3081\u3066\u5b9a\u7fa9\u3057\u307e\u3059\u3002
minutes=\u5206
every=\u6bce
minuteLabel=\u5206\u3054\u3068
hourly=\u6bce\u6642
daily=\u6bce\u65e5
weekly=\u6bce\u9031
monthly=\u6bce\u6708
yearly=\u6bce\u5e74
generateCronButtonLabel=cron\u5f0f\u3092\u751f\u6210
at=\u6642\u523b
hourLabel=\u6642\u9593\u3054\u3068
startTime=\u958b\u59cb\u6642\u523b
everyWeekDay=\u3059\u3079\u3066\u306e\u66dc\u65e5
dayLabel=\u65e5\u3054\u3068
day=\u65e5
ofEvery=/ \u6bce
monthLabel=\u30f6\u6708\u3054\u3068
the=\ 
first=\u6700\u521d\u306e\u884c
second=\u7b2c\uff12
third=\u7b2c\uff13
fourth=\u7b2c\uff14
fifth=\u7b2c\uff15
of=\u65e5\u76ee/
startTimerConditionDescription=\u30b5\u30a4\u30af\u30eb\u3001\u56fa\u5b9a\u65e5\u4ed8\u307e\u305f\u306f\u671f\u9593\u306b\u57fa\u3065\u3044\u3066\u958b\u59cb\u6761\u4ef6\u3092\u5b9a\u7fa9\u3057\u307e\u3059\u3002\u30b5\u30a4\u30af\u30eb\u3068\u671f\u9593\u306e\u8a55\u4fa1\u304c\u6709\u52b9\u306b\u306a\u3063\u305f\u3068\u304d\u3001\u30d7\u30ed\u30bb\u30b9\u304c\u958b\u59cb\u3057\u307e\u3059\u3002
timerConditionDescription=\u30b5\u30a4\u30af\u30eb\u3001\u56fa\u5b9a\u65e5\u4ed8\u307e\u305f\u306f\u671f\u9593\u306b\u57fa\u3065\u3044\u3066\u30bf\u30a4\u30de\u30fc\u6761\u4ef6\u3092\u5b9a\u7fa9\u3057\u307e\u3059\u3002\u30b5\u30a4\u30af\u30eb\u3068\u671f\u9593\u306e\u8a55\u4fa1\u304c\u6709\u52b9\u306b\u306a\u3063\u305f\u3068\u304d\u3001\u30d7\u30ed\u30bb\u30b9\u304c\u958b\u59cb\u3057\u307e\u3059\u3002
startTimerConditionHint=cron \u5f0f \uff08\u30b5\u30a4\u30af\u30eb\uff09\u3001java.util.Date \uff08\u56fa\u5b9a\u65e5\u4ed8\uff09 \u307e\u305f\u306f\u3001java.lang.Long \uff08\u671f\u9593\uff09 \u304c\u5fc5\u8981\u3067\u3059
timerConditionHint=java.util.Date \uff08\u56fa\u5b9a\u65e5\u6642\uff09 \u307e\u305f\u306f\u3001java.lang.Long \uff08\u671f\u9593\uff09 \u304c\u5fc5\u8981\u3067\u3059
cronShortDescription=cron \u5f0f\u3067\u8a2d\u5b9a\u3057\u307e\u3059\u3002<A href\="{0}">?</A>
invalidCronExpression=\u7121\u52b9\u306acron\u5f0f
mustBeAnValueBetween={0} \u3068 {1} \u306e\u9593\u306e\u5024\u3067\u3042\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
notAValidNumber=\u6709\u52b9\u306a\u6570\u5024\u3067\u306f\u306a\u3044\u3067\u3059
mustBeGreaterThan={0} \u3088\u308a\u5927\u304d\u304f\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093
cantBeGreaterThan={0} \u3088\u308a\u5927\u304d\u304f\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093
cycle=\u30b5\u30a4\u30af\u30eb
fixedDate=\u56fa\u5b9a\u65e5\u4ed8
selectDateLabel=\u56fa\u5b9a\u65e5\u4ed8\u3092\u9078\u629e
basedOn=\u30bf\u30a4\u30de\u30fc\u6761\u4ef6\u306b\u57fa\u304f\u5f0f\uff1a
generateFixedDateLabel=\u56fa\u5b9a\u65e5\u4ed8\u306e\u8868\u73fe\u5f0f\u3092\u751f\u6210
selectDurationLabel=\u671f\u9593\u3092\u9078\u629e
generateDurationLabel=\u671f\u9593\u306e\u8868\u73fe\u5f0f\u3092\u751f\u6210
notAValidInput=\u5024 [{0}] \u306f\u6709\u52b9\u306a\u5165\u529b\u3067\u306f\u3042\u308a\u307e\u305b\u3093
errorDisplayLabelMaxLength=\u8868\u793a\u30c6\u30ad\u30b9\u30c8\u304c\u9577\u3059\u304e\u307e\u3059\u3002\u6700\u5927\u6587\u5b57\u6570\u306f {0} \u3067\u3059\u3002
warningDisplayLabelMaxLength=\u8868\u793a\u30e9\u30d9\u30eb\u306e\u6700\u5927\u6587\u5b57\u6570\u306f{0} \u3001\u8aac\u660e\u306f{1} \u3067\u3059\u3002
expressionCantBeEmpty=\u5f0f\u306e\u30b3\u30f3\u30c6\u30f3\u30c4\u306f\u7a7a\u306b\u3067\u304d\u307e\u305b\u3093
wiget=\u30a6\u30a3\u30b8\u30a7\u30c3\u30c8
mandatory=\u5fc5\u9808
readOnly=\u8aad\u307f\u53d6\u308a\u5c02\u7528
renamingDiagram=\u30c0\u30a4\u30a2\u30b0\u30e9\u30e0\u540d\u3092\u5909\u66f4...
standardLoop=\u6a19\u6e96\u7684\u306a\u30eb\u30fc\u30d7
parallelMultinstantition=\u30d1\u30e9\u30ec\u30eb\uff08\u4e26\u884c\u51e6\u7406\uff09\u306e\u30de\u30eb\u30c1 \u30a4\u30f3\u30b9\u30bf\u30f3\u30b9
sequentialMultinstantition=\u30b7\u30fc\u30b1\u30f3\u30b7\u30e3\u30eb\uff08\u9806\u6b21\u51e6\u7406\uff09\u306e\u30de\u30eb\u30c1 \u30a4\u30f3\u30b9\u30bf\u30f3\u30b9
dataBasedInstanceLabel=\u30ea\u30b9\u30c8\u304b\u3089\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u3092\u4f5c\u6210\u3057\u307e\u3059
definedNumberOfInstanceLabel=\u5b9a\u7fa9\u3057\u305f\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u6570\u3092\u4f5c\u6210\u3057\u307e\u3059
input=\u5165\u529b
output=\u51fa\u529b
numberOfInstancesToCreate=\u4f5c\u6210\u3059\u308b\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u6570
inputList=\u30ea\u30b9\u30c8
inputListHint=\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u304b\u3089\u30ea\u30b9\u30c8\u3001\u307e\u305f\u306f\u300c\u8907\u6570\u300d\u306e\u5909\u6570\u304c\u751f\u6210\u3055\u308c\u307e\u3059\u3002
outputList=\u8ffd\u52a0\u3057\u305f\u7d50\u679c\u306e\u30ea\u30b9\u30c8
iterator=\u30a4\u30c6\u30ec\u30fc\u30bf
iteratorHint=\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u3092\u751f\u6210\u3059\u308b\u305f\u3081\u306b\u30ea\u30b9\u30c8\u306e\u5404\u9805\u76ee\u5024\u3092\u53d6\u5f97\u3059\u308b\u53c2\u7167\u3002
outputData=\u5404\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u304b\u3089\u306e\u7d50\u679c\u30c7\u30fc\u30bf
storeOutputResult=\u51fa\u529b\u7d50\u679c\u3092\u4fdd\u5b58
type=\u30bf\u30a4\u30d7
typeHint=\u30ea\u30b9\u30c8\u578b\u3068\u4e92\u63db\u6027\u304c\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093\u3002
createForm_desc=\u30d5\u30a9\u30fc\u30e0\u306e\u540d\u524d\u3068\u8aac\u660e\u3068\u3092\u5165\u529b\u3057\u307e\u3059\u3002\u30d5\u30a9\u30fc\u30e0\u3067\u8868\u793a\uff0f\u66f4\u65b0\u3059\u308b\u30c7\u30fc\u30bf\u3092\u9078\u629e\u3057\u307e\u3059\u3002\u30d7\u30ed\u30bb\u30b9 \u30c7\u30fc\u30bf\u3068\u30d3\u30b8\u30cd\u30b9 \u30c7\u30fc\u30bf\u3092\u5207\u308a\u66ff\u3048\u308b\u30bf\u30d6\u3092\u30af\u30ea\u30c3\u30af\u3057\u307e\u3059\u3002\u5c5e\u6027\u306e\u578b\u306b\u3088\u3063\u3066\u3001\u30a6\u30a3\u30b8\u30a7\u30c3\u30c8\u306e\u30bf\u30a4\u30d7\u3092\u9078\u629e\u3057\u307e\u3059\u3002
noBusinessDataAvailable=\u5229\u7528\u53ef\u80fd\u306a\u30d3\u30b8\u30cd\u30b9 \u30c7\u30fc\u30bf\u304c\u3042\u308a\u307e\u305b\u3093\u3002
noProcessDataAvailable=\u5229\u7528\u53ef\u80fd\u306a\u30d7\u30ed\u30bb\u30b9 \u30c7\u30fc\u30bf\u304c\u3042\u308a\u307e\u305b\u3093\u3002
generateInitialValueForBusinessData=\u30d3\u30b8\u30cd\u30b9 \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306e\u5c5e\u6027\u304b\u3089\u30a6\u30a3\u30b8\u30a7\u30c3\u30c8\u306e\u521d\u671f\u5024\u3092\u751f\u6210\u3057\u307e\u3059\u3002
generateInitialValueForBusinessDataHint= \u30d3\u30b8\u30cd\u30b9 \u30c7\u30fc\u30bf\u306f\u30d5\u30a9\u30fc\u30e0\u3092\u8868\u793a\u3059\u308b\u524d\u306b\u521d\u671f\u5316\u3055\u308c\u3066\u3044\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
processData=\u30d7\u30fc\u30eb\u5909\u6570
businessData=\u30d3\u30b8\u30cd\u30b9\u5909\u6570
assignToContractInput=\u5165\u529b\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u306b\u30a2\u30b5\u30a4\u30f3
assignToData=\u30d7\u30ed\u30bb\u30b9\u5909\u6570\u306b\u30a2\u30b5\u30a4\u30f3
targetParameterForOutput=\u30b3\u30fc\u30eb\u3055\u308c\u305f\u30d7\u30ed\u30bb\u30b9\u306e\u5bfe\u8c61\u30c7\u30fc\u30bf
targetParameterForInput=\u30b3\u30fc\u30eb\u3055\u308c\u305f\u30d7\u30ed\u30bb\u30b9\u306e\u5bfe\u8c61\u30c7\u30fc\u30bf
sectionDescriptionOverviewForm=\u4e0b\u4f4d\u4e92\u63db\u7528\u306e\u30ec\u30ac\u30b7\u30fc \u30e2\u30fc\u30c9\u3002\n\u30de\u30a4\u30b0\u30ec\u30fc\u30c8\u3055\u308c\u308b\u307e\u3067\u3001\u3053\u3053\u3067\u65e2\u5b58\u306e\u6848\u4ef6\u6982\u6cc1\u30da\u30fc\u30b8\u3092\u30e1\u30f3\u30c6\u30ca\u30f3\u30b9\u3067\u304d\u307e\u3059\u3002\n\u30ec\u30ac\u30b7\u30fc\u30c4\u30fc\u30eb\u3092\u4f7f\u7528\u3057\u3066\u6848\u4ef6\u6982\u6cc1\u30da\u30fc\u30b8\u3092\u4f5c\u6210\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u304c\u3001UI \u30c7\u30b6\u30a4\u30ca\u30fc\u3092\u4f7f\u7528\u3057\u3066\u65b0\u3057\u3044\u6848\u4ef6\u6982\u6cc1\u30da\u30fc\u30b8\u3092\u4f5c\u6210\u3059\u308b\u3053\u3068\u3092\u63a8\u5968\u3057\u307e\u3059\u3002\nUI \u30c7\u30b6\u30a4\u30ca\u30fc\u306e\u7a2e\u985e\u3092\u9078\u629e\u3057\u305f\u5834\u5408\u306f\u3001\u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u6848\u4ef6\u6982\u6cc1\u30da\u30fc\u30b8\u3082\u4f7f\u7528\u53ef\u80fd\u3067\u3059\u30026.x \u306e\u6848\u4ef6\u6982\u6cc1\u30da\u30fc\u30b8\u30d5\u30ed\u30fc\u3092\u4f7f\u7528\u3059\u308b\u5834\u5408\u306f\u3001[\u5b9f\u884c] -> [\u6848\u4ef6\u6982\u6cc1\u30da\u30fc\u30b8] \u306b\u9032\u3093\u3067 6.x \u306e\u30bf\u30a4\u30d7\u3092\u9078\u629e\u3057\u307e\u3059\u3002
sectionDescriptionEntryForm=\u4e0b\u4f4d\u4e92\u63db\u7528\u306e\u30ec\u30ac\u30b7\u30fc \u30e2\u30fc\u30c9\u3002\n\u30de\u30a4\u30b0\u30ec\u30fc\u30c8\u3055\u308c\u308b\u307e\u3067\u3001\u3053\u3053\u3067\u65e2\u5b58\u306e\u30d5\u30a9\u30fc\u30e0\u3092\u30e1\u30f3\u30c6\u30ca\u30f3\u30b9\u3067\u304d\u307e\u3059\u3002\n\u30ec\u30ac\u30b7\u30fc\u30c4\u30fc\u30eb\u3092\u4f7f\u7528\u3057\u3066\u30d5\u30a9\u30fc\u30e0\u3092\u4f5c\u6210\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u304c\u3001\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u3092\u4f5c\u6210\u3057\u3001UI \u30c7\u30b6\u30a4\u30ca\u30fc\u3092\u4f7f\u7528\u3057\u3066\u65b0\u3057\u3044\u30d5\u30a9\u30fc\u30e0\u3092\u4f5c\u6210\u3059\u308b\u3053\u3068\u3092\u63a8\u5968\u3057\u307e\u3059\u30026.x \u30d5\u30a9\u30fc\u30e0\u3092\u4f7f\u7528\u3059\u308b\u5834\u5408\u306f\u3001[\u5b9f\u884c] -> [\u30d5\u30a9\u30fc\u30e0] \u306b\u9032\u3093\u3067 6.x \u306e\u30bf\u30a4\u30d7\u3092\u9078\u629e\u3057\u307e\u3059\u3002
sectionDescriptionProcessEntryForm=\u4e0b\u4f4d\u4e92\u63db\u7528\u306e\u30ec\u30ac\u30b7\u30fc \u30e2\u30fc\u30c9\u3002\n\u30de\u30a4\u30b0\u30ec\u30fc\u30c8\u3055\u308c\u308b\u307e\u3067\u3001\u3053\u3053\u3067\u65e2\u5b58\u306e\u30d5\u30a9\u30fc\u30e0\u3092\u30e1\u30f3\u30c6\u30ca\u30f3\u30b9\u3067\u304d\u307e\u3059\u3002\n\u30ec\u30ac\u30b7\u30fc\u30c4\u30fc\u30eb\u3092\u4f7f\u7528\u3057\u3066\u30d5\u30a9\u30fc\u30e0\u3092\u4f5c\u6210\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u304c\u3001\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u3092\u4f5c\u6210\u3057\u3001UI \u30c7\u30b6\u30a4\u30ca\u30fc\u3092\u4f7f\u7528\u3057\u3066\u65b0\u3057\u3044\u30d5\u30a9\u30fc\u30e0\u3092\u4f5c\u6210\u3059\u308b\u3053\u3068\u3092\u63a8\u5968\u3057\u307e\u3059\u30026.x \u30d5\u30a9\u30fc\u30e0\u3092\u4f7f\u7528\u3059\u308b\u5834\u5408\u306f\u3001[\u5b9f\u884c] -> [\u8d77\u6848\u30d5\u30a9\u30fc\u30e0] \u306b\u9032\u3093\u3067 6.x \u306e\u30bf\u30a4\u30d7\u3092\u9078\u629e\u3057\u307e\u3059\u3002
processScopeVariableWarning=\u30d7\u30ed\u30bb\u30b9 \u30b9\u30b3\u30fc\u30d7\u306e\u5909\u6570\u3060\u3051\u304c\u4e0b\u8a18\u306e\u6761\u4ef6\u5f0f\u3067\u4f7f\u7528\u3067\u304d\u307e\u3059
dataFromRootProcess=\u30eb\u30fc\u30c8 \u30d7\u30ed\u30bb\u30b9\u304b\u3089\u306e\u30c7\u30fc\u30bf
dataInCalledProcess=\u30b3\u30fc\u30eb\u3055\u308c\u305f\u30d7\u30ed\u30bb\u30b9\u5185\u306e\u30c7\u30fc\u30bf
dataFromCalledProcess= \u30b3\u30fc\u30eb\u3055\u308c\u305f\u30d7\u30ed\u30bb\u30b9\u304b\u3089\u306e\u30c7\u30fc\u30bf
dataInRootProcess=\u30eb\u30fc\u30c8 \u30d7\u30ed\u30bb\u30b9\u5185\u306e\u30c7\u30fc\u30bf
dataToSendSectionDescription=\u30b3\u30fc\u30eb\u3057\u305f\u30d7\u30ed\u30bb\u30b9\u306b\u6e21\u3059\u30c7\u30fc\u30bf\u3092\u3053\u3053\u3067\u5b9a\u7fa9\u3057\u307e\u3059\u3002\u3053\u308c\u3089\u306f\u3001\u30eb\u30fc\u30c8 \u30d7\u30ed\u30bb\u30b9\uff08\u3053\u306e\u30b3\u30fc\u30eb\u30a2\u30af\u30c6\u30a3\u30d3\u30c6\u30a3\u304c\u5c5e\u3059\u308b\u30d7\u30ed\u30bb\u30b9\uff09\u5185\u306e\u5909\u6570\u307e\u305f\u306f\u5f0f\u3067\u3042\u308a\u3001\u5165\u529b\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u307e\u305f\u306f\u547c\u3073\u51fa\u3055\u308c\u308b\u30d7\u30ed\u30bb\u30b9\u5185\u306e\u5909\u6570\u306b\u30de\u30c3\u30d7\u3057\u307e\u3059\u3002\u300c\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u3092\u53d6\u5f97\u300d\u306f\u547c\u3073\u51fa\u3055\u308c\u308b\u30d7\u30ed\u30bb\u30b9\u306e\u5165\u529b\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u3068\u306e\u30de\u30c3\u30d4\u30f3\u30b0\u3092\u81ea\u52d5\u3067\u8ffd\u52a0\u3057\u307e\u3059\u3002\u4e00\u5ea6\u5b9f\u884c\u3057\u305f\u5f8c\u3067\u3001\u305d\u306e\u7d50\u679c\u3092\u5909\u66f4\u3067\u304d\u307e\u3059\u3002\u3053\u306e\u30de\u30c3\u30d4\u30f3\u30b0\u3092\u624b\u52d5\u3067\u5b9a\u7fa9\u3059\u308b\u3053\u3068\u3082\u3067\u304d\u307e\u3059\u3002
dataToRecieveSectionDescription=\u30b3\u30fc\u30eb\u3057\u305f\u30d7\u30ed\u30bb\u30b9\u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u5b8c\u4e86\u6642\u306b\u305d\u306e\u30d7\u30ed\u30bb\u30b9\u304b\u3089\u53d7\u4fe1\u3059\u308b\u30c7\u30fc\u30bf\u3092\u3053\u3053\u3067\u5b9a\u7fa9\u3057\u307e\u3059\u3002\u3053\u308c\u3089\u306f\u30b3\u30fc\u30eb\u3057\u305f\u30d7\u30ed\u30bb\u30b9\u304b\u3089\u53d7\u4fe1\u3059\u308b\u5909\u6570\u3067\u3001 \u30eb\u30fc\u30c8 \u30d7\u30ed\u30bb\u30b9\uff08\u3053\u306e\u30b3\u30fc\u30eb\u30a2\u30af\u30c6\u30a3\u30d3\u30c6\u30a3\u304c\u5c5e\u3059\u308b\u30d7\u30ed\u30bb\u30b9\uff09\u306e\u5909\u6570\u306b\u30de\u30c3\u30d7\u3057\u307e\u3059\u3002
configureDataToSend=\u9001\u4fe1\u3059\u308b\u30c7\u30fc\u30bf\u3092\u8a2d\u5b9a >>
fetchContract=\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u3092\u53d6\u5f97
processNotFoundExcpetion=Process {0} ({1}) has not been found in project.
latest=\u6700\u65b0
noProcessToCallDefined=\u30b3\u30fc\u30eb\u30a2\u30af\u30c6\u30a3\u30d3\u30c6\u30a3 {0} \u306b\u5b9a\u7fa9\u3057\u305f\u30b3\u30fc\u30eb\u5bfe\u8c61\u30d7\u30ed\u30bb\u30b9\u304c\u3042\u308a\u307e\u305b\u3093\u3002
noContractDefinedException=\u30d7\u30ed\u30bb\u30b9 {0} ({1}) \u306b\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u308b\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u5316\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u304c\u3042\u308a\u307e\u305b\u3093\u3002
dueDateCalculation=\u671f\u9650\u306e\u8a08\u7b97
dueDateCalculationHint=\u30bf\u30b9\u30af\u304c\u30ec\u30c7\u30a3\u72b6\u614b\u306b\u306a\u3063\u3066\u304b\u3089\u305d\u306e\u30bf\u30b9\u30af\u304c\u5b8c\u4e86\u3057\u306a\u3051\u308c\u3070\u306a\u3089\u306a\u3044\u671f\u65e5\u307e\u3067\u306e\u671f\u9593\u3092\u30df\u30ea\u79d2\u5358\u4f4d\u3067\u5b9a\u7fa9\u3057\u307e\u3059\u3002
displayName=\u8868\u793a\u540d
poolSectionDescription=The Pool is the BPMN graphical element defining a process in Bonita. It must have a unique name in the project.
poolNameHint=\u30e6\u30cb\u30fc\u30af\u306a\u6280\u8853\u7684\u306a\u540d\u524d
aNameMustBeSet=\u540d\u524d\u3092\u8a2d\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
maxNameLength=\u540d\u524d\u306e\u9577\u3055\u306f\u3001%s \u6587\u5b57\u3092\u8d85\u3048\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
maxDescriptionLength=\u8aac\u660e\u306e\u9577\u3055\u306f\u3001%s \u6587\u5b57\u3092\u8d85\u3048\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
aVersionMustBeSet=\u30d0\u30fc\u30b8\u30e7\u30f3\u3092\u8a2d\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
maxVersionLength=\u8aac\u660e\u306e\u9577\u3055\u306f\u3001%s \u6587\u5b57\u3092\u8d85\u3048\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
technicalNameTooltip=\u6280\u8853\u7684\u306a\u540d\u524d
maxDisplayNameLength=\u8868\u793a\u540d\u306e\u9577\u3055\u306f\u3001%s \u6587\u5b57\u3092\u8d85\u3048\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
displayNameCaption=\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u306a\u3044\u5834\u5408\u306f\u3001\u540d\u524d\u304c\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002
displayNameTooltip=Bonita \u30dd\u30fc\u30bf\u30eb\u306e\u30e6\u30fc\u30b6\u30fc\u306b\u8868\u793a\u3055\u308c\u308b\u30d7\u30ed\u30bb\u30b9\u306e\u540d\u524d\u3002\u9759\u7684\u3002
searchIndexTypeLabel=\u691c\u7d22\u30ad\u30fc
indexName=\u30e9\u30d9\u30eb
indexValue=\u521d\u671f\u5024
indexSearchDescription=\u30dd\u30fc\u30bf\u30eb\u3067\u4f7f\u7528\u3055\u308c\u308b\u691c\u7d22\u30ad\u30fc\u3092\u5b9a\u7fa9\u3057\u3066\u3001\u305d\u306e\u30ad\u30fc\u306e\u5024\u3067\u7279\u5b9a\u306e\u6848\u4ef6\u3092\u63a2\u3057\u51fa\u3059\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002\u691c\u7d22\u30ad\u30fc\u306f\u3001\u30d7\u30fc\u30eb \u30ec\u30d9\u30eb\uff08\u30d7\u30ed\u30bb\u30b9 \u30ec\u30d9\u30eb\uff09\u3067\u8a2d\u5b9a\u3055\u308c\u307e\u3059\u3002\u305f\u3068\u3048\u3070\u3001\u4fdd\u967a\u91d1\u8acb\u6c42\u3092\u51e6\u7406\u3059\u308b\u30d7\u30ed\u30bb\u30b9\u304c\u3042\u308b\u5834\u5408\u306f\u3001\u7279\u5b9a\u306e\u8acb\u6c42\u306b\u95a2\u9023\u3059\u308b\u6848\u4ef6\u3092\u8acb\u6c42\u756a\u53f7\u3067\u691c\u7d22\u3059\u308b\u305f\u3081\u306b\u306f\u3001\u300c\u8acb\u6c42\u756a\u53f7\u300d\u3068\u3044\u3046\u691c\u7d22\u30ad\u30fc\u3092\u5b9a\u7fa9\u3067\u304d\u307e\u3059\u3002
updatingSearchIndexReferences=\u691c\u7d22\u30ad\u30fc\u306e\u53c2\u7167\u3092\u66f4\u65b0\u3057\u3066\u3044\u307e\u3059...
searchIndexUnicityError={0} \u306f\u65e2\u306b\u5b58\u5728\u3057\u307e\u3059\u3001\u5225\u306e\u540d\u524d\u3092\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044\u3002
