GeneralSection_Name=Name
GeneralSection_Description=Description
GeneralSection_Version=Version
defaultFlowLabel=Fluxo Padr\u00e3o
activityType=Tipo de tarefa
activityType_task=Human
activityType_receiveTask=Receber
activityType_sendTask=Enviar
activityType_serviceTask=Service
activityType_scriptTask=Script
gatwetypeAnd=E
gatwetypeXor=XOR
gatewayType=Tipo de desvio
newCategory=Nova categoria
estimatadExecutionTimeLabel=Tempo de execu\u00e7\u00e3o estimado
dynamicLabelLabel=Display name
dynamicDescriptionLabel=Descri\u00e7\u00e3o din\u00e2mica
dataNameLabel=Name *
dataDescriptionLabel=Description
datatypeLabel=Data type
defaultValueLabel=Default value
updateConnector=Edit...
removeConnector=Remover
addConnector=Add...
removeConnectorConfirmTitle=Remover estes conectores?
removeConnectorConfirmMessage=Tem certeza que deseja remover os seguintes conectores\:
connectorAdd_tooltip=Adicionar a esta tarefa
createForm_title=Criar novo formul\u00e1rio
createForm_defaultName=Form
createForm_noData=Nenhum dado na tarefa, finalize para criar um formul\u00e1rio em branco.
error_allreadyExists=Um formul\u00e1rio com o mesmo nome j\u00e1 existe
error_empty=O nome do campo n\u00e3o pode ser vazio
duplicateForm_desc=Criar novo formul\u00e1rio ou duplicar um da lista
duplicateForm_title=Novo formul\u00e1rio
duplicateForm_radioCreate=Criar um novo formul\u00e1rio (clique em "Pr\u00f3ximo >" para selecionar os dados que ser\u00e3o usados na inicializa\u00e7\u00e3o do formul\u00e1rio.)
duplicateForm_radioDuplicate=Duplicar um formul\u00e1rio da lista abaixo
addForm=Add...
addFormTitle=Adicione formul\u00e1rio...
removeForm=Remover
editForm=Edit
formUp=Acima
formDown=Baixar
selectAll=Select all
formRemoveFormCommand=Remover formul\u00e1rio selecionado
FormsSection_wizardVarsGroup_Title=Adicionar campos correspondente a...
FormsSection_wizardVarsGroup_Tooltip=Selecione os dados que estar\u00e3o presentes no formul\u00e1rio.
FormsSection_ConfirmationTemplate=Formata\u00e7\u00e3o da p\u00e1gina de confirma\u00e7\u00e3o
subprocess=Subprocess
connectionConnection=Condition
ResourceSection_ProcessTemplate=Process layout
ResourceSection_PageTemplate=Entry form page template
ResourceSection_ErrorTemplate=Error layout
ResourceSection_ProcessTemplate_hint=Formata\u00e7\u00e3o utilizada em torno do todos os formul\u00e1rios de processos
ResourceSection_PageTemplate_hint=Modelo utilizado para gerar p\u00e1ginas de entrada de dados
ResourceSection_ErrorTemplate_hint=Formata\u00e7\u00e3o utilizada para exibir mensagens de erro
ResourceSection_ViewTemplate_hint=Modelo utilizado para gerar p\u00e1ginas de formul\u00e1rios de consulta
ResourceSection_LoginPage=P\u00e1gina de conex\u00e3o
Browse=Browse...
Clear=Clear
Remove=Remover
File=Add file...
Folder=Add folder...
Add=Add
Download=Download padr\u00e3o ...
Error=Error
up=Acima
down=Baixar
durationLabel=Duration
priority=Priority
assignTo=Assigned to
sourceParameter=Parent data
messageEventAddWizardPageDesc=Uma mensagem \u00e9 enviada para um outro processo. \nAcrescente aqui os dados a serem reutilizados na recep\u00e7\u00e3o da mensagem.
messageEventAddWizardPageTitle=Adicionar mensagem
messageEventAddWizardPageName=Nome da p\u00e1gina de Evento de Mensagem
removeEventConfirmTitle=Tem certeza ?
removeEventConfirmMessage=Tem certeza que deseja remover o(s) evento(s)\:
selectMessageEventLabel=Catch message
messageFlowEventChoice=Seleccione uma mensagem
eventType_messageStart=Start message
eventType_messageEnd=Mensagem de fim
eventType_intermediateCatch=Catch message
eventType_intermediateThrow=Throw message
messageEventType=Tipo de Mensagem
editCondition=Edit...
timerCondition=Condi\u00e7\u00e3o do evento temporal
timerConditionWizardTitle=Editar a condi\u00e7\u00e3o do evento temporal
eventNameLabel=Elemento destino
processNameLabel=Processo destino
isMandatory=Obrigat\u00f3rio
addTargetEventDialogTitle=Adicionar evento alvo
gotoLabel=Ir para
fromLinksLabel=A partir dos links
linkType=Tipo de link
catchLink=Captura de Link
throwLink=Evento de conex\u00e3o de envio
selectSignalEventLabel=Signal
testBeforeLabel=Testar antes da execu\u00e7\u00e3o
testAfterLabel=Testar ap\u00f3s a execu\u00e7\u00e3o
loopConditionLabel=Fazer la\u00e7o enquanto
maximumLoopLabel=Maximum loop
noneLabel=None
optionalLabel=(Opcional)
confirmationMessage=Mensagem de confirma\u00e7\u00e3o
localTemplate=Aplicar uma Apar\u00eancia e Comportamento (look'n'feel)
name=Name
version=Version
selectLocalTemplateWizardPageTitle=Selecione um template Web
selectLocalTemplateWizardPageDescription=Escolha um template Web a partir da lista fornecida
webTemplates=Templates Web
saveAsTemplate_title=Salvar como novo look'n'feel
saveAsTemplate_templateLabel=Nome do template
saveAsTemplate_previewPathLabel=Preview
ResourceSection_SaveAsTemplate=Save as a new look'n'feel
Edit=Edit...
ResourceSection_importTemplate=Import...
ResourceSection_export=Exportar...
ResourceSection_ViewTemplate=Consultation form page template
StepSummarySectionContribution_title=Sum\u00e1rio do passo
save=Save
gatwetypeInclusive=Inclusivo
ResourceSection_AutoLogin=Autentifica\u00e7\u00e3o autom\u00e1tica
ResourceSection_AutoLoginTooltip=Marque esta op\u00e7\u00e3o para saltar a autentifica\u00e7\u00e3o para um usu\u00e1rio espec\u00edfico (pode ser udado para acesso an\u00f4nimo)
showLabel=Display name
errorEvent_error=Erro associado
endErrorEvent_error=C\u00f3digo do erro
mustBeSet=deve ser informado
errorEvent_errorCodeHint=Este \u00e9 o c\u00f3digo de erro que ser\u00e1 enviado
errorEvent_errorCodeCatchHint=Este \u00e9 o c\u00f3digo de erro que ser\u00e1 interceptado caso nenhum c\u00f3digo de erro seja especificado; todos os tipos de erro ser\u00e3o interceptados (Inclusive erros dos conectores)
january=January
february=February
march=March
april=April
may=May
june=June
july=July
august=August
september=September
october=October
november=November
december=December
monday=Monday
tuesday=Tuesday
wednesday=Wednesday
thursday=Thursday
friday=Friday
saturday=Saturday
sunday=Sunday
dynamicLabelHint=\u00c9 poss\u00edvel personalizar a etiqueta desta tarefa mostrada na UserXP (Ex\: Validar solicita\u00e7\u00e3o de ${loggedUser}
dynamicDescriptionHint=\u00c9 poss\u00edvel personalizar a descri\u00e7\u00e3o desta tarefa que ser\u00e1 mostrada User XP (i.e.\: ${loggedUser} solicita ${nbDays} dias de f\u00e9rias)
stepSummaryHint=\u00c9 poss\u00edvel personalizar a descri\u00e7\u00e3o ap\u00f3s terminar este passo na User XP (ex\: A requisi\u00e7\u00e3o de ${loggedUser}  foi aceita por ${managerName})
executionTimeHint=Tempo alocado para este passo. Usado na User XP para detectar passos "em risco" e "atrasados"
targetProcessMessageHint=Escolha um processo existente ou escreva o nome do processo destino
targetEventMessageHint=Escolha um evento de captura de mensagem ou tarefa de recebimento ou insira um nome
signalEvent_catchHint=Este \u00e9 o c\u00f3digo do sinal que ser\u00e1 capturado
signalEvent_throwHint=Este \u00e9 o c\u00f3digo do sinal que ser\u00e1 enviado
confirmDeleteFile_title=Are you sure?
confirmDeleteFile_msg=The selected file(s) will be deleted, are you sure to continue?
pageFlow=Pageflow
skip=Skip
pageFlowTransientDataConnectors=Conectores para a inicializa\u00e7\u00e3o de dados
pageFlowTransientData=Dado ef\u00eamero
messageEventAddWizardNameAlreadyExists=Este nome j\u00e1 existe
formsTabLabel=Forms
transientDatTabLabel=Transient Data
chooseFont=Selecionar Fonte..
ChooseFigure=Selecionar uma figura existente...
applyStyle=Aplicar mesmo estilo que
activityType_callActivity=Atividade de Chamada
skipPageFlowTooltip=Se selecionado, esta tarefa se comportar\u00e1 como um envio autom\u00e1tico.\n Isto significa que esta p\u00e1gina dever\u00e1 ser aberta por um utilizador e ser\u00e1 enviada automaticamente. Isto \u00e9 diferente de uma tarefa abstrata.
activityType_abstractTask=Abstrata
GeneralSection_ActivateValidation=Activar valida\u00e7\u00e3o
ResourceSection_OverWrite_title=Are you sure?
ResourceSection_OverWrite_msg=As actuais configura\u00e7\u00f5es de apar\u00eancia (Look'n'Fell) ser\u00e3o perdidas.
saveAsTemplate_error=Imposs\u00edvel salvar a apar\u00eancia (look'n'fell).\nPor favor, verifique os logs.
saveAsTemplate_import_error=Imposs\u00edvel importar a apar\u00eancia (look'n'feel).\n Por favor, verifique os seus logs.
confirmationPathTooltip=Apenas \u00e9 poss\u00edvel definir uma Template de Confirma\u00e7\u00e3o se existe uma p\u00e1gina de entrada de dados
confirmationMessageTooltip=Apenas \u00e9 poss\u00edvel definir uma Mensagem de Confirma\u00e7\u00e3o se existe uma P\u00e1gina de entrada de dados
ResourceSection_BasedOnLookAndFeel=Atualmente baseado em\:
widgetRemovedWarning_title=Warning
widgetRemovedWarning_msg=Este campo ser\u00e1 removido\n n\u00e3o se esque\u00e7a de tamb\u00e9m remov\u00ea-lo do seu layout personalizado\!
autoMap=Auto mapeamento
autoMap_description=Maps by variable name and data type. Uses the called process contract.
addMessageContent=Conte\u00fado da mensagem
correlation=Correla\u00e7\u00e3o entre inst\u00e2ncias
correlationDescription=Use a correla\u00e7\u00e3o se voc\u00ea precisa coordenar inst\u00e2ncias espec\u00edficas de dois processos.
useCorrelationkeys=Use a correla\u00e7\u00e3o baseada em chave
AddCorrelation=Add
removeCorrelation=Remover
removeMessageContent=Remover
addMessageContentButton=Add
addMessageContentDescription=\u00c9 poss\u00edvel deixar o conte\u00fado da mensagem vazio para sincronizar inst\u00e2ncias entre dois processos.  Para selecionar inst\u00e2ncias espec\u00edficas, use a guia "Correla\u00e7\u00e3o entre inst\u00e2ncias".
autoFillMessageContent=Auto-preenchimento
useExpression=Usar a express\u00e3o
useDecisionTable=Usar tabela de decis\u00e3o
editDecisionTable=Edit decision table...
and=E
takeTransition=Take transition
dontTakeTransition=Don't take transition
emptyName=Name is empty
operationExplanation=An operation updates the value of a variable after an activity is performed. Operations are executed in the order they are listed. \u26a0 A delete operation must be set on its own, in a dedicated activity. Other operations that recreate or update the variable must be handled in a separate activity.
highestPriority=Highest
lowestPriority=Lowest
underNormalPriority=Low
aboveNormalPriority=High
normalPriority=Normal
transitionOrderingExplanation=A ordem de transi\u00e7\u00e3o determina qual fluxo de sa\u00edda do gateway  \u00e9 ativado. Cada transi\u00e7\u00e3o tem uma condi\u00e7\u00e3o. Estas condi\u00e7\u00f5es s\u00e3o avaliadas em ordem, e a primeira transi\u00e7\u00e3o com uma condi\u00e7\u00e3o verdadeira \u00e9 tomada. Se nenhuma condi\u00e7\u00e3o for verdadeira, a transi\u00e7\u00e3o do padr\u00e3o \u00e9 tomada. Para definir a condi\u00e7\u00e3o para uma transi\u00e7\u00e3o, selecione a transi\u00e7\u00e3o e v\u00e1 para o painel de detalhes, guia geral, painel geral.
transitionOrderingExplanation_Short=A fim de determinar qual fluxo de sa\u00edda ser\u00e1 ativado, as condi\u00e7\u00f5es s\u00e3o avaliadas na ordem especificada abaixo.
AddSimple=Add...
description=Description
calledProcessVersionHint=Se a express\u00e3o est\u00e1 vazia ou retorna nulo a \u00faltima vers\u00e3o implementada ser\u00e1 usada
avoidElement=Evitar elementos
avoidElementHint=Evitar elementos usando o caminho mais curto
clearSelection=Limpar sele\u00e7\u00e3o da caixa de sele\u00e7\u00e3o
multiInstance_completionConditionLabel=Condi\u00e7\u00e3o de fim antecipado
multiInstance_completionConditionDescription=Opcional, quando esta condi\u00e7\u00e3o for verdadeira, as inst\u00e2ncias restantes n\u00e3o ser\u00e3o executadas.
dublicateIdErrorMessage=id {0} j\u00e1 existe na tabela {1}
messageContentIdExistenceWarning=id {0} n\u00e3o foi definido no envio da mensagem {1}
NoIncomingMessageWarning=There is no incoming message in project
correlationKey=Chave de correla\u00e7\u00e3o
correlationKeyHelp=\u00c9 poss\u00edvel definir at\u00e9 5 chaves de correla\u00e7\u00e3o. O nome da chave e o valor s\u00e3o concatenados e o resultado \u00e9 armazenado no banco de dados. O resultado n\u00e3o pode exceder 128 caracteres.
correlationValue=Valor de correla\u00e7\u00e3o
messageContentID=Item de conte\u00fado
expressionName=Value
generalPropertiesSectionDescription=Nomear e descrever o elemento selecionado de seu diagrama.
diagramSectionDescription=Dar um nome, uma vers\u00e3o e uma descri\u00e7\u00e3o para o diagrama.
catchMessageContentEventSectionDescription=Uma mensagem \u00e9 uma informa\u00e7\u00e3o enviada de uma tarefa de envio ou evento de lan\u00e7ar mensagem em um outro pool. Defina como lidar com os dados contidos nesta mensagem. A mensagem deve j\u00e1 estar definida em uma tarefa de envio ou evento de lan\u00e7amento de mensagem.
catchMessageEventCorrelationSectionDescription=Chaves de correla\u00e7\u00e3o s\u00e3o usadas para verificar que uma mensagem enviada de uma tarefa de envio \u00e9 recebida pela tarefa de recebimento da inst\u00e2ncia do processo relevante. Defina como as chaves de correla\u00e7\u00e3o contidas em uma mensagem \u00e9 recebida. As chaves j\u00e1 devem estar definidas em uma tarefa de envio.
laneSectionDescription=Uma lane \u00e9 uma subdivis\u00e3o de um processo. Lanes s\u00e3o geralmente usadas para regroupar tarefas que s\u00e3o realizadas por um grupo funcional ou parte de uma organiza\u00e7\u00e3o. Isso significa que todas as tarefas na lane podem ser atribu\u00eddas ao mesmo ator. Portanto, \u00e9 uma boa pr\u00e1tica nomear a lane com o nome do ator ou grupo funcional. Voc\u00ea tamb\u00e9m pode dar uma descri\u00e7\u00e3o.
looknfeelPropertySectionDescription=A look'n'feel definition sets the layout and style of forms created with the 6.x form designer.\nYou can modify an existing layout or template by modifying the HTML.
resourcePropertySectionDescription=These resources are files used by the user interface to a 6.x process.
userXPSectionDescription=Esta \u00e9 a informa\u00e7\u00e3o que \u00e9 exibida sobre uma tarefa no Portal. A dura\u00e7\u00e3o estimada da tarefa \u00e9 usada para calcular o tempo necess\u00e1rio para executar a tarefa depois de iniciada. Se voc\u00ea n\u00e3o especificar as informa\u00e7\u00f5es do Portal, o nome e a descri\u00e7\u00e3o do painel geral s\u00e3o usados.
confirmationPropertySectionDescription=A confirmation message is shown at the end of a sequence of steps performed by one user, showing that no further actions are needed.
loopSectionDescription=Itera\u00e7\u00e3o significa que uma tarefa ou de atividade de chamada \u00e9 executada repetidamente at\u00e9 que uma condi\u00e7\u00e3o seja satisfeita. Especificar a condi\u00e7\u00e3o como uma express\u00e3o ou um n\u00famero de itera\u00e7\u00f5es. Para executar v\u00e1rias inst\u00e2ncias da tarefa ao mesmo tempo, especifique multi-inst\u00e2ncia. Para executar v\u00e1rias inst\u00e2ncias da tarefa uma ap\u00f3s a outra, especifique la\u00e7o padr\u00e3o. Para executar a tarefa uma vez (n\u00e3o h\u00e1 itera\u00e7\u00e3o) especifique nenhum. Para executar v\u00e1rias inst\u00e2ncias da tarefa um ap\u00f3s o outro, voc\u00ea pode usar v\u00e1rias inst\u00e2ncias paralelas ou em la\u00e7o.
exportSuccessfullTitle=Export result
exportSuccessfullMsg=Look'n'feel exportado com \u00eaxito.
exporting=Exporting...
importResultTitle=Resultado da importa\u00e7\u00e3o
importSuccessMsg=Look'n'feel importado com \u00eaxito.
oneCorrelationAtLeastNeeded=Ao menos uma chave de correla\u00e7\u00e3o deve ser especificada.
valueShouldBeDefined=Um valor deve ser definido para o id {0}.
idShouldBeDefined=Um id deve ser definido para o valor {0}.
conditionExpresssionHelpMessage=Exemplos\: minha_variavel > 500 ; \!eValido ; parametro1 \=\= parametro2 ; etc
messagesSectionDescription=Uma tarefa de envio ou evento lan\u00e7ador de mensagem envia mensagens para tarefas de recebimento ou eventos de captura de mensagem em outros pools. Defina as mensagens que ser\u00e3o enviadas para outros pools, incluindo as chaves de correla\u00e7\u00e3o e os dados contidos no conte\u00fado das mensagens.
minutes=Minutes
every=Todo
minuteLabel=minuto (s)
hourly=Todas as horas
daily=Di\u00e1rio
weekly=Semanal
monthly=Mensal
yearly=Anual
generateCronButtonLabel=Gerar uma express\u00e3o cron
at=No
hourLabel=hora (s)
startTime=Hora de in\u00edcio
everyWeekDay=Todos os dias da semana
dayLabel=dia (s)
day=dia
ofEvery=de todos os
monthLabel=m\u00eas (es)
the=O
first=First
second=Segundo
third=Terceiro
fourth=Quarto
fifth=Quinto
of=of
startTimerConditionDescription=Defina uma condi\u00e7\u00e3o de in\u00edcio baseada em um ciclo, uma data fixa ou uma dura\u00e7\u00e3o. Avalia\u00e7\u00e3o do ciclo e da dura\u00e7\u00e3o ser\u00e1 feita quando o processo for ativado.
timerConditionDescription=Defina uma condi\u00e7\u00e3o temporal baseada em uma data fixa ou em uma dura\u00e7\u00e3o. Avalia\u00e7\u00e3o da dura\u00e7\u00e3o ser\u00e1 feita quando o processo for ativado.
startTimerConditionHint=Espera uma express\u00e3o cron (ciclo), um java.util.Date (data fixa) ou um java.lang.Long (dura\u00e7\u00e3o)
timerConditionHint=Espera um java.util.Date (data fixa) ou um java.lang.Long (dura\u00e7\u00e3o)
cronShortDescription=Based on cron expression. <A href\="{0}">?</A>
invalidCronExpression=Express\u00e3o cron inv\u00e1lida
mustBeAnValueBetween=Deve ser um valor entre {0} e {1}.
notAValidNumber=N\u00e3o \u00e9 um n\u00famero v\u00e1lido
mustBeGreaterThan=Deve ser maior que {0}
cantBeGreaterThan=N\u00e3o pode ser superior a {0}
cycle=Ciclo
fixedDate=Data fixa
selectDateLabel=Selecione uma data fixa
basedOn=Condi\u00e7\u00e3o de temporizador baseado em um
generateFixedDateLabel=Gerar a express\u00e3o de data fixa
selectDurationLabel=Selecione uma dura\u00e7\u00e3o
generateDurationLabel=Gerar uma express\u00e3o de dura\u00e7\u00e3o
notAValidInput=Valor [{0}] n\u00e3o \u00e9 uma entrada v\u00e1lida
errorDisplayLabelMaxLength=O texto da etiqueta \u00e9 muito longo. O n\u00famero m\u00e1ximo de caracteres \u00e9 {0}.
warningDisplayLabelMaxLength=O n\u00famero m\u00e1ximo de caracteres \u00e9 {0} para a etiqueta e {1} para descri\u00e7\u00f5es.
expressionCantBeEmpty=O conte\u00fado da express\u00e3o n\u00e3o pode ser vazio
wiget=Widget
mandatory=Mandatory
readOnly=Read only
renamingDiagram=Renomeando o diagrama...
standardLoop=Itera\u00e7\u00e3o cl\u00e1ssica
parallelMultinstantition=Multi-instancia\u00e7\u00e3o paralela
sequentialMultinstantition=Multi-instancia\u00e7\u00e3o sequencial
dataBasedInstanceLabel=Criar inst\u00e2ncias a partir de uma lista
definedNumberOfInstanceLabel=Criar uma quantidade definida de inst\u00e2ncias
input=Input
output=Output
numberOfInstancesToCreate=Quantidade de inst\u00e2ncias a serem criadas
inputList=List
inputListHint=Lista ou vari\u00e1vel "m\u00faltipla" a partir da qual  as inst\u00e2ncias ser\u00e3o geradas.
outputList=Lista de resultados
iterator=Iterador
iteratorHint=Refer\u00eancia que recebe o valor de cada item na lista para criar uma inst\u00e2ncia.
outputData=Resultado de cada inst\u00e2ncia
storeOutputResult=Armazenar os resultados da sa\u00edda
type=Type
typeHint=Deve ser compat\u00edvel com o tipo da lista.
createForm_desc=Enter the name and description of the form. Select data to show and update in the form. Click on tabs\nto switch between Process data and Business data. Choose the type of widget, depending on the attribute type.
noBusinessDataAvailable=N\u00e3o h\u00e1 dados de neg\u00f3cio dispon\u00edveis.
noProcessDataAvailable=N\u00e3o h\u00e1 dados de processo dispon\u00edveis.
generateInitialValueForBusinessData=Generate widget initial values from Business Object attributes.
generateInitialValueForBusinessDataHint=Os dados de neg\u00f3cio devem ser inicializados antes de exibir o formul\u00e1rio.
processData=Process variables
businessData=Business variables
assignToContractInput=Associado \u00e0 entrada de contrato
assignToData=Associado \u00e0 vari\u00e1vel
targetParameterForOutput=Target data in called process
targetParameterForInput=Target in called process
sectionDescriptionOverviewForm=Legacy mode for backward compatibility.\nYou can maintain an existing overview here until it is migrated.\nYou can create an overview using the legacy tooling, but we recommend that you use the UI Designer to create any new overview.\nThere is also a default overview page available if you choose the UI Designer type.If you use a 6.x overview pageflow, go to Execution > Overview page and select the type 6.x
sectionDescriptionEntryForm=Legacy mode for backward compatibility.\nYou can maintain existing forms here until they are migrated.\nYou can create a form using the legacy tooling, but we recommend that you create a contract and use the UI Designer to create any new form. If you use a 6.x form, go to Execution > Form and select the type 6.x
sectionDescriptionProcessEntryForm=Legacy mode for backward compatibility.\nYou can maintain existing forms here until they are migrated.\nYou can create a form using the legacy tooling, but we recommend that you create a contract and use the UI Designer to create any new form. If you use a 6.x form, go to Execution > Instantiation form and select the type 6.x
processScopeVariableWarning=Only process scope variables can be used in expressions below
dataFromRootProcess=Data from root process
dataInCalledProcess=Data in called process
dataFromCalledProcess=Data from called process
dataInRootProcess=Data in root process
dataToSendSectionDescription=Define here the data to pass to the called process. These are the variables or expressions in the root process (where this call activity belongs) to map to contract inputs or variables in the called process. 'Fetch contract' automatically adds the mappings for contract inputs of the called process. Once run, you can update its results. You can also define the mapping manually.
dataToRecieveSectionDescription=Define here the data to retrieve from the called process once its instance is over. These are the variables from the called process to map to variables of the root process (where this call activity belongs).
configureDataToSend=Configure data to send >>
fetchContract=Fetch contract
processNotFoundExcpetion=Process {0} ({1}) has not been found in project.
latest=Latest
noProcessToCallDefined=No process to call defined in ''{0}'' call activity.
noContractDefinedException=No instantiation contract defined for process {0} ({1}).
dueDateCalculation=Due date calculation
dueDateCalculationHint=Define the duration (in millisecond) between when the task is ready and when it's overdue.
displayName=Display name
poolSectionDescription=The Pool is the BPMN graphical element defining a process in Bonita. It must have a unique name in the project.
poolNameHint=A unique technical name
aNameMustBeSet=A name must be set
maxNameLength=Name length can't exceed %s characters
maxDescriptionLength=Description length can't exceed %s characters
aVersionMustBeSet=A version must be set
maxVersionLength=Version length can't exceed %s characters
technicalNameTooltip=Technical name
maxDisplayNameLength=Display name length can't exceed %s characters
displayNameCaption=If not set, name will be used
displayNameTooltip=Process name displayed to the users of Bonita Portal. Static.