#X-Generator: crowdin.com
GeneralSection_Name=Nom
GeneralSection_Description=Description
GeneralSection_Version=Version
defaultFlowLabel=Flux par d\u00e9faut
activityType=Type de t\u00e2che
activityType_task=T\u00e2che humaine
activityType_receiveTask=R\u00e9ception
activityType_sendTask=Envoi
activityType_serviceTask=Service
activityType_scriptTask=Script
gatwetypeAnd=Parall\u00e8le
gatwetypeXor=Exclusive
gatewayType=Type de porte logique
newCategory=Nouvelle cat\u00e9gorie
estimatadExecutionTimeLabel=Temps d'ex\u00e9cution estim\u00e9
dynamicLabelLabel=Nom affich\u00e9
dynamicDescriptionLabel=Description dynamique
dataNameLabel=Nom *
dataDescriptionLabel=Description
datatypeLabel=Type de donn\u00e9es
defaultValueLabel=Valeur par d\u00e9faut
updateConnector=Modifier ...
removeConnector=Supprimer
addConnector=Ajouter...
removeConnectorConfirmTitle=Supprimer ces connecteurs?
removeConnectorConfirmMessage=Voulez-vous supprimer les connecteurs suivant\:
connectorAdd_tooltip=Ajouter \u00e0 cette t\u00e2che
createForm_title=Cr\u00e9er un nouveau Formulaire
createForm_defaultName=Formulaire
createForm_noData=Il n'existe pas de donn\u00e9es pour cette t\u00e2che, cliquez sur Terminer pour cr\u00e9er un formulaire vide.
error_allreadyExists=Il existe d\u00e9j\u00e0 un Formulaire portant ce nom
error_empty=le nom du formulaire ne peut pas \u00eatre vide
duplicateForm_desc=Cr\u00e9er ou Dupliquer un Formulaire parmis ceux de la liste
duplicateForm_title=Nouveau Formulaire
duplicateForm_radioCreate=Cr\u00e9er un nouveau formulaire (Cliquez "Suivant >" pour s\u00e9lectionner les donn\u00e9es \u00e0 utiliser pour initialiser le formulaire)
duplicateForm_radioDuplicate=Dupliquer un formulaire parmis ceux propos\u00e9s ci-dessous
addForm=Ajouter...
addFormTitle=Ajouter un formulaire...
removeForm=Supprimer
editForm=Modifier
formUp=Monter
formDown=Descendre
selectAll=Tout s\u00e9lectionner 
formRemoveFormCommand=Supprimer le formulaire s\u00e9lectionn\u00e9
FormsSection_wizardVarsGroup_Title=Ajouter les champs correspondant \u00e0...
FormsSection_wizardVarsGroup_Tooltip=Choisissez les donn\u00e9e qui seront pr\u00e9sentes dans le formulaire.
FormsSection_ConfirmationTemplate=Mise en page de confirmation
subprocess=Sous-processus
connectionConnection=Condition
ResourceSection_ProcessTemplate=Layout du processus
ResourceSection_PageTemplate=Mod\u00e8le de formulaire
ResourceSection_ErrorTemplate=Erreur de layout
ResourceSection_ProcessTemplate_hint=Mise en page utilis\u00e9e autour de chaque formulaire du processus
ResourceSection_PageTemplate_hint=Mod\u00e8le utilis\u00e9 pour g\u00e9n\u00e9rer la mise en page de saisie des formulaires
ResourceSection_ErrorTemplate_hint=Mise en page utilis\u00e9e pour afficher un message d'erreur
ResourceSection_ViewTemplate_hint=Mod\u00e8le utilis\u00e9 pour g\u00e9n\u00e9rer la mise en page de consultation des formulaires
ResourceSection_LoginPage=Page de connexion
Browse=Parcourir...
Clear=Effacer
Remove=Supprimer
File=Ajouter un fichier...
Folder=Ajouter un dossier...
Add=Ajouter
Download=Page par d\u00e9faut...
Error=Erreur
up=Monter
down=Descendre
durationLabel=Dur\u00e9e
priority=Priorit\u00e9
assignTo=Assign\u00e9e \u00e0
sourceParameter=Donn\u00e9e parent
messageEventAddWizardPageDesc=Un Message peut \u00eatre envoy\u00e9 \u00e0 un autre processus.\nVous pouvez lui joindre des donn\u00e9es afin de les r\u00e9utiliser \u00e0 la reception de ce Message.
messageEventAddWizardPageTitle=Ajouter un Message
messageEventAddWizardPageName=Message Event
removeEventConfirmTitle=\u00cates vous s\u00fbr ?
removeEventConfirmMessage=Voulez-vous vraiment supprimer le(s) \u00e9v\u00e9nement(s) \:
selectMessageEventLabel=R\u00e9ception Message
messageFlowEventChoice=Choisissez un Message
eventType_messageStart=D\u00e9but Message
eventType_messageEnd=Envoi de fin
eventType_intermediateCatch=R\u00e9ception Message
eventType_intermediateThrow=Emission Message
messageEventType=Type de Message
editCondition=Modifier ...
timerCondition=Condition de la minuterie
timerConditionWizardTitle=Choix de la condition pour la minuterie
eventNameLabel=\u00c9l\u00e9ment cible
processNameLabel=Processus cible
isMandatory=Obligatoire
addTargetEventDialogTitle=Ajouter un \u00e9v\u00e9nement cible
gotoLabel=Allez \u00e0
fromLinksLabel=Source(s)
linkType=Type de lien
catchLink=Reception de Link
throwLink=Envoi de Link
selectSignalEventLabel=Signal
testBeforeLabel=Tester avant l'\u00e9xecution
testAfterLabel=Tester apr\u00e8s l'\u00e9xecution
loopConditionLabel=Boucler tant que
maximumLoopLabel=Boucle maximum
noneLabel=Aucune
optionalLabel=(Optionnel)
confirmationMessage=Message de confirmation
localTemplate=Appliquer un look'n'feel
name=Nom
version=Version
selectLocalTemplateWizardPageTitle=S\u00e9lectionner un template web
selectLocalTemplateWizardPageDescription=Choisir un template web \u00e0 partir de la liste fournie
webTemplates=Templates Web
saveAsTemplate_title=Enregistrer en tant que patron
saveAsTemplate_templateLabel=Nom du template
saveAsTemplate_previewPathLabel=Aper\u00e7u
ResourceSection_SaveAsTemplate=Enregistrer en tant que patron
Edit=Modifier ...
ResourceSection_importTemplate=Importer...
ResourceSection_export=Exporter...
ResourceSection_ViewTemplate=Mod\u00e8le de formulaire de consultation
StepSummarySectionContribution_title=Description une fois la t\u00e2che faite
save=Enregistrer
gatwetypeInclusive=Inclusif
ResourceSection_AutoLogin=Authentification automatique
ResourceSection_AutoLoginTooltip=Cocher cette option pour dispenser l'authentification d'un utilisateur sp\u00e9cifique ( peut \u00eatre utilis\u00e9 pour l'acc\u00e8s anonyme)
showLabel=Nom affich\u00e9
errorEvent_error=Erreur associ\u00e9e
endErrorEvent_error=Code d'erreur
mustBeSet=Doit \u00eatre renseign\u00e9
errorEvent_errorCodeHint=Ceci est le code d'erreur qui sera envoy\u00e9
errorEvent_errorCodeCatchHint=Ceci est le code d'erreur qui sera attrap\u00e9. Si aucun code n'est sp\u00e9cifi\u00e9 tous les types d'erreurs seront attrap\u00e9es (m\u00eame celles venant de connecteurs).
january=Janvier
february=F\u00e9vrier
march=Mars
april=Avril
may=Mai
june=Juin
july=Juillet
august=Ao\u00fbt
september=Septembre
october=Octobre
november=Novembre
december=D\u00e9cembre
monday=Lundi
tuesday=Mardi
wednesday=Mercredi
thursday=Jeudi
friday=Vendredi
saturday=Samedi
sunday=Dimanche
dynamicLabelHint=Vous pouvez personnaliser le label de cette \u00e9tape qui sera affich\u00e9 dans la User XP (par exemple\: Validez la requ\u00eate de ${loggedUser} )
dynamicDescriptionHint=Vous pouvez personnaliser la description de cette \u00e9tape qui sera affich\u00e9e dans la User XP (par exemple\: ${loggedUser} demande ${nbDays} de vacances)
stepSummaryHint=Vous pouvez personnaliser la description apr\u00e8s la r\u00e9alisation de cette \u00e9tape dans le portail
executionTimeHint=Temps allou\u00e9 \u00e0 l'\u00e9tape. Utilis\u00e9 dans la UserXP pour d\u00e9tecter les \u00e9tapes "At Risk" et "Overdue"
targetProcessMessageHint=Choississez un processus existant ou entrez le nom du processus cible
targetEventMessageHint=Choisissez un \u00e9v\u00e9nement de R\u00e9ception Message ou une t\u00e2che de R\u00e9ception existant(e) ou saisissez un nom
signalEvent_catchHint=Ceci est le code du Signal qui sera attrap\u00e9.
signalEvent_throwHint=Ceci est le code du Signal qui sera envoy\u00e9.
confirmDeleteFile_title=Etes-vous s\u00fbr?
confirmDeleteFile_msg=Le(s) fichier(s) s\u00e9lectionn\u00e9(s) va \u00eatre supprim\u00e9(s), voulez vous continuer?
pageFlow=Formulaire
skip=Passer
pageFlowTransientDataConnectors=Connecteurs  pour l'initialisation de donn\u00e9e
pageFlowTransientData=Donn\u00e9es Transiantes
messageEventAddWizardNameAlreadyExists=Ce nom existe d\u00e9j\u00e0
formsTabLabel=Formulaires
transientDatTabLabel=Donn\u00e9es Transiantes
chooseFont=Choisir une Police...
ChooseFigure=Choisir un \u00e9l\u00e9ment existant...
applyStyle=Appliquer le m\u00eame style que
activityType_callActivity=Activit\u00e9 Appelante
skipPageFlowTooltip=Cette t\u00e2che, une fois s\u00e9lectionn\u00e9e, fera une soumission automatique.\nCela signifie que la page de la t\u00e2che doit \u00eatre ouverte par un utilisateur et sera automatiquement soumise, ce qui est diff\u00e9rent d'une t\u00e2che abstraite.
activityType_abstractTask=Abstraite
GeneralSection_ActivateValidation=Activer la validation
ResourceSection_OverWrite_title=Etes-vous s\u00fbr?
ResourceSection_OverWrite_msg=Les r\u00e9glages du Look'n'Feel courant appliqu\u00e9s  au processus seront perdus.
saveAsTemplate_error=Impossible de sauvegarder le look 'n' feel.\nVeuillez regarder vos logs.
saveAsTemplate_import_error=Impossible d'importer le look 'n' feel.\nVeuillez regarder vos logs.
confirmationPathTooltip=Vous pouvez mettre un mod\u00e8le de confirmation seulement si il existe un pageflow de saisie
confirmationMessageTooltip=Vous pouvez mettre un message de confirmation seulement si il existe un pageflow de saise
ResourceSection_BasedOnLookAndFeel=Actuellement bas\u00e9 sur\:
widgetRemovedWarning_title=Attention
widgetRemovedWarning_msg=Ce champ va \u00eatre supprim\u00e9\nN'oubliez pas de l'enlever de votre mise en page personnalis\u00e9e\!
autoMap=Auto-mapping
autoMap_description=Cr\u00e9e des mappings \u00e0 partir du nom des variables et du type des donn\u00e9es. Utilise le contrat du processus appel\u00e9.
addMessageContent=Contenu du message
correlation=Corr\u00e9lation entre instances
correlationDescription=Utilisez une corr\u00e9lation si vous avez besoin de coordonner des instances sp\u00e9cifiques de deux processus.
useCorrelationkeys=Utiliser la corr\u00e9lation par cl\u00e9s
AddCorrelation=Ajouter
removeCorrelation=Supprimer
removeMessageContent=Supprimer
addMessageContentButton=Ajouter
addMessageContentDescription=Vous pouvez laisser le contenu du message vide pour synchroniser les instances entre deux processus. Pour s\u00e9lectionner des instances sp\u00e9cifiques, utilisez l'onglet \u00ab Corr\u00e9lation entre instances \u00bb.
autoFillMessageContent=Remplissage automatique
useExpression=Utiliser l'expression
useDecisionTable=Table de d\u00e9cision d'utilisation
editDecisionTable=Modifier la table de d\u00e9cision...
and=ET
takeTransition=Prendre la transition
dontTakeTransition=Ne pas prendre la transition
emptyName=Le nom est vide
operationExplanation=Une op\u00e9ration met \u00e0 jour la valeur d\u2019une variable apr\u00e8s qu\u2019une activit\u00e9 est effectu\u00e9e. Les op\u00e9rations sont ex\u00e9cut\u00e9es dans l\u2019ordre de leur apparition. \u26a0 Une op\u00e9ration de suppression doit \u00eatre d\u00e9finie dans une activit\u00e9 d\u00e9di\u00e9e, s\u00e9par\u00e9e des op\u00e9rations qui recr\u00e9ent ou mettent \u00e0 jour la variable.
highestPriority=Plus haute
lowestPriority=Plus basse
underNormalPriority=Basse
aboveNormalPriority=Haute
normalPriority=Normale
transitionOrderingExplanation=L'ordre de transition d\u00e9termine quels transition hors de la branche est activ\u00e9e. Chaque passage a une condition. Ces conditions sont \u00e9valu\u00e9es dans l'ordre, et la premi\u00e8re transition avec une condition qui est vraie est prise. Si aucune condition n'est vraie, la transition par d\u00e9faut est prise. Pour d\u00e9finir la condition d'une transition, s\u00e9lectionner la transition et allez dans le panneau d\u00e9tails, onglet g\u00e9n\u00e9ral, volet g\u00e9n\u00e9ral.
transitionOrderingExplanation_Short=Afin de d\u00e9terminer quel flux de s\u00e9quence sortant \u00e0 activer, les conditions sont \u00e9valu\u00e9es dans l'ordre indiqu\u00e9 ci-dessous.
AddSimple=Ajouter...
description=Description
calledProcessVersionHint=Si l'expression est vide ou retour null la derni\u00e8re version d\u00e9ploy\u00e9e sera utilis\u00e9e
avoidElement=\u00c9viter les \u00e9l\u00e9ments
avoidElementHint=\u00c9viter les \u00e9l\u00e9ments en utilisant le chemin le plus court
clearSelection=Effacer la s\u00e9lection de la zone de s\u00e9lection
multiInstance_completionConditionLabel=Condition d'arr\u00eat avant terme
multiInstance_completionConditionDescription=Optionnelle. Lorsque cette condition est remplie, les instances restantes ne seront pas ex\u00e9cut\u00e9es.
dublicateIdErrorMessage={0} id existe d\u00e9j\u00e0 dans la table {1}
messageContentIdExistenceWarning={0} id n''est pas d\u00e9finie dans le message {1}
NoIncomingMessageWarning=Il n'y a aucun message entrant dans le projet
correlationKey=Cl\u00e9 de corr\u00e9lation
correlationKeyHelp=Vous pouvez d\u00e9finir jusqu'\u00e0 5 cl\u00e9s de corr\u00e9lation. Le nom de la cl\u00e9 et sa valeur sont concat\u00e9n\u00e9s et le r\u00e9sultat est stock\u00e9 dans la base de donn\u00e9es. Le r\u00e9sultat ne doit pas d\u00e9passer 128 caract\u00e8res.
correlationValue=Valeur de corr\u00e9lation
messageContentID=\u00c9l\u00e9ment de contenu
expressionName=Valeur
generalPropertiesSectionDescription=Nommer et d\u00e9crire l'\u00e9l\u00e9ment s\u00e9lectionn\u00e9 du diagramme.
diagramSectionDescription=Donnez un nom, une version et une description \u00e0 votre diagramme.
catchMessageContentEventSectionDescription=Un message est une information envoy\u00e9e par une t\u00e2che d'envoie ou message de r\u00e9ception dans un autre pool. D\u00e9crivez comment g\u00e9rer les donn\u00e9es contenues dans ce message. Le message doit d\u00e9j\u00e0 \u00eatre d\u00e9fini dans une t\u00e2che d'envoi ou de r\u00e9ception.
catchMessageEventCorrelationSectionDescription=Les cl\u00e9s de corr\u00e9lation sont utilis\u00e9es pour v\u00e9rifier qu'un message envoy\u00e9 par une t\u00e2che d'envoie est re\u00e7u par la t\u00e2che de r\u00e9ception de l'instance du processus. D\u00e9crivez comment g\u00e9rer les cl\u00e9s de corr\u00e9lation contenues dans un message re\u00e7u. Les cl\u00e9s doivent d\u00e9j\u00e0 \u00eatre d\u00e9finies dans une t\u00e2che d'envoi.
laneSectionDescription=Une lane est une subdivision d'un processus (pool). Les lanes sont g\u00e9n\u00e9ralement utilis\u00e9es pour regrouper les t\u00e2ches qui sont effectu\u00e9es par un groupe fonctionnel ou une partie d'une organisation. Cela signifie que toutes les t\u00e2ches de la lane peuvent \u00eatre assign\u00e9es \u00e0 un m\u00eame acteur. Par cons\u00e9quent, donner \u00e0 la lane le nom de l'acteur ou du groupe fonctionnel est consid\u00e9r\u00e9 comme une bonne pratique. Vous pouvez \u00e9galement donner une description \u00e0 la lane.
looknfeelPropertySectionDescription=Le Look & Feel d\u00e9finit le layout et le style des formulaires cr\u00e9\u00e9s avec le form designer 6.x. \nVous pouvez modifier un layout existant ou un template en modifiant le code HTML.
resourcePropertySectionDescription=Ces ressources sont des fichiers utilis\u00e9s par l\u2019interface utilisateur pour un processus 6.x.
userXPSectionDescription=Cette information s'affiche sur une t\u00e2che dans le portail. L'estimation de la dur\u00e9e de la t\u00e2che est utilis\u00e9e pour calculer le temps restant n\u00e9cessaire pour la t\u00e2che apr\u00e8s qu'elle ait commenc\u00e9e. Si vous ne sp\u00e9cifiez pas les informations du portail, le nom et la description de la sous-fen\u00eatre g\u00e9n\u00e9rale sont utilis\u00e9s.
confirmationPropertySectionDescription=Un message de confirmation s'affiche \u00e0 la fin d'une s\u00e9quence d'\u00e9tapes effectu\u00e9e par un utilisateur, indiquant qu'aucune autre action n'est n\u00e9cessaire.
loopSectionDescription=La r\u00e9currence signifie qu'une activit\u00e9 est ex\u00e9cut\u00e9e \u00e0 plusieurs reprises jusqu'\u00e0 ce qu'une condition soit remplie. Pour ex\u00e9cuter plusieurs instances de la t\u00e2che en m\u00eame temps, s\u00e9lectionnez 'Multi-instanciation', parall\u00e8le ou s\u00e9quentielle. Pour ex\u00e9cuter la t\u00e2che de fa\u00e7on it\u00e9rative sans r\u00e9pliquer ses instances, s\u00e9lectionnez 'Boucle'. Pour ex\u00e9cuter la t\u00e2che une fois (aucune r\u00e9currence) s\u00e9lectionnez 'Aucune'. Sp\u00e9cifiez la condition comme une expression ou un nombre d'it\u00e9rations (cardinalit\u00e9).
exportSuccessfullTitle=Exporter le r\u00e9sultat
exportSuccessfullMsg=Look'n'feel export\u00e9 avec succ\u00e8s.
exporting=Export...
importResultTitle=R\u00e9sultat de l'importation
importSuccessMsg=Look'n'feel import\u00e9 avec succ\u00e8s.
oneCorrelationAtLeastNeeded=Au moins une cl\u00e9 de corr\u00e9lation doit \u00eatre sp\u00e9cifi\u00e9e.
valueShouldBeDefined=D\u00e9finir une valeur pour l''id {0}.
idShouldBeDefined=Un id doit \u00eatre d\u00e9fini pour la valeur {0}.
conditionExpresssionHelpMessage=Exemples \: myvariable>500 ; \!isValid ; parameter1\=\=parameter2 ; etc
messagesSectionDescription=Une t\u00e2che d'envoi ou un message d'envoi \u00e9met des messages vers des t\u00e2ches de r\u00e9ception ou messages de r\u00e9ception dans les autres pools. D\u00e9finissez les messages qui seront envoy\u00e9s aux autres pool, y compris les cl\u00e9s de corr\u00e9lation et les donn\u00e9es contenues dans les messages.
minutes=minutes
every=Chaque
minuteLabel=minute(s)
hourly=Horaire
daily=Quotidien
weekly=Hebdomadaire
monthly=Mensuel
yearly=Annuel
generateCronButtonLabel=G\u00e9n\u00e9rer l'expression "cron"
at=\u00c0
hourLabel=heure(s)
startTime=Date et heure de d\u00e9but
everyWeekDay=Chaque jour de semaine
dayLabel=jour(s)
day=jour
ofEvery=de chaque
monthLabel=mois
the=Le
first=Premier
second=Seconde
third=Troisi\u00e8me
fourth=Quatri\u00e8me
fifth=Cinqui\u00e8me
of=de
startTimerConditionDescription=D\u00e9finissez une condition de d\u00e9but bas\u00e9e sur la r\u00e9currence, une date fixe ou une dur\u00e9e. La r\u00e9currence ou l'\u00e9valuation de la dur\u00e9e d\u00e9butera lorsque le processus sera activ\u00e9.
timerConditionDescription=D\u00e9finissez une condition de minuterie bas\u00e9e sur une date fixe ou une dur\u00e9e. La r\u00e9currence ou l'\u00e9valuation de la dur\u00e9e d\u00e9butera lorsque le processus sera activ\u00e9.
startTimerConditionHint=Les formats attendus sont une expression "cron" (r\u00e9currence), un java.util.Date (date fixe) ou un java.lang.Long (dur\u00e9e)
timerConditionHint=Format attendu \: un java.util.Date (date fixe) ou un java.lang.Long (dur\u00e9e)
cronShortDescription=Bas\u00e9 sur un expression "cron". <A href\="{0}">?</A>
invalidCronExpression=Expression "cron" invalide
mustBeAnValueBetween=Doit \u00eatre une valeur comprise entre {0} et {1}.
notAValidNumber=Nombre invalide
mustBeGreaterThan=Doit \u00eatre sup\u00e9rieur \u00e0 {0}
cantBeGreaterThan=Ne peut \u00eatre sup\u00e9rieur \u00e0 {0}
cycle=R\u00e9currence
fixedDate=Date fixe
selectDateLabel=S\u00e9lectionnez une date
basedOn=Condition de minuterie bas\u00e9e sur une
generateFixedDateLabel=G\u00e9n\u00e9rer l'expression d'une date 
selectDurationLabel=S\u00e9lectionnez une dur\u00e9e
generateDurationLabel=G\u00e9n\u00e9rer l'expression d'une dur\u00e9e
notAValidInput=La valeur [{0}] n''est pas une entr\u00e9e valide
errorDisplayLabelMaxLength=Le texte \u00e0 afficher est trop long. Le nombre maximal de caract\u00e8res est {0}.
warningDisplayLabelMaxLength=Le nombre maximal de caract\u00e8res est de {0} pour l''affichage du label, de {1} pour les descriptions.
expressionCantBeEmpty=Le contenu de l'expression ne peut pas \u00eatre vide
wiget=Widget
mandatory=Obligatoire
readOnly=Lecture seule
renamingDiagram=Renommage du diagramme en cours...
standardLoop=Boucle standard
parallelMultinstantition=Instances multiples ex\u00e9cut\u00e9es en parall\u00e8le
sequentialMultinstantition=Instances multiples ex\u00e9cut\u00e9es en s\u00e9quence
dataBasedInstanceLabel=Cr\u00e9er les instances \u00e0 partir d'une liste
definedNumberOfInstanceLabel=Cr\u00e9er un nombre fixe d'instances
input=Entr\u00e9e
output=Sortie
numberOfInstancesToCreate=Nombre d'instances \u00e0 cr\u00e9er
inputList=Liste
inputListHint=Liste ou variable multiple \u00e0 partir de laquelle les instances sont cr\u00e9\u00e9es.
outputList=Liste de r\u00e9sultats
iterator=It\u00e9rateur
iteratorHint=R\u00e9f\u00e9rence utilisant chaque \u00e9l\u00e9ment de la liste pour cr\u00e9er une instance.
outputData=R\u00e9sultat de chaque instance
storeOutputResult=Stocker les r\u00e9sultats en sortie
type=Type
typeHint=Doit \u00eatre compatible avec le type de la liste.
createForm_desc=Entrez le nom et la description du formulaire. S\u00e9lectionnez les donn\u00e9es \u00e0 afficher et modifier dans les deux onglets \: \ndonn\u00e9es de processus et donn\u00e9es m\u00e9tier. Choisissez le type des widgets en fonction du type de chaque attribut.
noBusinessDataAvailable=Aucune donn\u00e9e m\u00e9tier disponible.
noProcessDataAvailable=Aucune donn\u00e9e de processus disponible.
generateInitialValueForBusinessData=G\u00e9n\u00e9rer les Valeurs initiales des champs du formulaire
generateInitialValueForBusinessDataHint=La donn\u00e9e m\u00e9tier devra \u00eatre initialis\u00e9e avant d'afficher ce formulaire
processData=Variables de processus
businessData=Variables m\u00e9tier
assignToContractInput=Associ\u00e9 \u00e0 l'input de contrat
assignToData=Associ\u00e9e \u00e0 la variable
targetParameterForOutput=Donn\u00e9e cible dans le processus appel\u00e9
targetParameterForInput=Cible dans le processus appel\u00e9
sectionDescriptionOverviewForm=Mode de compatibilit\u00e9 descendante vers 6.x.\nVous pouvez conserver ici une page de synth\u00e8se 6.x jusqu'\u00e0 migration.\nVous pouvez cr\u00e9er en cr\u00e9er une nouvelle \u00e0 l'aide du form builder 6.x, mais nous vous recommandons d'utiliser le nouveau UI Designer.\nPour utiliser un formulaire 6.x, allez sur Ex\u00e9cution > Page de synth\u00e8se, puis s\u00e9lectionnez le type 6.x.\nSi le type UI designer est s\u00e9lectionn\u00e9, une page de synth\u00e8se est propos\u00e9e par d\u00e9faut
sectionDescriptionEntryForm=Mode de compatibilit\u00e9 descendante vers 6.x.\nVous pouvez conserver ici les formulaires 6.x jusqu'\u00e0 migration.\nVous pouvez cr\u00e9er de nouveaux formulaires \u00e0 l'aide du page builder 6.x, mais nous vous recommandons d'utiliser le UI Designer.\nPour utiliser un formulaire 6.x, allez \u00e0 Ex\u00e9cution > Formulaire, puis s\u00e9lectionnez le type 6.x
sectionDescriptionProcessEntryForm=Mode de compatibilit\u00e9 descendante vers 6.x.\nVous pouvez conserver ici les formulaires 6.x jusqu'\u00e0 migration.\nVous pouvez cr\u00e9er des formulaires \u00e0 l'aide du form builder 6.x, mais nous vous recommandons de cr\u00e9er un contrat et d'utiliser le UI Designer.\nPour utiliser un formulaire 6.x, allez \u00e0 Ex\u00e9cution > Formulaire, puis s\u00e9lectionnez le type 6.x
processScopeVariableWarning=Seules les variables de niveau pool peuvent \u00eatre utilis\u00e9es dans les expressions ci-dessous
dataFromRootProcess=Donn\u00e9es du processus racine
dataInCalledProcess=Donn\u00e9e dans le processus appel\u00e9
dataFromCalledProcess=Donn\u00e9es du processus appel\u00e9
dataInRootProcess=Donn\u00e9e dans le processus racine
dataToSendSectionDescription=D\u00e9finissez les donn\u00e9es qui transitent du processus racine (dans lequel se trouve cette activit\u00e9 appelante) vers le processus appel\u00e9 \: ce sont des variables ou expressions du processus racine \u00e0 associer \u00e0 des inputs de contrat ou des variables dans le processus appel\u00e9. \u00ab\u00a0R\u00e9cup\u00e9rer le contrat\u00a0\u00bb pr\u00e9pare automatiquement le mapping pour les inputs de contrat du processus appel\u00e9. Une fois ex\u00e9cut\u00e9, vous pouvez mettre \u00e0 jour ses r\u00e9sultats. Sinon, vous pouvez d\u00e9finir le mapping manuellement.
dataToRecieveSectionDescription=D\u00e9finissez les donn\u00e9es qui passent du processus appel\u00e9 vers le processus racine une fois l\u2019instance termin\u00e9e \: ce sont des variables dans le processus appel\u00e9 \u00e0 associer \u00e0 des variables dans le processus racine (auquel appartient cette activit\u00e9 appelante).
configureDataToSend=Configurez les donn\u00e9es \u00e0 envoyer >>
fetchContract=R\u00e9cup\u00e9rer le contract
processNotFoundExcpetion=Le processus {0} ({1}) n\u2019a pas \u00e9t\u00e9 trouv\u00e9 dans le projet.
latest=La plus r\u00e9cente
noProcessToCallDefined=Aucun processus \u00e0 appeler n''a \u00e9t\u00e9 d\u00e9fini pour l''activit\u00e9 appelante ''{0}''.
noContractDefinedException=Aucun contrat d\u2019instanciation n''a \u00e9t\u00e9 d\u00e9fini pour le processus {0} ({1}).
dueDateCalculation=Calcul de la date d'\u00e9ch\u00e9ance
dueDateCalculationHint=Dur\u00e9e (en millisecondes) entre le moment o\u00f9 la t\u00e2che est dans l'\u00e9tat "ready" et le moment o\u00f9 elle est en retard ("overdue").
displayName=Nom affich\u00e9
poolSectionDescription=Le pool est l\u2019\u00e9l\u00e9ment graphique BPMN qui d\u00e9finit un processus dans Bonita. Il doit avoir un nom unique dans le projet.
poolNameHint=Un nom technique unique
aNameMustBeSet=Vous devez d\u00e9finir un nom
maxNameLength=La longueur du nom ne doit pas d\u00e9passer %s caract\u00e8res
maxDescriptionLength=La longueur de la description ne doit pas d\u00e9passer %s caract\u00e8res
aVersionMustBeSet=Vous devez d\u00e9finir une version
maxVersionLength=La longueur de la version ne doit pas d\u00e9passer %s caract\u00e8res
technicalNameTooltip=Nom technique
maxDisplayNameLength=La longueur du nom affich\u00e9 ne doit pas d\u00e9passer %s caract\u00e8res
displayNameCaption=S'il n'est pas d\u00e9fini, le nom sera utilis\u00e9
displayNameTooltip=Nom du processus affich\u00e9 aux utilisateurs de Bonita Portal. Statique.

