#X-Generator: crowdin.com
contractSectionDescription=\u3053\u306e\u30b9\u30c6\u30c3\u30d7\u307e\u305f\u306f\u30d7\u30fc\u30eb\u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u5316\u306e\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u3092\u5b9a\u7fa9\u3057\u307e\u3059\u3002
processContractSectionDescription=A contract defines the information that a process requires for instantiation.\nAfter you have defined the contract, you can generate the form by clicking the UI designer icon on the right of this panel. This generates a form with the relevant widgets and data bindings for the process instantiation inputs. You must handle constraints with validation in the form.\nYou can use contract input values as the initial value of variables, documents and search keys or in connectors in (on enter).
stepContractSectionDescription=A contract defines the information that a task requires to execute. If inputs are missing or constraints are not fulfilled on form submission, the task is not executed and stays ready.\nAfter you have defined the contract, you can generate the form by clicking the UI designer icon on the right of this panel. This generates a form with the relevant widgets and data bindings for the task inputs. You must handle constraints with validation in the form.\nYou can use a contract input value in operations and connectors out (on finish).
name=\u540d\u524d
type=\u30bf\u30a4\u30d7
mandatory=\u5fc5\u9808
multiple=\u8907\u6570
add=\u8ffd\u52a0
addChild=\u5b50\u3092\u8ffd\u52a0
remove=\u524a\u9664
savedInto=\u30c7\u30fc\u30bf\u3092\u4fdd\u5b58
description=\u5b9a\u7fa9
automaticMappingTooltip=\u65e2\u5b58\u306e\u30c7\u30fc\u30bf\u5165\u529b\u3092\u81ea\u52d5\u7684\u306b\u4fdd\u5b58\u3059\u308b\u306b\u306f\u3001"Ctrl + Space"\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002
constraints=\u5236\u7d04
none=\uff1c\u306a\u3057\uff1e
addConstraint=\u8ffd\u52a0...
editConstraint=\u7de8\u96c6...
inputSuffix=\u5165\u529b
duplicatedInputNames=\u91cd\u8907\u3057\u3066\u3044\u308b\u5165\u529b\u540d\: {0}
duplicatedConstraintNames=\u91cd\u8907\u3057\u3066\u3044\u308b\u5236\u7d04\u540d\: {0}
taskInputs=Task Inputs
processInstantiationInputs=Process instantiation inputs
inputTabLabel=\u5165\u529b
constraintsTabLabel=\u5236\u7d04
contractInputTypeLabel=\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u5165\u529b
removeInputConfirmationMessage=Are you sure you want to remove the following input?\nIf this input is COMPLEX it will remove all children.\nIf this input is a single reference of a constraint, this constraint will be removed.
removeInputConfirmationTitle=Are you sure you want to remove contract input?
removeConstraintConfirmationTitle=Are you sure you want to remove contract constraint(s)?
removeConstraintConfirmationMessage=Are you sure you want to remove following constraint(s)?
returnType=\u623b\u308a\u5024\u306e\u578b
up=\u4e0a\u3078
down=\u4e0b\u3078
expression=\u5f0f
errorMessage=\u30a8\u30e9\u30fc\u30e1\u30c3\u30bb\u30fc\u30b8
noInputReferencedInConstraintExpression=\u5236\u7d04\u306e\u5f0f\u306b\u5165\u529b\u304c\u53c2\u7167\u3055\u308c\u3066\u3044\u306a\u3044\uff1a {0}
unknownInputReferencedInConstraintExpression={1} \u306e\u5f0f\u3067\u672a\u77e5\u306e\u5165\u529b\u300c{0}\u300d\u304c\u53c2\u7167\u3055\u308c\u3066\u3044\u307e\u3059\u3002
constraintEditorDescription=Groovy \u30b9\u30af\u30ea\u30d7\u30c8\u3092\u4f7f\u7528\u3057\u3066\u5236\u7d04\u3092\u5165\u529b\u3057\u307e\u3059\u3002
contentAssistHint=\u30b3\u30f3\u30c6\u30f3\u30c4 \u30a2\u30b7\u30b9\u30c8\u3092\u8d77\u52d5\u3059\u308b\u306b\u306f\u3001\u300cCtrl + \u30b9\u30da\u30fc\u30b9\u300d\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002
addContentToConstraint=\u5236\u7d04 {0} \u306b\u30b3\u30f3\u30c6\u30f3\u30c4\u3092\u8ffd\u52a0
editContentToConstraint=\u5236\u7d04 {0} \u306e\u30b3\u30f3\u30c6\u30f3\u30c4\u3092\u7de8\u96c6
emptyExpressionContent=\u5f0f\u306e\u5185\u5bb9\u304c\u7a7a\u3067\u3059
noContractInputReferencedInExpression=\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u5165\u529b\u306f\u3001\u5f0f\u3067\u53c2\u7167\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
nullable=Null \u3092\u8a31\u3059
removeInputErrorTitle=\u524a\u9664\u306b\u5931\u6557\u3057\u307e\u3057\u305f
removeInputErrorMsg=\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u5165\u529b\u306e\u524a\u9664\u6642\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
severalCompilationErrors={0} \u30b3\u30f3\u30d1\u30a4\u30eb \u30a8\u30e9\u30fc\u304c\u898b\u3064\u304b\u308a\u307e\u3057\u305f\u3002
SelectBusinessDataWizardPageTitle=\u30d3\u30b8\u30cd\u30b9 \u30c7\u30fc\u30bf\u3092\u9078\u629e
selectBusinessDataWizardPageDescription=\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u5165\u529b\u3092\u751f\u6210\u3059\u308b\u30d3\u30b8\u30cd\u30b9\u5909\u6570\u3092\u9078\u629e\u3057\u307e\u3059\u3002
generate=\u30c7\u30fc\u30bf\u304b\u3089\u8ffd\u52a0...
contractInputGenerationTitle=\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u5165\u529b\u3092\u8ffd\u52a0
rootContractInputName=\u5165\u529b\u540d
selectFieldToGenerateTitle=\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u306b\u8ffd\u52a0\u3059\u308b{0} \u5c5e\u6027\u3092\u9078\u629e\u3057\u307e\u3059
selectFieldToGenerateDescription=\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u306e\u4e2d\u3067\u518d\u5229\u7528\u3057\u305f\u3044\u30d5\u30a3\u30fc\u30eb\u30c9\u3092\u9078\u629e\u3057\u307e\u3059\u3002
inputOfType=\u8907\u5408\u578b\uff08COMPLEX\uff09
inputType=\u5165\u529b\u306e\u578b
attributetype=\u5c5e\u6027\u306e\u578b
atLeastOneAttributeShouldBeSelectedError=\u5c11\u306a\u304f\u3068\u3082 1 \u3064\u306e\u5c5e\u6027\u3092\u30c1\u30a7\u30c3\u30af\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
attributeName=\u5c5e\u6027\u540d
warningAddFromData_noDataAvailable=\u6700\u521d\u306b\u30c7\u30fc\u30bf \u30d3\u30e5\u30fc\u304b\u3089\u30d3\u30b8\u30cd\u30b9\u5909\u6570\u3092\u4f5c\u6210\u3057\u3066\u304f\u3060\u3055\u3044\u3002
warningAddFromData_noDataSelected=\u30d3\u30b8\u30cd\u30b9\u5909\u6570\u3092\u4e00\u89a7\u3067\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044\u3002
reminderForStepMessage=Contract elements and mapping operations will be generated and can be edited manually. Storage operations to update business variables can also be generated.\nSelect the option that suits your needs\:
reminderForProcessMessage=Contract elements will be generated and can be edited manually.\nThe groovy script to initialize business variables can also be generated.\nSelect the option that best suits your needs\:
contractInputDescriptionTooltip=\u81ea\u52d5\u751f\u6210\u3055\u308c\u305f\u30d5\u30a9\u30fc\u30e0\u3067\u30e6\u30fc\u30b6\u30fc\u306e\u30d2\u30f3\u30c8\u3068\u3057\u3066\u4f7f\u7528\u3055\u308c\u307e\u3059
errorTitle=\u30a8\u30e9\u30fc
contractFromDataCreationErrorMessage=An error occurred while generating the contract from a data.
contractGenerationTitle=Contract generation
contractGenerationMsg=Generated contract elements and operations can be edited manually.\nHowever, in many cases, no refactoring is performed (e.g.\: Updating name or multiple attribute in a Business object or contract element may break a generated operation).
doNotShowMeAgain=Do not show me this dialog again
notAllAttributesGeneratedTitle=incomplete initialization of the business variable
notAllAttributesGeneratedMsg=Some attributes of the business variable will not be initialized from the contract elements as they have been deselected.
autoGeneratedOperationStepButton=Auto-generate storage operations
manuallyDefinedOperationStepButton=No, thanks. I'll manually define how to use the contract.
autoGeneratedOperationProcessButton=Auto-generate the initialization script
manuallyDefinedOperationProcessButton=No, thanks. I'll manually define how to use the contract.
