#X-Generator: crowdin.com
invalidURLTitle=\u7121\u52b9\u306a URL
invalidURLMsg=Web \u30d6\u30e9\u30a6\u30b6\u3092\u958b\u3044\u3066\u3044\u308b\u3068\u304d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
formRepository=\u30da\u30fc\u30b8
fragmentRepository=\u30d5\u30e9\u30b0\u30e1\u30f3\u30c8
widgetRepository=\u30ab\u30b9\u30bf\u30e0 \u30a6\u30a3\u30b8\u30a7\u30c3\u30c8
externalURL=\u5916\u90e8 URL
targetForm=\u30bf\u30fc\u30b2\u30c3\u30c8 \u30d5\u30a9\u30fc\u30e0
url=URL
pageDoesntExists=\u300c{0}\u300d\u306e\u30da\u30fc\u30b8\u306f\u5b58\u5728\u3057\u307e\u305b\u3093\u3002
caseStartFormMappingDescription=Select the type of form used to instantiate the process. Subscription edition\: With "Live Update", you can update your process live to map a different form after deployment.
entryFormMappingDescription=Select the type of form used to fulfill the contract. Subscription edition\: With "Live Update", you can update your process live to map a different form after deployment.
caseOverviewFormMappingDescription=Bonita BPM \u30dd\u30fc\u30bf\u30eb\u5185\u306e\u6848\u4ef6\u8a73\u7d30\u30da\u30fc\u30b8\u306e [\u6982\u8981] \u3092\u30af\u30ea\u30c3\u30af\u3059\u308b\u3068\u3001\u3053\u306e\u6848\u4ef6\u6982\u8981\u30da\u30fc\u30b8\u304c\u8868\u793a\u3055\u308c\u307e\u3059\u3002\u3053\u306e\u30da\u30fc\u30b8\u3092\u542b\u3081\u308b\u60c5\u5831\u306b\u306f\u5236\u9650\u304c\u3042\u308a\u307e\u305b\u3093\u3002\u3053\u306e\u30da\u30fc\u30b8\u3092\u6307\u5b9a\u3057\u306a\u3044\u5834\u5408\u306f\u3001\u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u6848\u4ef6\u6982\u8981\u30da\u30fc\u30b8\u304c\u63d0\u4f9b\u3055\u308c\u307e\u3059\u3002
newFormTooltipForPool=Create or edit a form based on the contract. It will be automatically mapped to this pool.
newFormTooltipForTask=Create or edit a form based on the contract. It will be automatically mapped to this task.
legacyForm=6.x \u30ec\u30ac\u30b7\u30fc
openUIDesigner=UI \u30c7\u30b6\u30a4\u30ca\u30fc\u3092\u958b\u304f
uiDesignerLabel=UI \u30c7\u30b6\u30a4\u30ca\u30fc
creatingNewForm=\u65b0\u3057\u3044\u30d5\u30a9\u30fc\u30e0\u3092\u4f5c\u6210\u3057\u3066\u3044\u307e\u3059...
switchTypeOfFormQuestionTitle=\u30d5\u30a9\u30fc\u30e0\u5f62\u5f0f\u306e\u975e\u4e92\u63db\u6027
switchTypeOfFormQuestion=\u3053\u306e\u30bf\u30b9\u30af\u306e\u73fe\u5728\u306e\u30d5\u30a9\u30fc\u30e0\u5f62\u5f0f\u306f\u3001{0} \u3067\u3059\u3002\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u304c\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u308b\u306e\u3067\u3001\u5165\u529b\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u306b\u95a2\u9023\u3059\u308b\u30a6\u30a3\u30b8\u30a7\u30c3\u30c8\u3092\u542b\u3080\u30d5\u30a9\u30fc\u30e0\u3092\u81ea\u52d5\u751f\u6210\u3059\u308b\u306b\u306f\u3001 UI \u30c7\u30b6\u30a4\u30ca\u30fc\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002UI \u30c7\u30b6\u30a4\u30ca\u30fc\u3092\u4f7f\u7528\u3057\u3066\u65b0\u3057\u3044\u30d5\u30a9\u30fc\u30e0\u3092\u4f5c\u6210\u3057\u307e\u3059\u304b\uff1f
internalFormMappingUndefined=\u5185\u90e8\u30d5\u30a9\u30fc\u30e0\u306e\u30de\u30c3\u30d4\u30f3\u30b0\u304c {0} \u306b\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
urlNotDefined=External URL form mapping is undefined for {0}.
formDoesntExistAnymoreMessage=\u30d5\u30a9\u30fc\u30e0 {0} \u306f\u3082\u306f\u3084\u5b58\u5728\u3057\u307e\u305b\u3093\u3002UI \u30c7\u30b6\u30a4\u30ca\u30fc\u304b\u3089\u524a\u9664\u3055\u308c\u305f\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
formDoesntExistAnymoreTitle=\u30d5\u30a9\u30fc\u30e0 {0} \u306f\u3082\u306f\u3084\u5b58\u5728\u3057\u307e\u305b\u3093\u3002
stepUIDesignerInfo=\u30d5\u30a9\u30fc\u30e0\u304c\u307e\u3060\u4f5c\u6210\u3055\u308c\u3066\u3044\u306a\u3044\u5834\u5408\u306f\u3001\u6700\u521d\u306b\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u3092\u5b9a\u7fa9\u3059\u308b\u3088\u3046\u306b\u3057\u307e\u3057\u3087\u3046\u3002\n\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u306f\u5165\u529b\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u306b\u95a2\u9023\u3059\u308b\u30a6\u30a3\u30b8\u30a7\u30c3\u30c8\u3068\u30c7\u30fc\u30bf\u3092\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0\u3057\u3066\u30d5\u30a9\u30fc\u30e0\u3092\u751f\u6210\u3067\u304d\u308b\u3088\u3046\u306b\u3057\u307e\u3059\u3002\n\u30d5\u30a9\u30fc\u30e0\u3092\u6307\u5b9a\u3057\u306a\u3044\u5834\u5408\u306f\u3001\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u306b\u57fa\u3065\u304f\u30c7\u30d5\u30a9\u30eb\u30c8 \u30d5\u30a9\u30fc\u30e0\u304c\u958b\u767a\u7528\u306b\u751f\u6210\u3055\u308c\u307e\u3059\u3002\n\u925b\u7b46\u306e\u30a2\u30a4\u30b3\u30f3\u3092\u30af\u30ea\u30c3\u30af\u3057\u3066\u30d5\u30a9\u30fc\u30e0\u3092\u7de8\u96c6\u3059\u308b\u304b\u3001\u307e\u305f\u306f\u30c9\u30ed\u30c3\u30d7 \u30c0\u30a6\u30f3 \u30ea\u30b9\u30c8\u3092\u4f7f\u7528\u3057\u3066\u5225\u306e\u30d5\u30a9\u30fc\u30e0\u3092\u30de\u30c3\u30d7\u3057\u307e\u3059\u3002
processUIDesignerInfo=\u30d5\u30a9\u30fc\u30e0\u304c\u307e\u3060\u4f5c\u6210\u3055\u308c\u3066\u3044\u306a\u3044\u5834\u5408\u306f\u3001\u6700\u521d\u306b\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u3092\u5b9a\u7fa9\u3059\u308b\u3088\u3046\u306b\u3057\u307e\u3057\u3087\u3046\u3002\n\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u306f\u5165\u529b\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u306b\u95a2\u9023\u3059\u308b\u30a6\u30a3\u30b8\u30a7\u30c3\u30c8\u3068\u30c7\u30fc\u30bf\u3092\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0\u3057\u3066\u30d5\u30a9\u30fc\u30e0\u3092\u751f\u6210\u3067\u304d\u308b\u3088\u3046\u306b\u3057\u307e\u3059\u3002\n\u30d5\u30a9\u30fc\u30e0\u3092\u6307\u5b9a\u3057\u306a\u3044\u5834\u5408\u306f\u3001\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u306b\u57fa\u3065\u304f\u30c7\u30d5\u30a9\u30eb\u30c8 \u30d5\u30a9\u30fc\u30e0\u304c\u958b\u767a\u7528\u306b\u751f\u6210\u3055\u308c\u307e\u3059\u3002\n\u925b\u7b46\u306e\u30a2\u30a4\u30b3\u30f3\u3092\u30af\u30ea\u30c3\u30af\u3057\u3066\u30d5\u30a9\u30fc\u30e0\u3092\u7de8\u96c6\u3059\u308b\u304b\u3001\u307e\u305f\u306f\u30c9\u30ed\u30c3\u30d7 \u30c0\u30a6\u30f3 \u30ea\u30b9\u30c8\u3092\u4f7f\u7528\u3057\u3066\u5225\u306e\u30d5\u30a9\u30fc\u30e0\u3092\u30de\u30c3\u30d7\u3057\u307e\u3059\u3002
overviewUIDesignerInfo=\u925b\u7b46\u306e\u30a2\u30a4\u30b3\u30f3\u3092\u30af\u30ea\u30c3\u30af\u3057\u3066\u6848\u4ef6\u6982\u8981\u30d5\u30a9\u30fc\u30e0\u3092\u4f5c\u6210\u3042\u308b\u3044\u306f\u7de8\u96c6\u3059\u308b\u304b\u3001\u307e\u305f\u306f\u30c9\u30ed\u30c3\u30d7 \u30c0\u30a6\u30f3 \u30ea\u30b9\u30c8\u3092\u4f7f\u7528\u3057\u3066\u5225\u306e\u30d5\u30a9\u30fc\u30e0\u3092\u30de\u30c3\u30d7\u3057\u307e\u3059\u3002
overviewURLInfo=\u30da\u30fc\u30b8\u306e URL \u3092\u6307\u5b9a\u3057\u307e\u3059\u3002\nprocessDefinitionID \u304c\u30af\u30a8\u30ea\u6587\u5b57\u5217\u306b\u63d0\u4f9b\u3055\u308c\u307e\u3059\u3002\u3053\u306e processDefinitionID \u306f\u30ea\u30c0\u30a4\u30ec\u30af\u30c8\u6642\u306b\u5916\u90e8URL\u306b\u8ffd\u52a0\u3055\u308c\u308b\u30d1\u30e9\u30e1\u30fc\u30bf <id> \u306e\u5024\u306b\u306a\u308a\u307e\u3059\u3002\n\u4ed6\u306e REST API \u30ea\u30bd\u30fc\u30b9\u306f\u3001\u30da\u30fc\u30b8\u5185\u306e\u5024\u3001\u7279\u306b\u30d3\u30b8\u30cd\u30b9 \u30c7\u30fc\u30bf\u3068\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8\u53c2\u7167\u3092\u542b\u3080\u300c\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u300d(API/bpm/case/<processInstanceId>/context \u304a\u3088\u3073 API/bpm/archivedCase/<archivedProcessInstanceId>/context) \u3067\u8a2d\u5b9a\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002
stepURLInfo=\u30d5\u30a9\u30fc\u30e0\u306e URL \u3092\u6307\u5b9a\u3057\u307e\u3059\u3002\n\u3053\u306e\u6307\u5b9a\u3067\u306f\u3001API/bpm/userTask/<taskInstanceId>/execution\u3092\u547c\u3073\u51fa\u3059\u3053\u3068\u306b\u3088\u3063\u3066\u3001\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u3092\u6210\u7acb\u3055\u305b\u308b\u305f\u3081\u306e\u60c5\u5831\u3092\u8fd4\u9001\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002\n taskInstanceID \u304c\u30af\u30a8\u30ea\u6587\u5b57\u5217\u306b\u63d0\u4f9b\u3055\u308c\u307e\u3059\u3002\u3053\u306e taskInstanceID \u306f\u30ea\u30c0\u30a4\u30ec\u30af\u30c8\u6642\u306b\u5916\u90e8URL \u306b\u8ffd\u52a0\u3055\u308c\u308b\u30d1\u30e9\u30e1\u30fc\u30bf <id> \u306e\u5024\u306b\u306a\u308a\u307e\u3059\u3002\n\u4ed6\u306e REST API \u30ea\u30bd\u30fc\u30b9\u306f\u3001\u7279\u306b\u30d3\u30b8\u30cd\u30b9 \u30c7\u30fc\u30bf\u3068\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8\u53c2\u7167\u3092\u542b\u3080\u300c\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u300d(API/bpm/userTask/<taskInstanceId>/context) \u3001\u304a\u3088\u3073\u30bf\u30b9\u30af\u5b9f\u884c\u6642\u306b\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u3092\u6210\u7acb\u3055\u305b\u308b\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u5f62\u5f0f\u3092\u8a18\u8ff0\u3059\u308b\u300c\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u300d(API/bpm/userTask/<taskInstanceId>/contract) \u306f\u3001\u30d5\u30a9\u30fc\u30e0\u5185\u306e\u305d\u308c\u305e\u308c\u306e\u521d\u671f\u5024\u3067\u8a2d\u5b9a\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002
processURLInfo=\u30d5\u30a9\u30fc\u30e0\u306e URL \u3092\u6307\u5b9a\u3057\u307e\u3059\u3002\n\u3053\u306e\u6307\u5b9a\u3067\u306f\u3001API/bpm/process/<processDefinitionId>/instantiation\u3092\u547c\u3073\u51fa\u3059\u3053\u3068\u306b\u3088\u3063\u3066\u3001\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u3092\u6210\u7acb\u3055\u305b\u308b\u305f\u3081\u306e\u60c5\u5831\u3092\u8fd4\u9001\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002\nprocessDefinitionID \u304c\u30af\u30a8\u30ea\u6587\u5b57\u5217\u306b\u63d0\u4f9b\u3055\u308c\u307e\u3059\u3002\u3053\u306e processDefinitionID \u306f\u30ea\u30c0\u30a4\u30ec\u30af\u30c8\u6642\u306b\u5916\u90e8URL \u306b\u8ffd\u52a0\u3055\u308c\u308b\u30d1\u30e9\u30e1\u30fc\u30bf <id> \u306e\u5024\u306b\u306a\u308a\u307e\u3059\u3002\n\u4ed6\u306e REST API \u30ea\u30bd\u30fc\u30b9\u306f\u3001\u30d5\u30a9\u30fc\u30e0\u5185\u306e\u521d\u671f\u5024\u3001\u7279\u306b\u30d3\u30b8\u30cd\u30b9 \u30c7\u30fc\u30bf\u3068\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8\u53c2\u7167\u3092\u542b\u3080\u300c\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u300d(API/bpm/process/<processDefinitionId>/context) \u3001\u304a\u3088\u3073\u30d7\u30ed\u30bb\u30b9\u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u5316\u6642\u306b\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u3092\u6210\u7acb\u3055\u305b\u308b\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u5f62\u5f0f\u3092\u8a18\u8ff0\u3059\u308b\u300c\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u300d(API/bpm/process/<processDefinitionId>/contract) \u3067\u8a2d\u5b9a\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002
overviewLegacyInfo=\u6848\u4ef6\u6982\u8981\u30da\u30fc\u30b8\u30d5\u30ed\u30fc\u3092\u5b9a\u7fa9\u3059\u308b [6.x \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3] \u30bf\u30d6\u306b\u79fb\u52d5\u3057\u307e\u3059\u3002
stepLegacyInfo=\u30bf\u30b9\u30af \u30da\u30fc\u30b8\u30d5\u30ed\u30fc\u3092\u5b9a\u7fa9\u3059\u308b [6.x \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3] \u30bf\u30d6\u306b\u79fb\u52d5\u3057\u307e\u3059\u3002\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u306f\u3001\u7a7a\u3067\u3042\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
processLegacyInfo=\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u5316\u30da\u30fc\u30b8\u30d5\u30ed\u30fc\u3092\u5b9a\u7fa9\u3059\u308b [6.x \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3] \u30bf\u30d6\u306b\u79fb\u52d5\u3057\u307e\u3059\u3002\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u306f\u3001\u7a7a\u3067\u3042\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
openUiDesignerInformationWindowTitle=UI designer information
openUiDesignerInformationMessage=You can use the UI designer to create and modify forms. To create a new form, we recommend that you first create a contract and then use the automatically generated form as your starting point, instead of creating the form from scratch.\nYou can also use the UI designer to create application pages and custom application layouts.
openUiDesignerInformationToggleMessage=Do not show this dialog again.
hideEmptyContractDialogTitle=Empty contract
hideEmptyContractDialogMessage=This button generates a form with the relevant widgets and data bindings for the contract inputs. The mapping between the form is and this (task or process \=> 0) is done once for all. It is not updated when you update the contract. We recommend you create your contract before clicking on this button.\nDo you still want to open the UI designer?
hideEmptyContractDialogToggleMessage=Do not show this dialog again.
waitingForTomcatServer=Tomcat server is booting in background (this may take a few seconds)...
noForm=No form
noFormMessageOnTask=A human task with no form and no contract represents a manual task, completed outside Bonita BPM. The user will indicate in the application or Portal that the manual task is complete.\nA human task with a contract but no form expects the information needed to fulfill the contract to be provided programmatically.
noFormMessageOnProcess=This process will be instantiated programmatically (by a call activity or by an API call from an application, for example), so no form is necessary.\nWhen "No form" is selected, no default instantiation form is generated for testing.\nIf you have defined a contract and want to use the default form for testing, choose the UI designer option but do not specify a form.

