#X-Generator: crowdin.net
GeneralSection_Name=Nom
GeneralSection_Description=Description
GeneralSection_Version=Version
defaultFlowLabel=Flux par d\u00e9faut
activityType=Type de t\u00e2che
activityType_task=T\u00e2che humaine
activityType_receiveTask=R\u00e9ception
activityType_sendTask=Envoi
activityType_serviceTask=Service
activityType_scriptTask=Script
gatwetypeAnd=AND
gatwetypeXor=XOR
gatewayType=Type de branchement
newCategory=Nouvelle cat\u00e9gorie
estimatadExecutionTimeLabel=Temps d'ex\u00e9cution estim\u00e9
dynamicLabelLabel=Nom affich\u00e9
dynamicDescriptionLabel=Description dynamique
dataNameLabel=Nom *
dataDescriptionLabel=Description
datatypeLabel=Type de donn\u00e9es
defaultValueLabel=Valeur par d\u00e9faut
updateConnector=Modifier ...
removeConnector=Supprimer
addConnector=Ajouter...
removeConnectorConfirmTitle=Supprimer ces connecteurs?
removeConnectorConfirmMessage=Voulez-vous supprimer les connecteurs suivant\:
connectorAdd_tooltip=Ajouter \u00e0 cette t\u00e2che
createForm_title=Cr\u00e9er un nouveau Formulaire
createForm_desc=Cr\u00e9er un nouveau formulaire avec les donn\u00e9es s\u00e9lectionn\u00e9es
createForm_defaultName=Formulaire
createForm_noData=Il n'existe pas de donn\u00e9 dans la t\u00e2che, cliquez sur terminez pour cr\u00e9er un formulaire vide
error_allreadyExists=Il existe d\u00e9j\u00e0 un Formulaire portant ce nom
error_documentAllreadyexist=Un document portant le m\u00eame nom existe d\u00e9j\u00e0
error_empty=le nom du formulaire ne peut pas \u00eatre vide
duplicateForm_desc=Cr\u00e9er ou Dupliquer un Formulaire parmis ceux de la liste
duplicateForm_title=Nouveau Formulaire
duplicateForm_radioCreate=Cr\u00e9er un nouveau Formulaire
duplicateForm_radioDuplicate=Dupliquer un formulaire parmis ceux propos\u00e9s ci-dessous
addForm=Ajouter...
addFormTitle=Ajouter un formulaire...
removeForm=Supprimer
editForm=Modifier
formUp=Monter
formDown=Descendre
selectAll=Tout s\u00e9lectionner
unselectAll=Tout d\u00e9s\u00e9lectionner
formAddFormCommandDescription=Ajouter un formulaire
formAddFormCommandLabel=Ajouter un formulaire
formRemoveFormCommand=Supprimer le formulaire s\u00e9lectionn\u00e9
FormsSection_widgetTypeDate=Date
FormsSection_widgetTypeText=Texte
FormsSection_widgetTypeFile=Fichier
FormsSection_widgetTypeCheckBox=Case \u00e0 cocher
FormsSection_widgetTypeRadio=Boutons radio
FormsSection_wizardVarsGroup_Title=Ajouter les champs correspondant \u00e0...
FormsSection_wizardVarsGroup_Tooltip=Choisissez les donn\u00e9e qui seront pr\u00e9sentes dans le formulaire.
FormsSection_ConfirmationTemplate=Mise en page de confirmation
subprocess=Sous-processus
connectionConnection=Condition
ResourceSection_ProcessTemplate=Layout du processus
ResourceSection_PageTemplate=Mod\u00e8le de formulaire
ResourceSection_ErrorTemplate=Erreur de layout
ResourceSection_ProcessTemplate_hint=Mise en page utilis\u00e9e autour de chaque formulaire du processus
ResourceSection_PageTemplate_hint=Mod\u00e8le utilis\u00e9 pour g\u00e9n\u00e9rer la mise en page de saisie des formulaires
ResourceSection_ErrorTemplate_hint=Mise en page utilis\u00e9e pour afficher un message d'erreur
ResourceSection_HostPageTemplate_hint=Conteneur de processus qui permet d'ajouter du contenu autour de la mise en page de processus ainsi que des ressources (javascript...)
ResourceSection_ViewTemplate_hint=Mod\u00e8le utilis\u00e9 pour g\u00e9n\u00e9rer la mise en page de consultation des formulaires
ResourceSection_LoginPage=Page de connexion
Browse=Parcourir...
Clear=Effacer
Remove=Supprimer
File=Ajouter un fichier...
Folder=Ajouter un dossier...
Add=Ajouter...
Download=Page par d\u00e9faut...
Error=Erreur
Internal=Interne
External=Externe
up=Monter
down=Descendre
durationLabel=Dur\u00e9e
priority=Priorit\u00e9
isMultiInstantiated=est Multi-Instanci\u00e9e
assignTo=Assign\u00e9e \u00e0
sourceParameter=Donn\u00e9e source
targetParameter=Donn\u00e9e du sous-processus
messageEventAddWizardPageDesc=Un Message peut \u00eatre envoy\u00e9 \u00e0 un autre processus.\nVous pouvez lui joindre des donn\u00e9es afin de les r\u00e9utiliser \u00e0 la reception de ce Message.
messageEventAddWizardPageTitle=Ajouter un Message
messageEventAddWizardPageName=Message Event
removeEventConfirmTitle=\u00cates vous s\u00fbr ?
removeEventConfirmMessage=Voulez-vous vraiment supprimer le(s) \u00e9v\u00e9nement(s) \:
selectMessageEventLabel=R\u00e9ception Message
messageFlowEventChoice=Choisissez un Message
eventType_messageStart=D\u00e9but Message
eventType_messageEnd=Envoi de fin
eventType_intermediateCatch=R\u00e9ception Message
eventType_intermediateThrow=Emission Message
messageEventType=Type de Message
editCondition=Modifier ...
timerCondition=Condition de la minuterie
timerConditionWizardTitle=Choix de la condition pour la minuterie
eventNameLabel=\u00c9l\u00e9ment cible
processNameLabel=Processus cible
isMandatory=Obligatoire
addTargetEventDialogTitle=Ajouter un \u00e9v\u00e9nement cible
gotoLabel=Allez \u00e0
fromLinksLabel=Source(s)
linkType=Type de lien
catchLink=Reception de Link
throwLink=Envoi de Link
selectSignalEventLabel=Signal
isLoopLabel=est une Boucle
testBeforeLabel=Tester avant l'\u00e9xecution
testAfterLabel=Tester apr\u00e8s l'\u00e9xecution
loopConditionLabel=Boucler tant que
maximumLoopLabel=Boucle maximum
noneLabel=Aucune
optionalLabel=(Optionnel)
confirmationMessage=Message de confirmation
localTemplate=Appliquer un look'n'feel
name=Nom
version=Version
selectLocalTemplateWizardPageTitle=S\u00e9lectionner un template web
selectLocalTemplateWizardPageDescription=Choisir un template web \u00e0 partir de la liste fournie
webTemplates=Templates Web
saveAsTemplate_title=Enregistrer en tant que patron
saveAsTemplate_templateLabel=Nom du template
saveAsTemplate_previewPathLabel=Aper\u00e7u
ResourceSection_SaveAsTemplate=Enregistrer en tant que patron
Edit=Modifier
ResourceSection_importTemplate=Importer...
ResourceSection_export=Exporter...
ResourceSection_ViewTemplate=Mod\u00e8le de formulaire de consultation
StepSummarySectionContribution_title=R\u00e9capitulatif de l'\u00e9tape
save=Enregistrer
gatwetypeInclusive=Inclusif
ResourceSection_AutoLogin=Authentification automatique
ResourceSection_AutoLoginTooltip=Cocher cette option pour dispenser l'authentification d'un utilisateur sp\u00e9cifique ( peut \u00eatre utilis\u00e9 pour l'acc\u00e8s anonyme)
showLabel=Nom affich\u00e9
errorEvent_error=Erreur associ\u00e9e
endErrorEvent_error=Code d'erreur
mustBeSet=Doit \u00eatre renseign\u00e9
errorEvent_errorCodeHint=Ceci est le code d'erreur qui sera envoy\u00e9
errorEvent_errorCodeCatchHint=Ceci est le code d'erreur qui sera attrap\u00e9. Si aucun code n'est sp\u00e9cifi\u00e9 tous les types d'erreurs seront attrap\u00e9es (m\u00eame celles venant de connecteurs).
january=Janvier
february=F\u00e9vrier
march=Mars
april=Avril
may=Mai
june=Juin
july=Juillet
august=Ao\u00fbt
september=Septembre
october=Octobre
november=Novembre
december=D\u00e9cembre
monday=Lundi
tuesday=Mardi
wednesday=Mercredi
thursday=Jeudi
friday=Vendredi
saturday=Samedi
sunday=Dimanche
dynamicLabelHint=Vous pouvez personnaliser le label de cette \u00e9tape qui sera affich\u00e9 dans la User XP (par exemple\: Validez la requ\u00eate de ${loggedUser} )
dynamicDescriptionHint=Vous pouvez personnaliser la description de cette \u00e9tape qui sera affich\u00e9e dans la User XP (par exemple\: ${loggedUser} demande ${nbDays} de vacances)
stepSummaryHint=Vous pouvez personnaliser la description apr\u00e8s la r\u00e9alisation de cette \u00e9tape dans le portail
executionTimeHint=Temps allou\u00e9 \u00e0 l'\u00e9tape. Utilis\u00e9 dans la UserXP pour d\u00e9tecter les \u00e9tapes "At Risk" et "Overdue"
targetProcessMessageHint=Choississez un processus existant ou entrez le nom du processus cible
targetEventMessageHint=Choisissez un \u00e9v\u00e9nement de R\u00e9ception Message ou une t\u00e2che de R\u00e9ception existant(e) ou saisissez un nom
signalEvent_catchHint=Ceci est le code du Signal qui sera attrap\u00e9.
signalEvent_throwHint=Ceci est le code du Signal qui sera envoy\u00e9.
confirmDeleteFile_title=Etes-vous s\u00fbre ?
confirmDeleteFile_msg=Le(s) fichier(s) s\u00e9lectionn\u00e9(s) va \u00eatre supprim\u00e9(s), voulez vous continuer?
multipleWidget=Multiples
pageFlow=Formulaire
skip=Passer
pageFlowTransientDataConnectors=Connecteurs  pour l'initialisation de donn\u00e9e
pageFlowTransientData=Donn\u00e9es Transiantes
messageEventAddWizardNameAlreadyExists=Ce nom existe d\u00e9j\u00e0
formsTabLabel=Formulaires
transientDatTabLabel=Donn\u00e9es Transiantes
chooseFont=Choisir une Police...
ChooseFigure=Choisir un \u00e9l\u00e9ment existant...
applyStyle=Appliquer le m\u00eame style que
activityType_callActivity=Activit\u00e9 Appelante
skipPageFlowTooltip=Si s\u00e9lectionn\u00e9e, cette t\u00e2che se comportera comme une soumission automatique.\n Cela signifie que la page de l'\u00e9tape doit \u00eatre ouverte par un utilisateur. Cette page sera automatiquement soumise. Ceci est diff\u00e9rent d'une t\u00e2che abstraite.
activityType_abstractTask=Abstraite
ResourceSection_HostPageTemplate=Conteneur de l'application
GeneralSection_ActivateValidation=Activer la validation
ResourceSection_OverWrite_title=Etes-vous s\u00fbre ?
ResourceSection_OverWrite_msg=Les r\u00e9glages du Look'n'Feel courant appliqu\u00e9s  au processus seront perdus.
saveAsTemplate_error=Impossible de sauvegarder le look 'n' feel.\nVeuillez regarder vos logs.
saveAsTemplate_import_error=Impossible d'importer le look 'n' feel.\nVeuillez regarder vos logs.
confirmationPathTooltip=Vous pouvez mettre un mod\u00e8le de confirmation seulement si il existe un pageflow de saisie
confirmationMessageTooltip=Vous pouvez mettre un message de confirmation seulement si il existe un pageflow de saise
ResourceSection_BasedOnLookAndFeel=Actuellement bas\u00e9 sur\:
widgetRemovedWarning_title=Attention
widgetRemovedWarning_msg=Ce champ va \u00eatre supprim\u00e9\nN'oubliez pas de l'enlever de votre mise en page personnalis\u00e9e\!
autoMap=Association automatique
autoMap_description=pour les variables portant le m\u00eame nom ou le pr\u00e9fixe \u00ab sub_ \u00bb
addMessageContent=Contenu du message
correlation=Corr\u00e9lation entre instances
correlationDescription=Utilisez une corr\u00e9lation si vous avez besoin de coordonner des instances sp\u00e9cifiques de deux processus.
useCorrelationkeys=Utiliser la corr\u00e9lation par cl\u00e9s
AddCorrelation=Ajouter
removeCorrelation=Supprimer
removeMessageContent=Supprimer
addMessageContentButton=Ajouter
addMessageContentDescription=Vous pouvez laisser le contenu du message vide pour synchroniser les instances entre deux processus. Pour s\u00e9lectionner des instances sp\u00e9cifiques, utilisez l'onglet \u00ab Corr\u00e9lation entre instances \u00bb.
autoFillMessageContent=Remplissage automatique
useExpression=Utiliser l'expression
useDecisionTable=Table de d\u00e9cision d'utilisation
editDecisionTable=Modifier la table de d\u00e9cision...
and=ET
takeTransition=Prendre la transition
dontTakeTransition=Ne pas prendre la transition
emptyName=Le nom est vide
operationExplanation=Une op\u00e9ration est une action qui met \u00e0 jour la valeur d'une variable lorsqu'une t\u00e2che est ex\u00e9cut\u00e9e.  Fournir la liste des op\u00e9rations \u00e0 ex\u00e9cuter pour cette t\u00e2che. Les op\u00e9rations sont ex\u00e9cut\u00e9es dans l'ordre d'apparition.
highestPriority=Plus haute
lowestPriority=Plus basse
underNormalPriority=Basse
aboveNormalPriority=Haute
normalPriority=Normale
transitionOrderingExplanation=L'ordre de transition d\u00e9termine quels transition hors de la branche est activ\u00e9e. Chaque passage a une condition. Ces conditions sont \u00e9valu\u00e9es dans l'ordre, et la premi\u00e8re transition avec une condition qui est vraie est prise. Si aucune condition n'est vraie, la transition par d\u00e9faut est prise. Pour d\u00e9finir la condition d'une transition, s\u00e9lectionner la transition et allez dans le panneau d\u00e9tails, onglet g\u00e9n\u00e9ral, volet g\u00e9n\u00e9ral.
transitionOrderingExplanation_Short=Afin de d\u00e9terminer quel flux de s\u00e9quence sortant \u00e0 activer, les conditions sont \u00e9valu\u00e9es dans l'ordre indiqu\u00e9 ci-dessous.
documentDefaultName=Document
remove=Supprimer
selectDocumentDescription=Veuillez s\u00e9lectionner un document dans le r\u00e9f\u00e9rentiel de documents \: {0}
explanationExternalDocument=Le document est g\u00e9r\u00e9 par un composant tiers. Veuillez fournir l'URL pour y acc\u00e9der.
explanationInternalDocument=Le document est g\u00e9r\u00e9 par {0}. Vous pouvez fournir un fichier pour l'initialiser.
selectDocumentDialogTitle=S\u00e9lectionnez un Document du repository {0}
importEtc=Importer...
AddSimple=Ajouter
description=Description
mimeType=Type MIME
hintExternalUrl=Exemple \: http\://myGED.com
hintMimeTypeDocument=Exemples \: application/octet-stream, image/ico
calledProcessVersionHint=Si l'expression est vide ou retour null la derni\u00e8re version d\u00e9ploy\u00e9e sera utilis\u00e9e
avoidElement=\u00c9viter les \u00e9l\u00e9ments
avoidElementHint=\u00c9viter les \u00e9l\u00e9ments en utilisant le chemin le plus court
multiInstance_useCollection=Utiliser une collection
multiInstance_useCardinality=Utilisation de la cardinalit\u00e9
multiInstance_inputData=Donn\u00e9es d'entr\u00e9e
multiInstance_outputData=Donn\u00e9es de sortie
clearSelection=Effacer la s\u00e9lection de la zone de s\u00e9lection
multiInstance_inputDataDescription=Carte d'association de la collection utilis\u00e9e pour instancier cette instance pour les donn\u00e9es sp\u00e9cifi\u00e9es dans cette instance.
multiInstance_sequentialDescription=Pr\u00e9cise si les activit\u00e9s seront ex\u00e9cut\u00e9es s\u00e9quentiellement ou en PARALELLE
multiInstance_completionConditionLabel=Condition d'ach\u00e8vement
multiInstance_completionConditionDescription=Retourne un bool\u00e9en pour savoir quand la multi-instanciation est termin\u00e9e.
multiInstance_sequentialButton=S\u00e9quentiel
multiInstance_useCollectionDescription=Fournir une collection. Une instance est cr\u00e9\u00e9e pour chaque \u00e9l\u00e9ment de la collection.
multiInstance_outputDataDescription=Mettre les donn\u00e9es locales de l'instance dans la collection d'instances finies.
multiInstance_useCardinalityDescription=Pr\u00e9ciser le num\u00e9ro d'instance, dont vous avez besoin.
multiInstance_listOutputDataDescription=Place les donn\u00e9es de sortie pr\u00e9cis\u00e9es \u00e0 l'int\u00e9rieur de cette liste.
multiInstance_listOutputDataLabel=Liste des r\u00e9sultats de sortie
dublicateIdErrorMessage={0} id existe d\u00e9j\u00e0 dans la table {1}
messageContentIdExistenceWarning={0} id n'est pas d\u00e9finie dans le message {1}
NoIncomingMessageWarning=Il n'y a aucun message entrant dans le repository
throwMessageExpressionTypeWarning=Assurez vous que le r\u00e9sultat de l'expression est d\u00e9fini dans la d\u00e9finition de message
correlationKey=Cl\u00e9 de corr\u00e9lation
correlationKeyHelp=Vous pouvez d\u00e9finir jusqu'\u00e0 5 cl\u00e9s de corr\u00e9lation. Le nom de la cl\u00e9 et sa valeur sont concat\u00e9n\u00e9s et le r\u00e9sultat est stock\u00e9 dans la base de donn\u00e9es. Le r\u00e9sultat ne doit pas d\u00e9passer 128 caract\u00e8res.
correlationValue=Valeur de corr\u00e9lation
messageContentID=\u00c9l\u00e9ment de contenu
expressionName=Valeur
generalPropertiesSectionDescription=Nommer et d\u00e9crire l'\u00e9l\u00e9ment s\u00e9lectionn\u00e9 du diagramme.
diagramSectionDescription=Donnez un nom, une version et une description \u00e0 votre diagramme.
catchMessageContentEventSectionDescription=Un message est une information envoy\u00e9e par une t\u00e2che d'envoie ou message de r\u00e9ception dans un autre pool. D\u00e9crivez comment g\u00e9rer les donn\u00e9es contenues dans ce message. Le message doit d\u00e9j\u00e0 \u00eatre d\u00e9fini dans une t\u00e2che d'envoi ou de r\u00e9ception.
catchMessageEventCorrelationSectionDescription=Les cl\u00e9s de corr\u00e9lation sont utilis\u00e9es pour v\u00e9rifier qu'un message envoy\u00e9 par une t\u00e2che d'envoie est re\u00e7u par la t\u00e2che de r\u00e9ception de l'instance du processus. D\u00e9crivez comment g\u00e9rer les cl\u00e9s de corr\u00e9lation contenues dans un message re\u00e7u. Les cl\u00e9s doivent d\u00e9j\u00e0 \u00eatre d\u00e9finies dans une t\u00e2che d'envoi.
documentPropertySectionDescription=Un document est une pi\u00e8ce jointe contenant des informations li\u00e9es au processus. Sp\u00e9cifier les documents li\u00e9s au processus.
laneSectionDescription=Une lane est une subdivision d'un processus (pool). Les lanes sont g\u00e9n\u00e9ralement utilis\u00e9es pour regrouper les t\u00e2ches qui sont effectu\u00e9es par un groupe fonctionnel ou une partie d'une organisation. Cela signifie que toutes les t\u00e2ches de la lane peuvent \u00eatre assign\u00e9es \u00e0 un m\u00eame acteur. Par cons\u00e9quent, donner \u00e0 la lane le nom de l'acteur ou du groupe fonctionnel est consid\u00e9r\u00e9 comme une bonne pratique. Vous pouvez \u00e9galement donner une description \u00e0 la lane.
looknfeelPropertySectionDescription=Le look-and-feel d\u00e9finit la disposition et le style des formulaires dans une application web. Vous pouvez modifier un am\u00e9nagement existant ou un mod\u00e8le en modifiant le code HTML. Vous pouvez \u00e9galement t\u00e9l\u00e9charger un nouveau fichier HTML, mais ce n'est pas recommand\u00e9 parce que vous pouvez \u00e9craser le mod\u00e8le initial.
resourcePropertySectionDescription=Une ressource est un fichier utilis\u00e9 par l'application web. Ces fichiers sont stock\u00e9s dans des dossiers. Ajouter les fichiers requis pour votre application. Vous pouvez \u00e9galement modifier les fichiers de ressources et configurer la page de connexion, soit en t\u00e9l\u00e9chargeant le fichier JSP (JavaServer Page) et en le modifiant soit en ajoutant un nouveau directement. Faites attention \u00e0 ne pas supprimer de fichiers utiles au bon fonctionnement.
parametersMappingSectionDescription=Cette association d\u00e9finit les relations entre les variables du processus parent et un sous-processus. Vous pouvez configurer les valeurs de variables \u00e0 mapper automatiquement, et vous pouvez sp\u00e9cifier des associations explicites entre les variables de processus et sous-processus.
userXPSectionDescription=Cette information s'affiche sur une t\u00e2che dans le portail. L'estimation de la dur\u00e9e de la t\u00e2che est utilis\u00e9e pour calculer le temps restant n\u00e9cessaire pour la t\u00e2che apr\u00e8s qu'elle ait commenc\u00e9e. Si vous ne sp\u00e9cifiez pas les informations du portail, le nom et la description de la sous-fen\u00eatre g\u00e9n\u00e9rale sont utilis\u00e9s.
confirmationPropertySectionDescription=Un message de confirmation s'affiche \u00e0 la fin d'une s\u00e9quence d'\u00e9tapes effectu\u00e9e par un utilisateur, indiquant qu'aucune autre action n'est n\u00e9cessaire. Sp\u00e9cifier la pr\u00e9sentation et le contenu du message.
loopSectionDescription=La r\u00e9currence signifie qu'une activit\u00e9 est ex\u00e9cut\u00e9e \u00e0 plusieurs reprises jusqu'\u00e0 ce qu'une condition soit remplie. Pour ex\u00e9cuter plusieurs instances de la t\u00e2che en m\u00eame temps, s\u00e9lectionnez 'Multi-instanciation', parall\u00e8le ou s\u00e9quentielle. Pour ex\u00e9cuter la t\u00e2che de fa\u00e7on it\u00e9rative sans r\u00e9pliquer ses instances, s\u00e9lectionnez 'Boucle'. Pour ex\u00e9cuter la t\u00e2che une fois (aucune r\u00e9currence) s\u00e9lectionnez 'Aucune'. Sp\u00e9cifiez la condition comme une expression ou un nombre d'it\u00e9rations (cardinalit\u00e9).
correlationHelp=Une cl\u00e9 de corr\u00e9lation est un identificateur qui est utilis\u00e9 pour envoyer ou recevoir un message afin de l'envoyer vers les instances du process attendue.
exportSuccessfullTitle=Exporter le r\u00e9sultat
exportSuccessfullMsg=Look'n'feel export\u00e9 avec succ\u00e8s.
exporting=Export...
importResultTitle=R\u00e9sultat de l'importation
importSuccessMsg=Look'n'feel import\u00e9 avec succ\u00e8s.
oneCorrelationAtLeastNeeded=Au moins une cl\u00e9 de corr\u00e9lation doit \u00eatre sp\u00e9cifi\u00e9e.
valueShouldBeDefined=D\u00e9finir une valeur pour l'id {0}.
idShouldBeDefined=Un id doit \u00eatre d\u00e9fini pour la valeur {0}.
conditionExpresssionHelpMessage=Exemples \: myvariable>500 ; \!isValid ; parameter1\=\=parameter2 ; etc
errorOutputDataMultiInstanceCollection=Une liste de r\u00e9sultats de sortie doit \u00eatre d\u00e9finie
errorInputDataMultiInstanceCollection=Une collection doit \u00eatre d\u00e9finie
messagesSectionDescription=Une t\u00e2che d'envoi ou un message d'envoi \u00e9met des messages vers des t\u00e2ches de r\u00e9ception ou messages de r\u00e9ception dans les autres pools. D\u00e9finissez les messages qui seront envoy\u00e9s aux autres pool, y compris les cl\u00e9s de corr\u00e9lation et les donn\u00e9es contenues dans les messages.
minutes=minutes
every=Chaque
minuteLabel=minute(s)
hourly=Horaire
daily=Quotidien
weekly=Hebdomadaire
monthly=Mensuel
yearly=Annuel
generateCronButtonLabel=G\u00e9n\u00e9rer l'expression "cron"
at=\u00c0
hourLabel=heure(s)
startTime=Date et heure de d\u00e9but
everyWeekDay=Chaque jour de semaine
dayLabel=jour(s)
day=jour
ofEvery=de chaque
monthLabel=mois
the=Le
first=Premier
second=Second
third=Troisi\u00e8me
fourth=Quatri\u00e8me
fifth=Cinqui\u00e8me
of=de
startTimerConditionDescription=D\u00e9finissez une condition de d\u00e9but bas\u00e9e sur la r\u00e9currence, une date fixe ou une dur\u00e9e. La r\u00e9currence ou l'\u00e9valuation de la dur\u00e9e d\u00e9butera lorsque le processus sera activ\u00e9.
timerConditionDescription=D\u00e9finissez une condition de minuterie bas\u00e9e sur une date fixe ou une dur\u00e9e. La r\u00e9currence ou l'\u00e9valuation de la dur\u00e9e d\u00e9butera lorsque le processus sera activ\u00e9.
startTimerConditionHint=Les formats attendus sont une expression "cron" (r\u00e9currence), un java.util.Date (date fixe) ou un java.lang.Long (dur\u00e9e)
timerConditionHint=Format attendu \: un java.util.Date (date fixe) ou un java.lang.Long (dur\u00e9e)
cronShortDescription=Bas\u00e9 sur un expression "cron". <A href\="http\://www.quartz-scheduler.org/documentation/quartz-1.x/tutorials/crontrigger">?</A>
invalidCronExpression=Expression "cron" invalide
mustBeAnValueBetween=Doit \u00eatre une valeur comprise entre {0} et {1}.
notAValidNumber=Nombre invalide
mustBeGreaterThan=Doit \u00eatre sup\u00e9rieur \u00e0 {0}
cantBeGreaterThan=Ne peut \u00eatre sup\u00e9rieur \u00e0 {0}
cycle=R\u00e9currence
fixedDate=Date fixe
selectDateLabel=S\u00e9lectionnez une date
basedOn=Condition de minuterie bas\u00e9e sur une
generateFixedDateLabel=G\u00e9n\u00e9rer l'expression d'une date 
selectDurationLabel=S\u00e9lectionnez une dur\u00e9e
generateDurationLabel=G\u00e9n\u00e9rer l'expression d'une dur\u00e9e
notAValidInput=La valeur [{0}] n'est pas une entr\u00e9e valide
transientDataWarning=Veuillez noter que les donn\u00e9es transitoires utilis\u00e9es dans les op\u00e9rations de tache ne seront plus prises en charge \u00e0 l'avenir. 
errorDisplayLabelMaxLength=Le texte \u00e0 afficher est trop long. Le nombre maximal de caract\u00e8res est {0}.
warningDisplayLabelMaxLength=Le nombre maximal de caract\u00e8res est de {0} pour l'affichage du label, de {1} pour les descriptions.
