#X-Generator: crowdin.com
NewProcessButtonLabel=\u65b0\u898f
OpenProcessButtonLabel=\u958b\u304f
SaveProcessButtonLabel=\u4fdd\u5b58
PrintProcessButtonLabel=\u5370\u5237
CopyButtonLabel=\u30b3\u30d4\u30fc
PasteButtonLabel=\u8cbc\u308a\u4ed8\u3051
HelpButtonLabel=\u30d8\u30eb\u30d7
WelcomeButtonLabel=\u3088\u3046\u3053\u305d
openProcessWizardPage_title=\u65e2\u5b58\u306e\u30c0\u30a4\u30a2\u30b0\u30e9\u30e0\u3092\u958b\u304f
unableTofindLogMessage=\u30ed\u30b0 \u30d5\u30a1\u30a4\u30eb\u3092\u898b\u3064\u3051\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3002\u307e\u3060\u4f5c\u6210\u3055\u308c\u3066\u3044\u306a\u3044\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
unableTofindLogTitle=\u958b\u304f\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093
confirmContributionInstall_message=\u30b3\u30f3\u30c8\u30ea\u30d3\u30e5\u30fc\u30b7\u30e7\u30f3 {0} \u3092\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3057\u3066\u3088\u308d\u3057\u3044\u3067\u3059\u304b\uff1f
confirmContributionInstall_title=\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3092\u78ba\u8a8d
error=\u30a8\u30e9\u30fc\uff01
contributionSuccessfullyInstalled=\u9078\u629e\u3057\u305f\u30b3\u30f3\u30c8\u30ea\u30d3\u30e5\u30fc\u30b7\u30e7\u30f3\u306f\u6b63\u5e38\u306b\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3055\u308c\u3066\u3044\u307e\u3059\u3002\u624b\u52d5\u3067\u305d\u308c\u3092\u52d5\u4f5c\u3055\u305b\u308b\u306b\u306f\u3001\u305d\u306e\u4f9d\u5b58\u95a2\u4fc2\u3092\u8ffd\u52a0\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
success=\u6210\u529f
notLoggedIn=\u3042\u306a\u305f\u306f\u30ed\u30b0\u30a4\u30f3\u3057\u3066\u3044\u307e\u305b\u3093\uff01\u30b3\u30f3\u30c8\u30ea\u30d3\u30e5\u30fc\u30b7\u30e7\u30f3\u3092\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3059\u308b\u306b\u306f\u3001{0} \u30a2\u30ab\u30a6\u30f3\u30c8\u3067\u7f72\u540d\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
errorWhileDownloadingContrib=\u30b3\u30f3\u30c8\u30ea\u30d3\u30e5\u30fc\u30b7\u30e7\u30f3\u3092\u30c0\u30a6\u30f3\u30ed\u30fc\u30c9\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002\u30a4\u30f3\u30bf\u30fc\u30cd\u30c3\u30c8\u63a5\u7d9a\u3092\u78ba\u8a8d\u3057\u3066\u30ed\u30b0\u30a4\u30f3\u3092\u78ba\u5b9f\u306b\u884c\u306a\u3063\u3066\u304f\u3060\u3055\u3044\u3002
installingFromContribution=\u30b3\u30f3\u30c8\u30ea\u30d3\u30e5\u30fc\u30b7\u30e7\u30f3\u3092\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb
downloading=\u30c0\u30a6\u30f3\u30ed\u30fc\u30c9\u4e2d
installingContribution=\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u4e2d
PreferencesButtonLabel=\u74b0\u5883\u8a2d\u5b9a
badWorkspaceVersionTitle=\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u306e\u7af6\u5408
badWorkspaceVersionMessage=\u3042\u306a\u305f\u306e\u73fe\u5728\u306e\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9 {0} \u306f\u3001 {2} {3} \u3068\u7570\u306a\u308b\u30d0\u30fc\u30b8\u30e7\u30f3 ({1}) \u3092\u6301\u3063\u3066\u3044\u307e\u3059\u3002\u5225\u306e\u30e6\u30fc\u30b6\u30fc\u304c\u3053\u306e\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u3092\u6700\u8fd1\u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u306b\u79fb\u884c\u3057\u3066\u3044\u308b\u5834\u5408\u304c\u3042\u308a\u307e\u3059\u3002\u3082\u306f\u3084 {4} \u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u3067\u3053\u306e\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u3092\u4f7f\u7528\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002\u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u304c\u8d77\u52d5\u3055\u308c\u307e\u3059\u3002
resfreshConnectors=\u30b3\u30cd\u30af\u30bf\u3092\u66f4\u65b0\u4e2d...
aboutText={2} Edition\nVersion \: {0}\nBuild id \: {1}\nCopyright \u00a9 {3} S.A., 2009-2013\nAll rights reserved.\u00a0\n\nJapanese translation by Akira IWATA
maximizeCoolbarTooltip=\u6700\u5927\u5316
reduceCoolbarTooltip=\u6700\u5c0f\u5316
initializingCurrentRepository=\u73fe\u5728\u306e\u30ea\u30dd\u30b8\u30c8\u30ea\u3092\u521d\u671f\u5316\u3057\u3066\u3044\u307e\u3059...
shuttingDown=\u30a8\u30f3\u30b8\u30f3\u3092\u505c\u6b62\u3057\u3066\u3044\u307e\u3059...
jreNotFoundTitle=\ JRE \u3092\u691c\u51fa\u3067\u304d\u307e\u305b\u3093
jreNotFoundMessage=JRE \u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002Java \u306e\u74b0\u5883\u8a2d\u5b9a\u30da\u30fc\u30b8\u3092\u958b\u304d\u307e\u3059\u304b\uff1f\n
invalidWorkspaceTitle=\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u304c\u7121\u52b9\u3067\u3059
invalidWorkspace=\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u304c\u7121\u52b9\u3067\u3059\u30026.X \u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u306e\u307f\u3092\u30a4\u30f3\u30dd\u30fc\u30c8\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u3092\u30a4\u30f3\u30dd\u30fc\u30c8\u305b\u305a\u306b\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c\u521d\u671f\u5316\u3055\u308c\u307e\u3059\u3002
failedToOpenLogTitle=\u30ed\u30b0\u3092\u958b\u304f\u306e\u306b\u5931\u6557\u3057\u307e\u3057\u305f
failedToOpenLogMessage=Bonita BPM Studio\u3092\u4f7f\u7528\u3057\u3066\u958b\u304f\u306b\u306f\u3001\u30ed\u30b0 \u30d5\u30a1\u30a4\u30eb\u304c\u5927\u304d\u3059\u304e\u307e\u3059\u3002\n\u4ed6\u306e\u5916\u90e8\u306e\u30c6\u30ad\u30b9\u30c8 \u30a8\u30c7\u30a3\u30bf\u3092\u4f7f\u7528\u3057\u3066\u3001\u6b21\u306e\u30d5\u30a1\u30a4\u30eb\u3092\u958b\u3044\u3066\u3057\u3066\u304f\u3060\u3055\u3044\: {0}
doNotDisplayForOtherDiagrams=\u305d\u306e\u4ed6\u306e\u65b0\u3057\u3044\u30c0\u30a4\u30a2\u30b0\u30e9\u30e0\u306f\u8868\u793a\u3057\u307e\u305b\u3093
noProcessAvailable=\u6700\u8fd1\u958b\u3044\u3066\u306a\u3044\u30c0\u30a4\u30a2\u30b0\u30e9\u30e0
offlineRepositoryTitle=\u30aa\u30d5\u30e9\u30a4\u30f3\u306e\u30ea\u30dd\u30b8\u30c8\u30ea 
offlineRepositoryMessage={0} \u30ea\u30dd\u30b8\u30c8\u30ea\u306f\u3001\u73fe\u5728\u30aa\u30d5\u30e9\u30a4\u30f3\u3067\u3059\u3002\u30aa\u30d5\u30e9\u30a4\u30f3 \u30e2\u30fc\u30c9\u3067\u306e\u5909\u66f4\u307e\u305f\u306f\u30b3\u30df\u30c3\u30c8\u306f\u3067\u304d\u307e\u305b\u3093\u3002
incompatibleJavaVersionTitle=\u4e92\u63db\u6027\u306e\u306a\u3044 java \u30e9\u30f3\u30bf\u30a4\u30e0\u74b0\u5883\u30d0\u30fc\u30b8\u30e7\u30f3
incompatibleJavaVersionMessage=\u4e92\u63db\u6027\u306e\u306a\u3044 JRE \u30d0\u30fc\u30b8\u30e7\u30f3 ({1}) \u3092\u4f7f\u7528\u3057\u3066 {0} \u3092\u5b9f\u884c\u3057\u3066\u3044\u307e\u3059\u3002\nJava \u306e\u8981\u4ef6\u3092\u78ba\u8a8d\u3059\u308b\u305f\u3081\u306b\u306f\u3001 <a href\="http\://documentation.bonitasoft.com/hardware-and-software-requirements">\u30aa\u30f3\u30e9\u30a4\u30f3 \u30c9\u30ad\u30e5\u30e1\u30f3\u30c8</a> \u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
