shareRepositoryProgressTitle=Compartir - estado de progresi\u00f3n
shareRepositoryProgress=Un repositorio git local ha sido creado. Los archivos locales necesitan ser commiteados y empujados (Push) ahora.
warningRepoNotPushedMsg=El repositorio Git ha sido inicializado. Sin embargo no se ha configurado una referencia remota para este repositorio. Usted no puede `Push` y compartir el contenido de su proyecto sin referencia remota.\n\nSi usted no sabe lo que una referencia remota es, te invitamos a leer la <a>documentaci\u00f3n</a>.
showGitStaging=Mostrar Git Staging
openGitPreferences=Preferencias
shareWithGit=Compartir con Git
clone=Clonar
cloneRepoDialogTitle=Nuevo proyecto
cloneRepoDialogMsg=Clonar dentro de un nuevo proyecto con nombre\:
repositoryClonedTitle=Repositorio clonado
repositoryClonedMsg=El repositorio %s ha sido clonado con \u00e9xito en Bonita.
repositoryClonedWithMigration=El repositorio %s ha sido clonado con \u00e9xito en Bonita.\n\nEl contenido de la rama (branch) ha sido migrado tambi\u00e9n de la versi\u00f3n %s a %s. Por lo tanto, todos los colaboradores de esta rama de repositorio tendr\u00e1n que usar un Bonita Studio en la versi\u00f3n %s, de lo contrario no podr\u00e1n trabajar en esta rama.\n\nAntes de hacer push de los cambios de migraci\u00f3n, aseg\u00farese de que otros usuarios no est\u00e9n trabajando en esta rama del repositorio.
targetRepoPageTitle=Destino de clonar
targetRepoPageMsg=Introduzca un nombre para nombrar al proyecto de destino en el \u00e1rea de trabajo
workspaceLocation=Nombre del proyecto
workspaceLocationHint=Nombre del proyecto dentro del espacio de trabajo
noBonitaProjectDescriptorFound=No se ha encontrado el descriptor de proyecto Bonita en el repositorio clonado '%s'.\nPor favor comprueba que su clon es un proyecto de Bonita.
noVersionFoundInBonitaProjectDescriptor=No se ha encontrado ninguna versi\u00f3n en el descriptor de proyecto Bonita ubicado en '%s'.\nPor favor comprueba que su clon es un proyecto de Bonita.
noNatureFoundInBonitaProjectDescriptor=El repositorio clonado en '%s' no es un proyecto Bonita.\nPor favor comprueba que su clon es un proyecto de Bonita.
cannotMigrateRepository=No se puede migrar el proyecto clonado de la versi\u00f3n %s a la versi\u00f3n %s.\nNo es posible clonar un proyecto a una versi\u00f3n superior a %s.
pull=Pull
push=Push rama '%s'...
showHistory=Mostrar historial
share=Compartir
shareRepositoryTitle=Compartir proyecto actual
shareRepositoryDesc=Comparte el proyecto actual con Git para colaborar en \u00e9l con otras personas.
repository=Proyecto
repoAlreadyShared=Este proyecto ya est\u00e1 compartido.
switchTo=Cambiar a...
reset=Reinicializar...
fetch=Actualizar desde Upstream
pushToUpstream=Push a Upstream
commit=Commitear...
rebase=Rebase...
merge=Fusi\u00f3n...
gitInit=Inicializar el repositorio git
createGitIgnore=Crear un archivo `.gitignore` proprio
firstCommit=Commitear el contenido del proyecto Bonita
firstPush=Push el primer commit
firstCommitMessage=Primer mensaje de commit
commitAndPush=Commit y push
repositoryStatus=Estado
legacyFormsRemoved=6.x formularios basados en la tecnolog\u00eda de Google Web Toolkit (GWT) ya no est\u00e1n soportados. Dichos formularios y su contenido relacionado han sido eliminados del repositorio.
clonedBranchContentIsNotCompatible=La rama clonada '%s' no es compatible con esta versi\u00f3n de Bonita Studio. Utilice una versi\u00f3n m\u00e1s reciente de Bonita Studio o compruebe una rama compatible.
confirmMigratonTitle=Migraci\u00f3n requerida
confirmMigraton=Es necesario migrar el repositorio clonado.\n\u00bfContinuar la operaci\u00f3n de clonaci\u00f3n y realizar la migraci\u00f3n?
cloneOperationCancelled=La operaci\u00f3n de clon ha sido abortada.