shareRepositoryProgressTitle=Compartilhar - estado de progresso
shareRepositoryProgress=Um reposit\u00f3rio git local foi criado. Os arquivos locais t\u00eam de ser atualizados e gravados agora.
warningRepoNotPushedMsg=O reposit\u00f3rio Git foi inicializado. No entanto, voc\u00ea n\u00e3o configurou um controle remoto para este reposit\u00f3rio. Voc\u00ea n\u00e3o pode `For\u00e7ar` e compartilhar o conte\u00fado do seu projeto sem um controle remoto.\n\nSe voc\u00ea n\u00e3o conhece o que \u00e9 um controle remoto, n\u00f3s convidamos voc\u00ea a ler a <a>documenta\u00e7\u00e3o</a>.
showGitStaging=Mostrar Prepara\u00e7\u00e3o Git
openGitPreferences=Prefer\u00eancias
shareWithGit=Compartilhar com o Git
clone=Clonar
cloneRepoDialogTitle=Novo projeto
cloneRepoDialogMsg=Clonar em um novo projeto com nome\:
repositoryClonedTitle=Reposit\u00f3rio clonado
repositoryClonedMsg=Reposit\u00f3rio %s foi clonado com sucesso em Bonita.
repositoryClonedWithMigration=O reposit\u00f3rio %s foi clonado com sucesso em Bonita.\n\nO conte\u00fado de checagem da filial tamb\u00e9m foi migrado da vers\u00e3o %s para %s. Por conseguinte, todos os colaboradores deste reposit\u00f3rio tamb\u00e9m ter\u00e3o que usar um Studio Bonita na vers\u00e3o %s, caso contr\u00e1rio eles n\u00e3o poder\u00e3o mais trabalhar neste branch.\n\nAntes de impulsionar as mudan\u00e7as de migra\u00e7\u00e3o, certifique-se de que outros usu\u00e1rios n\u00e3o est\u00e3o trabalhando neste branch do reposit\u00f3rio.
targetRepoPageTitle=Destino do clone
targetRepoPageMsg=Digite um nome para o nome do projeto destino no espa\u00e7o de trabalho
workspaceLocation=Nome do projeto
workspaceLocationHint=Nome do projeto dentro do espa\u00e7o de trabalho
noBonitaProjectDescriptorFound=O descritor do projeto Bonita n\u00e3o foi encontrado no reposit\u00f3rio clonado '%s'.\nPor favor verifique se clonou um reposit\u00f3rio Bonita.
noVersionFoundInBonitaProjectDescriptor=N\u00e3o foi encontrada nenhuma vers\u00e3o no descritor do projeto Bonita localizado em '%s'.\nPor favor verifique o clone do reposit\u00f3rio Bonita.
noNatureFoundInBonitaProjectDescriptor=O reposit\u00f3rio clonado em '%s' n\u00e3o \u00e9 um projeto Bonita.\nPor favor verifique o clone do reposit\u00f3rio Bonita.
cannotMigrateRepository=N\u00e3o pode ser feita a migra\u00e7\u00e3o do reposit\u00f3rio clonado da vers\u00e3o %s para a vers\u00e3o %s.\nN\u00e3o \u00e9 poss\u00edvel clonar um reposit\u00f3rio numa vers\u00e3o superior a %s.
pull=Puxe
push=Empurrar Branch '%s'...
showHistory=Mostrar hist\u00f3rico
share=Compartilhar
shareRepositoryTitle=O projeto atual
shareRepositoryDesc=Compartilhe o projeto atual com o Git, a fim de colaborar com outras pessoas.
repository=Projeto
repoAlreadyShared=Este projeto j\u00e1 est\u00e1 compartilhado.
switchTo=Mudar para...
reset=Reiniciar...
fetch=Obter do Upstream
pushToUpstream=Enviar para o Upstream
commit=Confirmar...
rebase=Rebase...
merge=Mesclar...
gitInit=Inicializar o reposit\u00f3rio git
createGitIgnore=Criar um arquivo `.gitignore` apropriado
firstCommit=Valide o conte\u00fado do projeto Bonita
firstPush=For\u00e7ar o primeiro commit
firstCommitMessage=Primeira mensagem de commit
commitAndPush=Enviar e for\u00e7ar
repositoryStatus=Estado
legacyFormsRemoved=Os formul\u00e1rios 6.x baseados na tecnologia Google Web Toolkit (GWT) n\u00e3o s\u00e3o mais suportados. Esses formul\u00e1rios e seu conte\u00fado relacionado foram removidos da ramifica\u00e7\u00e3o migrada.
clonedBranchContentIsNotCompatible=Branch clonado '%s' n\u00e3o \u00e9 compat\u00edvel com esta vers\u00e3o do Bonita Studio. Use uma vers\u00e3o mais recente do Bonita Studio ou finalize o check-out.
confirmMigratonTitle=Migra\u00e7\u00e3o necess\u00e1ria
confirmMigraton=O reposit\u00f3rio clonado precisa ser migrado.\nContinuar a opera\u00e7\u00e3o de clone e executar a migra\u00e7\u00e3o?
cloneOperationCancelled=Opera\u00e7\u00e3o de clone foi abortada.