shareRepositoryProgressTitle=Partager - \u00e9tat d\u2019avancement
shareRepositoryProgress=Un d\u00e9p\u00f4t Git local a \u00e9t\u00e9 cr\u00e9\u00e9. Vous devez maintenant faire un Commit et un Push des fichiers locaux.
warningRepoNotPushedMsg=Le d\u00e9p\u00f4t Git a \u00e9t\u00e9 initialis\u00e9. Toutefois, vous n\u2019avez pas configur\u00e9 d'emplacement distant (remote) pour ce d\u00e9p\u00f4t. Vous ne pouvez pas partager le contenu de votre projet sans remote.\nTrouvez plus d'informations sur le remote dans la <a>documentation</a>.
showGitStaging=Afficher Git Staging
openGitPreferences=Pr\u00e9f\u00e9rences
shareWithGit=Partager sur Git
clone=Cloner
cloneRepoDialogTitle=Nouveau projet
cloneRepoDialogMsg=Cloner dans un nouveau projet nomm\u00e9 \:
repositoryClonedTitle=D\u00e9p\u00f4t clon\u00e9
repositoryClonedMsg=Le d\u00e9p\u00f4t %s a \u00e9t\u00e9 clon\u00e9 avec succ\u00e8s dans Bonita.
repositoryClonedWithMigration=Le d\u00e9p\u00f4t %s a \u00e9t\u00e9 clon\u00e9 avec succ\u00e8s dans Bonita.\n\nLe contenu de la branche extraite a \u00e9galement \u00e9t\u00e9 migr\u00e9 de la version %s \u00e0 %s. Par cons\u00e9quent, tous les contributeurs \u00e0 cette branche du d\u00e9p\u00f4t devront \u00e9galement utiliser un Bonita Studio dans la version %s, sinon ils ne pourront plus travailler sur cette branche.\n\nAvant de pousser les changements de migration, assurez-vous que les autres utilisateurs ne travaillent pas actuellement sur cette branche du d\u00e9p\u00f4t.
targetRepoPageTitle=Destination du clone
targetRepoPageMsg=Saisissez le nom du projet cible dans l'espace de travail
workspaceLocation=Nom du projet
workspaceLocationHint=Nom du projet dans l'espace de travail
noBonitaProjectDescriptorFound=Il n'y a pas de descripteur de projet Bonita dans le d\u00e9p\u00f4t clon\u00e9 '%s'.\nV\u00e9rifiez que vous \u00eates bien en train de cloner un projet Bonita.
noVersionFoundInBonitaProjectDescriptor=Il n'y a pas de version dans le descripteur de projet Bonita situ\u00e9 ici\: '%s'.\nV\u00e9rifiez que vous \u00eates bien en train de cloner un projet Bonita.
noNatureFoundInBonitaProjectDescriptor=Le d\u00e9p\u00f4t clon\u00e9 sur '%s' n'est pas un projet Bonita.\nV\u00e9rifiez que vous \u00eates bien en train de cloner un projet Bonita.
cannotMigrateRepository=Impossible de migrer le projet clon\u00e9 de la version %s vers la version %s.\nIl n'est pas possible de cloner un projet dans une version sup\u00e9rieure \u00e0 %s.
pull=Pull
push=Faire le push de la branche '%s'...
showHistory=Afficher l'historique
share=Partager
shareRepositoryTitle=Partager le projet courant
shareRepositoryDesc=Partager le projet courant sur Git, pour collaborer avec d'autres utilisateurs.
repository=Projet
repoAlreadyShared=Ce projet est d\u00e9j\u00e0 partag\u00e9.
switchTo=Basculer vers ...
reset=R\u00e9initialiser...
fetch=Fetch \u00e0 partir de l'Upstream
pushToUpstream=Push vers l'Upstream
commit=Commit ...
rebase=Rebase ...
merge=Fusionner ...
gitInit=Initialiser le d\u00e9p\u00f4t Git
createGitIgnore=Cr\u00e9er un fichier`.gitignore` sp\u00e9cifique
firstCommit=Valider (commit) le contenu du projet Bonita
firstPush=Push du premier commit
firstCommitMessage=Message du premier commit
commitAndPush=Commit et push
repositoryStatus=Statut
legacyFormsRemoved=Les formulaires datant de Bonita 6.x, bas\u00e9s sur la technologie Google Web Toolkit (GWT) ne sont plus support\u00e9s. Ces formulaires et leur contenu ont \u00e9t\u00e9 supprim\u00e9s de la branche migr\u00e9e.
clonedBranchContentIsNotCompatible=Cloned branch '%s' is not compatible
confirmMigratonTitle=Migration requise
confirmMigraton=Le d\u00e9p\u00f4t clon\u00e9 doit \u00eatre migr\u00e9.\nContinuer l'op\u00e9ration de clonage et effectuer la migration ?
cloneOperationCancelled=L'op\u00e9ration de clonage a \u00e9t\u00e9 abandonn\u00e9e.