shareRepositoryProgressTitle=\u5171\u6709 - \u9032\u6357\u72b6\u6cc1
shareRepositoryProgress=\u30ed\u30fc\u30ab\u30eb git \u30ea\u30dd\u30b8\u30c8\u30ea\u304c\u4f5c\u6210\u3055\u308c\u307e\u3057\u305f\u3002\u30ed\u30fc\u30ab\u30eb \u30d5\u30a1\u30a4\u30eb\u3092\u30b3\u30df\u30c3\u30c8\u3057\u3066\u30d7\u30c3\u30b7\u30e5\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
warningRepoNotPushedMsg=Git \u30ea\u30dd\u30b8\u30c8\u30ea\u304c\u521d\u671f\u5316\u3055\u308c\u307e\u3057\u305f\u3002\u305f\u3060\u3057\u3001\u3053\u306e\u30ea\u30dd\u30b8\u30c8\u30ea\u306e\u30ea\u30e2\u30fc\u30c8\u304c\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002 \u30ea\u30e2\u30fc\u30c8\u306a\u3057\u3067\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306e\u5185\u5bb9\u3092\u5171\u6709\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002\n\n\u30ea\u30e2\u30b3\u30f3\u304c\u4f55\u304b\u5206\u304b\u3089\u306a\u3044\u5834\u5408\u306f\u3001 <a>\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8</a> \u3092\u8aad\u3080\u3053\u3068\u3092\u304a\u52e7\u3081\u3057\u307e\u3059\u3002
showGitStaging=Git \u30b9\u30c6\u30fc\u30b8\u30f3\u30b0\u3092\u8868\u793a
openGitPreferences=\u74b0\u5883\u8a2d\u5b9a
shareWithGit=Git \u3067\u5171\u6709
clone=\u30af\u30ed\u30fc\u30f3\uff08\u8907\u88fd\uff09
cloneRepoDialogTitle=\u65b0\u898f\u30d7\u30ed\u30b8\u30a7\u30af\u30c8
cloneRepoDialogMsg=\u540d\u524d\u3092\u6301\u3064\u65b0\u3057\u3044\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306b\u30af\u30ed\u30fc\u30f3\u3092\u4f5c\u6210\u3057\u307e\u3059\:
repositoryClonedTitle=\u30af\u30ed\u30fc\u30f3\u3055\u308c\u305f\u30ea\u30dd\u30b8\u30c8\u30ea
repositoryClonedMsg=\u30ea\u30dd\u30b8\u30c8\u30ea %s \u306fBonita \u3067\u6b63\u5e38\u306b\u30af\u30ed\u30fc\u30f3\u3055\u308c\u3066\u3044\u307e\u3059\u3002
repositoryClonedWithMigration=\u30ea\u30dd\u30b8\u30c8\u30ea %s \u306f Bonita \u3067\u6b63\u5e38\u306b\u8907\u88fd\u3055\u308c\u307e\u3057\u305f\u3002\n\n\u30c1\u30a7\u30c3\u30af\u30a2\u30a6\u30c8\u3055\u308c\u305f\u30d6\u30e9\u30f3\u30c1\u306e\u30b3\u30f3\u30c6\u30f3\u30c4\u3082\u30d0\u30fc\u30b8\u30e7\u30f3 %s \u304b\u3089 %s \u306b\u79fb\u884c\u3055\u308c\u3001\u30b3\u30df\u30c3\u30c8\u3055\u308c\u307e\u3057\u305f\u3002 \u5f93\u3063\u3066\u3001\u3053\u306e\u30ea\u30dd\u30b8\u30c8\u30ea \u30d6\u30e9\u30f3\u30c1\u3078\u306e\u3059\u3079\u3066\u306e\u8ca2\u732e\u8005\u306f\u3001\u30d0\u30fc\u30b8\u30e7\u30f3 %s \u306e Bonita Studio \u3082\u4f7f\u7528\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002\u305d\u3046\u3057\u306a\u3044\u3068\u3001\u3053\u306e\u30d6\u30e9\u30f3\u30c1\u3067\u4f5c\u696d\u3067\u304d\u306a\u304f\u306a\u308a\u307e\u3059\u3002\n\n\u79fb\u884c\u306e\u5909\u66f4\u3092\u30d7\u30c3\u30b7\u30e5\u3059\u308b\u524d\u306b\u3001\u4ed6\u306e\u30e6\u30fc\u30b6\u30fc\u304c\u73fe\u5728\u3053\u306e\u30ea\u30dd\u30b8\u30c8\u30ea \u30d6\u30e9\u30f3\u30c1\u3067\u4f5c\u696d\u3057\u3066\u3044\u306a\u3044\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
targetRepoPageTitle=\u30b3\u30d4\u30fc\u5148
targetRepoPageMsg=\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u306b\u30bf\u30fc\u30b2\u30c3\u30c8 \u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u540d\u306e\u540d\u524d\u3092\u5165\u529b\u3057\u307e\u3059
workspaceLocation=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u540d
workspaceLocationHint=\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u5185\u306e\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306e\u540d\u524d
noBonitaProjectDescriptorFound=Bonita\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u8a18\u8ff0\u5b50\u304c\u30af\u30ed\u30fc\u30f3\u30ea\u30dd\u30b8\u30c8\u30ea '%s'\u306b\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002\nBonita\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306e\u30af\u30ed\u30fc\u30f3\u3092\u4f5c\u6210\u3057\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
noVersionFoundInBonitaProjectDescriptor=Bonita \u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u8a18\u8ff0\u5b50\u306e '%s' \u306b\u3042\u308b\u30d0\u30fc\u30b8\u30e7\u30f3\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002\nBonita \u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u30af\u30ed\u30fc\u30f3\u3057\u3066\u3044\u308b\u304b\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
noNatureFoundInBonitaProjectDescriptor='%s' \u306e\u30af\u30ed\u30fc\u30f3\u30ea\u30dd\u30b8\u30c8\u30ea\u306fBonita\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002\nBonita\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306e\u30af\u30ed\u30fc\u30f3\u3092\u4f5c\u6210\u3057\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
cannotMigrateRepository=\u8907\u88fd\u3055\u308c\u305f\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u30d0\u30fc\u30b8\u30e7\u30f3%s\u304b\u3089\u30d0\u30fc\u30b8\u30e7\u30f3%s\u306b\u79fb\u884c\u3067\u304d\u307e\u305b\u3093\u3002\n%s\u3088\u308a\u5927\u304d\u3044\u30d0\u30fc\u30b8\u30e7\u30f3\u3067\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306e\u30af\u30ed\u30fc\u30f3\u3092\u4f5c\u6210\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
pull=\u30d7\u30eb
push=\u30d7\u30c3\u30b7\u30e5\u30d6\u30e9\u30f3\u30c1 '%s'...
showHistory=\u5c65\u6b74\u3092\u8868\u793a
share=\u5171\u6709
shareRepositoryTitle=\u73fe\u5728\u306e\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u5171\u6709
shareRepositoryDesc=\u73fe\u5728\u306e\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092Git\u3067\u5171\u6709\u3057\u3066\u3001\u4ed6\u306e\u4eba\u3068\u5171\u540c\u4f5c\u696d\u3092\u884c\u3044\u307e\u3059\u3002
repository=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8
repoAlreadyShared=\u3053\u306e\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306f\u65e2\u306b\u5171\u6709\u3055\u308c\u3066\u3044\u307e\u3059\u3002
switchTo=\u30b9\u30a4\u30c3\u30c1... 
reset=\u30ea\u30bb\u30c3\u30c8... 
fetch=\u4e0a\u6d41\u304b\u3089\u53d6\u5f97
pushToUpstream=\u4e0a\u6d41\u306b\u30d7\u30c3\u30b7\u30e5\u3059\u308b
commit=\u30b3\u30df\u30c3\u30c8... 
rebase=\u30ea\u30d9\u30fc\u30b9... 
merge=\u30de\u30fc\u30b8... 
gitInit=git \u30ea\u30dd\u30b8\u30c8\u30ea\u3092\u521d\u671f\u5316
createGitIgnore=\u9069\u5207\u306a `.gitignore` \u30d5\u30a1\u30a4\u30eb\u3092\u4f5c\u6210\u3057\u307e\u3059
firstCommit=Bonita \u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306e\u5185\u5bb9\u3092\u30b3\u30df\u30c3\u30c8
firstPush=\u6700\u521d\u306e\u30b3\u30df\u30c3\u30c8\u3092\u62bc\u3057\u3066\u304f\u3060\u3055\u3044
firstCommitMessage=\u6700\u521d\u306e\u30b3\u30df\u30c3\u30c8\u30e1\u30c3\u30bb\u30fc\u30b8
commitAndPush=\u30b3\u30df\u30c3\u30c8\u3057\u3066\u30d7\u30c3\u30b7\u30e5\u3059\u308b
repositoryStatus=\u30b9\u30c6\u30fc\u30bf\u30b9
legacyFormsRemoved=Google Web Toolkit (GWT) \u30c6\u30af\u30ce\u30ed\u30b8\u30fc\u306b\u57fa\u3065\u3044\u305f 6.x \u30d5\u30a9\u30fc\u30e0\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u306a\u304f\u306a\u308a\u307e\u3057\u305f\u3002 \u3053\u306e\u3088\u3046\u306a\u30d5\u30a9\u30fc\u30e0\u3068\u305d\u306e\u95a2\u9023\u30b3\u30f3\u30c6\u30f3\u30c4\u306f\u3001\u30de\u30a4\u30b0\u30ec\u30fc\u30c8\u3055\u308c\u305f\u30d6\u30e9\u30f3\u30c1\u304b\u3089\u524a\u9664\u3055\u308c\u307e\u3057\u305f\u3002
clonedBranchContentIsNotCompatible=\u8907\u88fd\u3055\u308c\u305f\u30d6\u30e9\u30f3\u30c1 '%s' \u306f\u3001Bonita Studio \u306e\u3053\u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u3068\u4e92\u63db\u6027\u304c\u3042\u308a\u307e\u305b\u3093\u3002 Bonita Studio \u306e\u6700\u65b0\u30d0\u30fc\u30b8\u30e7\u30f3\u3092\u4f7f\u7528\u3059\u308b\u304b\u3001\u4e92\u63db\u6027\u306e\u3042\u308b\u30d6\u30e9\u30f3\u30c1\u3092\u30c1\u30a7\u30c3\u30af\u30a2\u30a6\u30c8\u3057\u3066\u304f\u3060\u3055\u3044\u3002
confirmMigratonTitle=\u30de\u30a4\u30b0\u30ec\u30fc\u30c8\u304c\u5fc5\u8981\u3067\u3059
confirmMigraton=\u30af\u30ed\u30fc\u30f3\u3055\u308c\u305f\u30ea\u30dd\u30b8\u30c8\u30ea\u3092\u79fb\u884c\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002\n\u30af\u30ed\u30fc\u30f3\u64cd\u4f5c\u3092\u7d9a\u884c\u3057\u3001\u30de\u30a4\u30b0\u30ec\u30fc\u30c8\u3092\u5b9f\u884c\u3057\u307e\u3059\u304b\uff1f
cloneOperationCancelled=\u30af\u30ed\u30fc\u30f3\u64cd\u4f5c\u304c\u4e2d\u6b62\u3055\u308c\u307e\u3057\u305f\u3002
GITStatusDialog=Git \u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306e\u72b6\u614b
sharedWithGit=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8 '%s' \u306f GIT \u3068\u5171\u6709\u3055\u308c\u3066\u3044\u307e\u3059
currentBranch=\u73fe\u5728\u306e\u30d6\u30e9\u30f3\u30c1
remoteURL=\u30ea\u30e2\u30fc\u30c8 URL
gitUser=\u30e6\u30fc\u30b6\u30fc
commitAhead=\u3053\u306e\u30d6\u30e9\u30f3\u30c1\u306f\u4e0a\u6d41\u306e\u30d6\u30e9\u30f3\u30c1\u306e\u524d\u306e\u30b3\u30df\u30c3\u30c8 %s \u3067\u3059\u3002\u30ed\u30fc\u30ab\u30eb\u306e\u5909\u66f4\u3092\u30d7\u30c3\u30b7\u30e5\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059
commitBehind=\u3053\u306e\u30d6\u30e9\u30f3\u30c1\u306f\u3001\u4e0a\u6d41\u306e\u30d6\u30e9\u30f3\u30c1\u306e\u80cc\u5f8c\u306b\u3042\u308b %s \u30b3\u30df\u30c3\u30c8\u3067\u3059\u3002\u30ea\u30e2\u30fc\u30c8\u3067\u5909\u66f4\u3092\u53d6\u5f97\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059 (\u30de\u30fc\u30b8\u307e\u305f\u306f\u30ea\u30d9\u30fc\u30b9)
repoAlreadyExist=\u3053\u306e\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306f\u65e2\u306b\u5b58\u5728\u3057\u307e\u3059
gitButtonTooltip=Git \u30a2\u30af\u30b7\u30e7\u30f3
gitValidationDirectoryNotIgnored=\u30c7\u30a3\u30ec\u30af\u30c8\u30ea {0} \u306f\u30ea\u30dd\u30b8\u30c8\u30ea\u5185\u3067\u7121\u8996\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002.gitignore\u30d5\u30a1\u30a4\u30eb\u3092\u4fee\u6b63\u3057\u3066\u307f\u3066\u304f\u3060\u3055\u3044\u3002
gitValidationFileNotIgnored=\u30d5\u30a1\u30a4\u30eb {0} \u306f\u30ea\u30dd\u30b8\u30c8\u30ea\u3067\u7121\u8996\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002.gitignore\u30d5\u30a1\u30a4\u30eb\u3092\u4fee\u6b63\u3057\u3066\u307f\u3066\u304f\u3060\u3055\u3044\u3002
gitValidationCommitedIgnoredFile=\u30d5\u30a1\u30a4\u30eb {0} \u306f\u7121\u8996\u3055\u308c\u307e\u3059\u304c\u30b3\u30df\u30c3\u30c8\u3055\u308c\u3066\u3044\u307e\u3059\u3002\u524a\u9664\u3057\u3066\u30b3\u30df\u30c3\u30c8\u3057\u3066\u304f\u3060\u3055\u3044\u3002
gitValidation=Git \u30ea\u30dd\u30b8\u30c8\u30ea\u306b\u30a8\u30e9\u30fc\u304c\u898b\u3064\u304b\u308a\u307e\u3057\u305f\u3002
committedIgnoredResolutionDescription=\u30d5\u30a1\u30a4\u30eb\u306f\u81ea\u52d5\u7684\u306b\u524a\u9664\u3055\u308c\u307e\u3059\u3002 \u72b6\u6cc1\u3092\u5b8c\u5168\u306b\u4fee\u6b63\u3059\u308b\u305f\u3081\u306b\u3001\u305d\u306e\u524a\u9664\u3092 Git \u30ea\u30dd\u30b8\u30c8\u30ea\u306b\u30b3\u30df\u30c3\u30c8\u3059\u308b\u306e\u306f\u3042\u306a\u305f\u6b21\u7b2c\u3067\u3059\u3002
committedIgnoredResolutionLabel=\u30d5\u30a1\u30a4\u30eb\u306e\u524a\u9664 (\u5f8c\u3067\u624b\u52d5\u3067\u30b3\u30df\u30c3\u30c8\u3059\u308b)
ignoredNotAlignedResolutionDescription=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306e .gitignore \u30d5\u30a1\u30a4\u30eb\u3092\u516c\u5f0f\u306e\u30c6\u30f3\u30d7\u30ec\u30fc\u30c8\u306b\u7f6e\u304d\u63db\u3048\u307e\u3059\u3002 \u72ec\u81ea\u306e\u30ab\u30b9\u30bf\u30de\u30a4\u30ba\u304c\u5931\u308f\u308c\u305f\u308a\u3001\u30d5\u30a9\u30eb\u30c0\u30fc\u306b\u4ed6\u306e .gitignore \u30d5\u30a1\u30a4\u30eb\u304c\u3042\u308b\u5834\u5408\u3001\u3053\u308c\u3067\u306f\u4e0d\u5341\u5206\u306a\u5834\u5408\u304c\u3042\u308a\u307e\u3059\u3002
ignoredNotAlignedResolutionLabel=\u30c6\u30f3\u30d7\u30ec\u30fc\u30c8.gitignore\u3092\u5fa9\u5143\u3059\u308b
importingProject=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306e\u30a4\u30f3\u30dd\u30fc\u30c8
