#X-Generator: crowdin.com
generatedJavaRepository=Meus Tipos Java Gerados
name=Nome
packageName=Pacote (package)
error=Erro
error_emptyName=Deve ter um nome
type=Tipo
Remove=Remover
selectBusinessObjectWizardTitle=Selecione um objeto de neg\u00f3cio
selectBusinessObjectWizardMessage=Selecione um objeto de neg\u00f3cio existente para editar.
businessObjectRepositoryStoreName=Objeto de neg\u00f3cio
errorMessageSameDataTypeNames=Um outro tipo de dados com o mesmo nome j\u00e1 existe.
errorMessageNoWhitespaceInDataTypeNames=Espa\u00e7os n\u00e3o s\u00e3o permitidos em um nome de objeto de neg\u00f3cio.
noBusinessObjectSelected=Selecione um objeto de neg\u00f3cio.
addBusinessObjectDataTitle=Adicionar uma nova vari\u00e1vel de neg\u00f3cio para {0}
addBusinessObjectDataDescription=Cria uma nova refer\u00eancia para um objeto de neg\u00f3cio definido no menu Desenvolvimento > Modelo de Dados de Neg\u00f3cio
description=Descri\u00e7\u00e3o
businessObject=Objeto de neg\u00f3cio
dataWithSameNameAlreadyExists=Um dado com o mesmo nome j\u00e1 existe
editBusinessObjectDataWindowTitle=Editar vari\u00e1vel de neg\u00f3cio
editBusinessObjectDataTitle=Editar vari\u00e1vel de neg\u00f3cio
editBusinessObjectDataDescription=Editar uma vari\u00e1vel de neg\u00f3cio existente
createNewBusinessObject=<A>Criar um novo objeto de neg\u00f3cio...</A>
businessObjectNotFound=O objeto de neg\u00f3cio {0} n\u00e3o foi encontrado
errorWhileDeployingBDR=Ocorreu um erro ao publicar o Modelo de Dados de Neg\u00f3cio
publish=Publicar
publishBusinessObjectTitle=Publicar Objeto de Neg\u00f3cio
publishBusinessObjectDescription=Publica o objeto de neg\u00f3cio selecionado no motor
businessObjectPublishedMessage=Objeto de neg\u00f3cio publicado com sucesso.
businessObjectPublishedTitle=Objeto de neg\u00f3cio publicado
export=Exportar
exportBusinessDataModelTitle=Exportar Modelo de Dado de Neg\u00f3cio
exportBusinessDataModelDescription=Exporta um modelo de dados de neg\u00f3cio a ser implantado em {0}. O nome do arquivo gerado ser\u00e1 "bdm.zip"
exportBusinessDataModelSuccessFull=O Modelo de Dados de Neg\u00f3cio foi exportado com sucesso para {0}
exportingBusinessDataModel=Exportando o Modelo de Dados de Neg\u00f3cio...
destinationPath=Caminho de destino
invalidDestinationPath=O caminho destino n\u00e3o \u00e9 uma pasta v\u00e1lida
browse=Procurar...
deployingBusinessObjects=Implantando o Modelo de Dados de neg\u00f3cio...
add=Adicionar
delete=Excluir
listOfBusinessObjects=Lista de objetos de neg\u00f3cio
selectABusinessObjectToEdit=Selecione um objeto de neg\u00f3cio para editar
up=Acima
down=\ Abaixo
length=Tamanho
mandatory=Obrigat\u00f3rio
fieldNameAlreadyExists=O nome do atributo j\u00e1 existe
constraintNameAlreadyExists=O nome da restri\u00e7\u00e3o j\u00e1 existe
deleteBOConfirmTitle=Excluir o objeto de neg\u00f3cio?
deleteBOConfirmMessage=Tem certeza que deseja excluir o Objeto de Neg\u00f3cio "{0}" ?
attribute=atributo
error_emptyPackageName=O nome do pacote esta vazio
modelValidationFailedTitle=Valida\u00e7\u00e3o falhou
validatingBDM=Validando...
atLeastOneAttributeShouldExists={0} deve ter pelo menos um atributo.
manageBusinessDataModelTitle=Gerenciar o Modelo de Dados de Neg\u00f3cio
manageBusinessDataModelDesc=Adicione objetos de neg\u00f3cio \u00e0 lista e edite seus detalhes nas guias do lado direito.
reservedKeyWord={0} \u00e9 uma palavra-chave reservada
saving=Salvando...
constraints=Restri\u00e7\u00f5es
businessDataModel=Modelo de dados de neg\u00f3cio
selectUniqueConstraintFieldsMessage=Selecione a combina\u00e7\u00e3o de atributos para os quais se aplicar\u00e1 a restri\u00e7\u00e3o de unicidade.
selectUniqueConstraintFieldsTitle=Selecione os atributos
attributes=Atributos
atLeastOneAttributeShouldBelongToConstraint=Pelo menos um atributo deve ser definido para restri\u00e7\u00e3o de unicidade {0}
attributeInConstraintNotExists=O atributo {0} na restri\u00e7\u00e3o de unicidade {1} n\u00e3o existe
atLeastOneAttributeShouldBelongToIndex=Pelo menos um atributo deve ser definido para o \u00edndice {0}
attributeInIndexNotExists=O atributo {0} no \u00edndice {1} n\u00e3o existe
atLeastOneBusinessObjectShouldExists=Pelo menos um Objeto de Neg\u00f3cio deve ser definido
invalidSQLIdentifier={0} n\u00e3o \u00e9 um identificador SQL v\u00e1lido
queries=Consultas
queryNameAlreadyExists=O nome da consulta j\u00e1 existe
query=Consulta
parameters=Par\u00e2metros
parameter=par\u00e2metro
queryParameterNameAlreadyExists=O par\u00e2metro {0} j\u00e1 existe
newQuery=Criar consulta em {0}
newQueryDescription=Digite a consulta utilizando JPQL. Voc\u00ea pode usar ou descartar o exemplo fornecido. Inicialmente todos as atributos do objeto s\u00e3o fornecidos como par\u00e2metro. Modifique estes par\u00e2metros e o tipo de retorno caso seja necess\u00e1rio.
editQuery=Editar consulta
editQueryDescription=Voc\u00ea precisa usar o JPQL escrever esta consulta.
parameterNotUsedInQueryWarning={0} \u00e9 definido na lista do par\u00e2metro mas nunca \u00e9 usado na consulta
undefinedParameter={0} n\u00e3o \u00e9 definido na lista de par\u00e2metros
exportCompleted=Exporta\u00e7\u00e3o conclu\u00edda
queryResultType=Tipo de resultado
multipleReturnType=M\u00faltiplo (java.util.List)
multiple=M\u00faltiplo
single=\u00danico ({0})
numeric=Num\u00e9rico (java.util.Long)
queryLink=Consulta JPQL * <a>?</a>
jpqlParametersHint=Defina os par\u00e2metros usados na consulta acima
emptyQueryError=A consulta JPQL n\u00e3o pode ser vazia
queryNameReserved={0} \u00e9 um nome de consulta reservado (consulta gerada a partir de restri\u00e7\u00e3o de unicidade)
queryExpressionLabel=Consulta
queryContent=Conte\u00fado da consulta
value=Valor
returnType=Tipo de retorno
dropBusinessDataDBOnExit=Limpar banco de dados de neg\u00f3cios na sa\u00edda
dropBusinessDataDBOnBDMChanges=Limpar banco de dados de neg\u00f3cios quando o Modelo de Neg\u00f3cios for alterado
queryExpressionGuidance=Selecione o Objeto de neg\u00f3cio e a consulta a ser executada. Defina o valor para cada par\u00e2metro exigido pela consulta.
bdmCompatibilityTitle=Altera\u00e7\u00f5es compat\u00edveis
bdmCompatibilityMsg=This BDM is available to all processes in your Studio, and to pages using REST API calls. Changing the BDM might cause inconsistencies.\nAfter the BDM update, validate each diagram and check your pages.\nIf you have changed the Mandatory or Multiple setting for an attribute, a unique constraint, or if you have changed a Business Object attribute Type you must clear the values of the business data in the database.
clearExistingBusinessData=Limpar dados
businessObjectNameAlreadyExists=J\u00e1 existe um objeto de neg\u00f3cios com o mesmo nome
installFailedTitle=A implanta\u00e7\u00e3o falhou
installFailedMessage=Ocorreu um erro ao implantar o Modelo de Dados de Neg\u00f3cio no motor
defaultQueriesOption=Padr\u00e3o
customQueriesOption=Personalizado
defaultQueriesHint=Existem 3 tipos padr\u00e3o de consulta para selecionar Objetos de Neg\u00f3cio\: consulta baseada em restri\u00e7\u00f5es de unicidade (retorna um \u00fanico resultado), \nconsulta baseada em atributos simples (com crit\u00e9rio "igual") (retorna v\u00e1rios resultados) \ne consulta do tipo "Selecionar todos" (retorna todos os Dados de Neg\u00f3cio do objeto).
providedQuery=Consultas padr\u00e3o
providedQueryDescription=Exibe o conte\u00fado dessa consulta padr\u00e3o
queryParameterNameReservedForPagination={0} \u00e9 uma palavra reservada para pagina\u00e7\u00e3o
orderByMissingWarning=Voc\u00ea definiu uma consulta que retorna uma lista de objetos de neg\u00f3cio. \u00c9 altamente recomendado usar uma cl\u00e1usula ORDER BY ao retornar uma lista.
paginationParameterHint=Dois par\u00e2metros de pagina\u00e7\u00e3o s\u00e3o oferecidos, para ser usado atrav\u00e9s das APIs. startIndex aponta para o primeiro elemento que deve ser retornado no resultado,  enquanto maxResults determina a quantidade m\u00e1xima de itens a ser retornada. Nota\: Nos formul\u00e1rios apenas uma p\u00e1gina de elementos ser\u00e1 exibida.
newQueryTitle=Criar consulta
editQueryTitle=Editar consulta
howToUseBusinessObjects=Como usar Objetos de Neg\u00f3cio
howToUseBusinessObjectsContent=Para usar dados de neg\u00f3cios em um processo, \u00e9 necess\u00e1rio definir uma vari\u00e1vel de neg\u00f3cio no n\u00edvel do pool. \nPara ler os dados de neg\u00f3cios em um processo, tamb\u00e9m \u00e9 poss\u00edvel utilizar a DAO do objeto de neg\u00f3cio em um script Groovy ou utilizar uma express\u00e3o de consulta. \n\nPara usar dados de neg\u00f3cios em um formul\u00e1rio ou p\u00e1gina de aplica\u00e7\u00e3o, use a API REST na propriedade de valor da widget.
multipleBusinessData=\u00c9 m\u00faltiplo
composition=Composi\u00e7\u00e3o
aggregation=Agrega\u00e7\u00e3o
relation=Relacionamento
indexes=\u00cdndices
indexNameAlreadyExists=Um \u00edndice com o mesmo nome j\u00e1 existe
indexedAttributes=Atributos indexados
availableAttributes=Atributos dispon\u00edveis
selectIndexFieldsTitle=Selecionar atributos para {0}
selectIndexFieldsMessages=Selecione os atributos para este \u00edndice. O desempenho desse filtro de consulta \u00e9 melhorado significativamente, dependendo dos atributos e da ordem escolhida.
businessObjectDAO=DAO de Objeto de Neg\u00f3cio
mandatoryColumnTooltip=Se m\u00faltiplo e obrigat\u00f3rio forem escolhidos, pelo menos um valor dever\u00e1 ser fornecido.
stringLengthTooltip=Tamanho m\u00e1ximo permitido para um valor de tipo String.
lengthCannotBeEmpty=O tamanho deve ser um inteiro positivo v\u00e1lido
noDetailsAvailable=N\u00e3o h\u00e1 detalhes dispon\u00edveis
details=Detalhes
detailsFor=Detalhes para {0}
realtionTooltip=- Agrega\u00e7\u00e3o significa "referenciado por"\: o objeto relacionado tem seu pr\u00f3prio ciclo de vida; Ele n\u00e3o pode ser modificado quando o objeto pai \u00e9 salvo no banco de dados. \n-Composi\u00e7\u00e3o significa "\u00e9 parte de"\: o objeto relacionado pode ser modificado quando o objeto pai \u00e9 salvo no banco de dados.
errorMessageNoUnderscoreInBoNames='_' n\u00e3o \u00e9 permitido no nome de um Objeto de Neg\u00f3cio.
loadOnDemand=Apenas carregar objetos relacionados quando necess\u00e1rio
loadOnDemandHint=Esta op\u00e7\u00e3o \u00e9 recomendada para objetos que s\u00e3o raramente exibidos ou modificados com o Objeto de Neg\u00f3cio pai
alwaysLoad=Sempre carregar objetos relacionados
alwaysLoadHint=Esta op\u00e7\u00e3o \u00e9 recomendada para objetos que s\u00e3o frequentemente exibidos ou modificados com o Objeto de Neg\u00f3cio pai
createBusinessDataVariable=Criar um Dado de neg\u00f3cio...
error_reservedPackagePrefix={0} \u00e9 um prefixo de pacote reservado.
warning_reservedPackagePrefix={0} \u00e9 um prefixo de pacote desaconselhado.
disabledMandatoryTooltip=Um atributo m\u00faltiplo n\u00e3o pode ser obrigat\u00f3rio.
defaultValue=Valor padr\u00e3o
defaultValueReturnTypeValidationMessage=A express\u00e3o de valor padr\u00e3o retorna {0}, mas {1} \u00e9 esperado
addBusinessObjectDataWindowTitle=Nova vari\u00e1vel de neg\u00f3cio
defaultValueBusinessDataTooltip=Vari\u00e1veis de neg\u00f3cios podem ser inicializadas com Objetos de Neg\u00f3cios existentes usando uma consulta ou com novos Objetos de Neg\u00f3cios criados usando um Script Groovy e a vari\u00e1vel DAO fornecida (XXXDAO.newInstance()).
cleaningBusinessObjects=Limpando Modelo de dados de neg\u00f3cio...
countQueryInfo=To get paged results from a REST API query on this business object you must create a related count query. For a query named "queryName", create a query named "countForQueryName" that counts the total number of results.
missingCountQuery=You can define a count query {0} to enable paged results from this REST API query.

