datatypeLabel=Tipo de Dato
Add=A\u00f1adir
classLabel=Clase
browseClasses=Buscar...
selectXSDToImport=Seleccione un archivo XSD para importar
up=Arriba
down=Abajo
AddXSDSchema=Importar Esquema ...
selectXMLNamespace=Espacio de nombres XML
selectXMLElement=Elemento Namespace
transientLabel=Transitorio
transientHint=Datos transitorios no se almacenan en la base de datos. Esta opci\u00f3n es \u00fatil cuando se necesita una variable temporal.
importXsd_title=No es posible importar el archivo XSD
importXsd_msg=No puede importar el archivo XSD porque se ha producido un error. Consulte el archivo
dataTechnicalTypeLabel=Esperando\:
variableType=Variable
browseJava=Busque el objeto Java
name=Nombre
returnType=tipo de retorno
javaType=Java
listOfOptions=Lista de opciones...
addData=Agregar...
removeData=Eliminar
updateData=Editar...
dataDescriptionLabel=Descripci\u00f3n
addDataWizardDescription=Agregar nueva variable
addDataWizardTitle=A\u00f1adir una nueva variable a {0}
addDataCommandLabel=A\u00f1adir datos
defaultValueLabel=Valor predeterminado
removeLiteralLabel=Eliminar
dateFormatLabel=por ejemplo\: 2013/06/01 18\:30, "Ahora" lleva a la fecha y hora en ejecuci\u00f3n
dataAlreadyExist=Datos con el mismo nombre ya existe
selectOnlyOneElementMessage=Uno y s\u00f3lo uno de los elementos debe ser seleccionado. Por favor seleccione s\u00f3lo el elemento que desea actualizar
selectOnlyOneElementTitle=Ning\u00fan elemento o demasiados elementos fueron seleccionados
moveDataWizardTitle=Mover datos
moveDataWizardMessage=Mover los datos a una actividad o al proceso
deleteDialogConfirmMessage=\u00bfRealmente desea borrar los siguientes datos \:
moveData=Mover...
moveData_tooltip=Mover los datos a un otro elemento
dataNameIsEmpty=El nombre est\u00e1 vac\u00edo
emptyClassName=el nombre de la clase est\u00e1 vac\u00eda
classNotFound={0} no se encuentra en classpath
additionalInformation=informaci\u00f3n adicional
emptyXMLElement=Namespace elemento est\u00e1 vac\u00edo
listOfOptionsTitle=Lista de opciones
options=Opciones
defaultTypeName=Lista de Opciones
defaultLiteral=Opci\u00f3n
isMultiple=Es m\u00faltiple
multiplicity_hint=Si esta variable es una colecci\u00f3n del tipo de datos definido
pickADate=Elija una fecha inicial
stringTypeHint=Enlazar a un java.lang.String
integerTypeHint=Enlazar a una java.lang.Integer
booleanTypeHint=Enlazar a un java.lang.Boolean
longTypeHint=Enlazar a un java.lang.Long
enumTypeHint=Todas las opciones son se unen a un java.lang.String
xmlTypeHint=Asociar a org.w3c.Document
javaTypeHint=Enlazar a un objeto java de su elecci\u00f3n
floatTypeHint=Enlazar a un java.lang.Float\n
doubleTypeHint=Enlazar a un java.lang.Double
dateTypeHint=Enlazar a un java.util.Date
dataWizardPageReturnTypeNotCorresponding=El tipo de valor devuelto del valor por defecto no es el mismo que el tipo de datos.
editVariable=Editar la variable
newVariable=Nueva variable
dataSectionDescription=Una variable es un contenedor de datos utilizados en un proceso. Agregar las variables de proceso en el contenedor.
dataDefaultValueNotCompatibleWithReturnType=El valor por defecto no es compatible con el tipo de datos actual.
listOfOptionsExplanation=Lista definida de opciones abajo
choicesExplanation=Las opciones disponibles para la lista seleccionada de opciones
chooseTargetStepOrProcess=Elegir una tarea o proceso destino
PromoteDataWarningTitle=Promover datos
PromoteDataWarningMessage=Datos con el nombre {0} ya existe en el elemento de destino
dataMoveErrorTargetSelected=Un objetivo debe ser seleccionado
datamoveErrorWrongTarget=El elemento seleccionado no puede aceptar ciertos datos
dataMoveErrorTargetCantBeSource=Imposible mover los datos en su envase original
xmlDefaultValueTooLongTitle = XML de entrada demasiado grande
xmlDefaultValueTooLongMessage = El archivo XML explorado es demasiado grande para ser utilizado como valor predeterminado
editVariableTitle=Edita la variable
editVariableDescription=Al hacer clic en Aceptar, si la variable se utilizara en un script de Groovy, se mostrar\u00e1 la ventana de refactorizaci\u00f3n y podr\u00e1 confirmar los cambios.
transientDataWarning=Nota\: Si el servidor de aplicaciones se reinicia, el valor de todas las variables transitorias se restablecer\u00e1 a su valor inicial. Para evitar esto, no use variables transitorias.
createVariable=Cree una variable...
dataSectionWithBusinessData=Una variable es un contenedor de datos utilizados en un proceso. Agregar las variables de proceso en el contenedor.
processData=Variables de proceso
businessData=Variables de negocio
businessDataHint=Crear Datos de Negocio para representar conceptos de negocio (definidos en el Modelo de Datos de Negocio) los cuales ser\u00e1n persistidos autom\u00e1ticamente. Este dato puede existir fuera de las instancias de proceso y ser accesible por m\u00faltiples procesos.
processDataHint=Crear Datos de Proceso que puedan ser usados globalmente o limitados a una tarea especifica. Este dato no existir\u00e1 una vez la instancia de proceso se complete.
localVariableDecsription=Crea variables limitadas en este \u00e1mbito de actividad espec\u00edfico.