#X-Generator: crowdin.com
datatypeLabel=\u30c7\u30fc\u30bf\u578b
Add=\u8ffd\u52a0
classLabel=\u30af\u30e9\u30b9
browseClasses=\u53c2\u7167...
selectXSDToImport=\u30a4\u30f3\u30dd\u30fc\u30c8\u3059\u308b XSD \u30d5\u30a1\u30a4\u30eb\u3092\u9078\u629e\u3057\u307e\u3059
up=\u4e0a\u3078
down=\u4e0b\u3078
AddXSDSchema=\u30b9\u30ad\u30fc\u30de\u306e\u30a4\u30f3\u30dd\u30fc\u30c8...
selectXMLNamespace=XML \u30cd\u30fc\u30e0\u30b9\u30da\u30fc\u30b9
selectXMLElement=\u30cd\u30fc\u30e0\u30b9\u30da\u30fc\u30b9 \u8981\u7d20
transientLabel=\u4e00\u6642\u7684
transientHint=\u4e00\u6642\u7684\u306a\u30c7\u30fc\u30bf\u306f\u3001\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306b\u306f\u683c\u7d0d\u3055\u308c\u307e\u305b\u3093\u3002\u4e00\u6642\u5909\u6570\u304c\u5fc5\u8981\u306a\u5834\u5408\u3001\u3053\u306e\u30aa\u30d7\u30b7\u30e7\u30f3\u306f\u4fbf\u5229\u3067\u3059\u3002
importXsd_title=XSD \u30d5\u30a1\u30a4\u30eb\u3092\u30a4\u30f3\u30dd\u30fc\u30c8\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3002
importXsd_msg=\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u305f\u305f\u3081 XSD \u30d5\u30a1\u30a4\u30eb\u3092\u30a4\u30f3\u30dd\u30fc\u30c8\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3002\u3042\u306a\u305f\u306e\u30d5\u30a1\u30a4\u30eb\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
dataTechnicalTypeLabel=\u4e88\u60f3\uff1a
variableType=\u5909\u6570
browseJava=Java \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3092\u53c2\u7167\u3057\u307e\u3059\u3002
name=\u540d\u524d
returnType=\u623b\u308a\u5024\u306e\u578b
javaType=Java
listOfOptions=\u30aa\u30d7\u30b7\u30e7\u30f3\u306e\u30ea\u30b9\u30c8...
addData=\u8ffd\u52a0...
removeData=\u524a\u9664
updateData=\u7de8\u96c6...
dataDescriptionLabel=\u8aac\u660e
addDataWizardDescription=\u65b0\u3057\u3044\u5909\u6570\u3092\u8ffd\u52a0\u3057\u307e\u3059\u3002
addDataWizardTitle={0} \u306b\u65b0\u3057\u3044\u5909\u6570\u3092\u8ffd\u52a0
addDataCommandLabel=\u30c7\u30fc\u30bf\u3092\u8ffd\u52a0
defaultValueLabel=\u30c7\u30d5\u30a9\u30eb\u30c8\u5024
removeLiteralLabel=\u524a\u9664
dateFormatLabel=\u305f\u3068\u3048\u3070\u3001 2013\u5e74/06/01 18\:30\u3001"Now"\u306f\u5b9f\u884c\u6642\u306e\u65e5\u4ed8\u3068\u6642\u523b
dataAlreadyExist=\u540c\u3058\u540d\u524d\u3092\u6301\u3064\u30c7\u30fc\u30bf\u304c\u65e2\u306b\u5b58\u5728\u3057\u307e\u3059\u3002
selectOnlyOneElementMessage=\u8981\u7d20\u3092 1 \u3064\u3060\u3051\u3092\u9078\u629e\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002\u66f4\u65b0\u3057\u305f\u3044\u8981\u7d20\u306e\u307f\u3092\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044
selectOnlyOneElementTitle=\u8981\u7d20\u304c\u9078\u629e\u3055\u308c\u3066\u3044\u306a\u3044\u304b\u3001\u307e\u305f\u306f\u9078\u629e\u3057\u305f\u8981\u7d20\u304c\u591a\u3059\u304e\u307e\u3059\u3002
moveDataWizardTitle=\u30c7\u30fc\u30bf\u3092\u79fb\u52d5
moveDataWizardMessage=\u30c7\u30fc\u30bf\u3092\u30a2\u30af\u30c6\u30a3\u30d3\u30c6\u30a3\u307e\u305f\u306f\u30d7\u30ed\u30bb\u30b9\u306b\u79fb\u52d5\u3057\u307e\u3059\u3002
deleteDialogConfirmMessage=\u6b21\u306e\u30c7\u30fc\u30bf\u3092\u524a\u9664\u3057\u3066\u3044\u3044\u3067\u3059\u304b\uff1a
moveData=\u79fb\u52d5...
moveData_tooltip=\u30c7\u30fc\u30bf\u3092\u4ed6\u306e\u8981\u7d20\u306b\u79fb\u52d5\u3057\u307e\u3059\u3002
dataNameIsEmpty=\u540d\u524d\u304c\u7a7a\u3067\u3059
emptyClassName=\u30af\u30e9\u30b9\u540d\u304c\u7a7a\u3067\u3059\u3002
classNotFound={0} \u304c\u30af\u30e9\u30b9\u30d1\u30b9\u306b\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002
additionalInformation=\u8a73\u7d30\u60c5\u5831\u306b\u3064\u3044\u3066
emptyXMLElement=\u30cd\u30fc\u30e0\u30b9\u30da\u30fc\u30b9 \u8981\u7d20\u304c\u7a7a\u3067\u3059\u3002
listOfOptionsTitle=\u9078\u629e\u30ea\u30b9\u30c8
options=\u30aa\u30d7\u30b7\u30e7\u30f3
defaultTypeName=\u30aa\u30d7\u30b7\u30e7\u30f3 \u30ea\u30b9\u30c8
defaultLiteral=\u9078\u629e
isMultiple=\u8907\u6570\uff08\u914d\u5217\uff09
multiplicity_hint=\u3053\u306e\u5909\u6570\u304c\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u308b\u30c7\u30fc\u30bf\u578b\u306e\u30b3\u30ec\u30af\u30b7\u30e7\u30f3\u3092\u304b\u3069\u3046\u304b
pickADate=\u521d\u671f\u5024\u306e\u65e5\u4ed8\u3092\u9078\u629e\u3057\u307e\u3059\u3002
stringTypeHint=Java.lang.String \u306b\u30d0\u30a4\u30f3\u30c9\u3057\u307e\u3059\u3002
integerTypeHint=Java.lang.Integer \u306b\u30d0\u30a4\u30f3\u30c9\u3057\u307e\u3059\u3002
booleanTypeHint=java.lang.Boolean \u306b\u30d0\u30a4\u30f3\u30c9\u3057\u307e\u3059\u3002
longTypeHint=java.lang.Long \u306b\u30d0\u30a4\u30f3\u30c9\u3057\u307e\u3059\u3002
enumTypeHint=\u5404\u30aa\u30d7\u30b7\u30e7\u30f3\u306f java.lang.String \u306b\u30d0\u30a4\u30f3\u30c9\u3055\u308c\u307e\u3059\u3002
xmlTypeHint=org.w3c.Document \u306b\u30d0\u30a4\u30f3\u30c9\u3057\u307e\u3059\u3002
javaTypeHint=\u3042\u306a\u305f\u304c\u9078\u3093\u3060 java \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306b\u30d0\u30a4\u30f3\u30c9\u3057\u307e\u3059\u3002
floatTypeHint=java.lang.Float \u306b\u30d0\u30a4\u30f3\u30c9\u3057\u307e\u3059\u3002
doubleTypeHint=java.lang.Double \u306b\u30d0\u30a4\u30f3\u30c9\u3057\u307e\u3059\u3002
dateTypeHint=java.util.Date \u306b\u30d0\u30a4\u30f3\u30c9\u3057\u307e\u3059\u3002
dataWizardPageReturnTypeNotCorresponding=\u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u623b\u308a\u5024\u304c\u540c\u3058\u30c7\u30fc\u30bf\u578b\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002
editVariable=\u5909\u6570\u3092\u7de8\u96c6
newVariable=\u65b0\u3057\u3044\u5909\u6570
dataSectionDescription=\u30d7\u30ed\u30bb\u30b9\u3067\u64cd\u4f5c\u3055\u308c\u308b\u30d7\u30ed\u30bb\u30b9 \u30c7\u30fc\u30bf\u307e\u305f\u306f\u30d3\u30b8\u30cd\u30b9 \u30c7\u30fc\u30bf\u306e\u51e6\u7406\u5909\u6570\u3092\u8ffd\u52a0\u3057\u307e\u3059\u3002
dataDefaultValueNotCompatibleWithReturnType=\u30c7\u30d5\u30a9\u30eb\u30c8\u5024\u306f\u73fe\u5728\u306e\u30c7\u30fc\u30bf\u578b\u3068\u4e92\u63db\u6027\u304c\u3042\u308a\u307e\u305b\u3093\u3002
listOfOptionsExplanation=\u4ee5\u4e0b\u306e\u30aa\u30d7\u30b7\u30e7\u30f3\u30ea\u30b9\u30c8\u306f\u5b9a\u7fa9\u6e08\u307f
choicesExplanation=\u9078\u629e\u3057\u305f\u30aa\u30d7\u30b7\u30e7\u30f3 \u30ea\u30b9\u30c8\u306b\u4f7f\u7528\u53ef\u80fd\u306a\u30aa\u30d7\u30b7\u30e7\u30f3
chooseTargetStepOrProcess=\u30bf\u30fc\u30b2\u30c3\u30c8\u306e\u30bf\u30b9\u30af\u307e\u305f\u306f\u30d7\u30ed\u30bb\u30b9\u3092\u9078\u629e\u3057\u307e\u3059
PromoteDataWarningTitle=\u30c7\u30fc\u30bf\u3092\u30d7\u30ed\u30e2\u30fc\u30c8
PromoteDataWarningMessage=\u30c7\u30fc\u30bf\u540d {0} \u306f\u65e2\u306b\u30bf\u30fc\u30b2\u30c3\u30c8\u8981\u7d20\u306b\u5b58\u5728\u3057\u307e\u3059
dataMoveErrorTargetSelected=\u30bf\u30fc\u30b2\u30c3\u30c8\u3092\u9078\u629e\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
datamoveErrorWrongTarget=\u9078\u629e\u3057\u305f\u8981\u7d20\u306f\u7279\u5b9a\u306e\u30c7\u30fc\u30bf\u3092\u53d7\u3051\u5165\u308c\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3002
dataMoveErrorTargetCantBeSource=\u5143\u306e\u30b3\u30f3\u30c6\u30ca\u306b\u305d\u306e\u30c7\u30fc\u30bf\u3092\u79fb\u52d5\u3059\u308b\u3053\u3068\u306f\u4e0d\u53ef\u80fd\u3067\u3059\u3002
xmlDefaultValueTooLongTitle=XML \u5165\u529b\u304c\u5927\u304d\u3059\u304e\u307e\u3059
xmlDefaultValueTooLongMessage=\u53c2\u7167\u3055\u308c\u305f XML \u30d5\u30a1\u30a4\u30eb\u306f\u3001\u30c7\u30d5\u30a9\u30eb\u30c8\u5024\u3068\u3057\u3066\u4f7f\u7528\u3059\u308b\u306b\u306f\u5927\u304d\u3059\u304e\u307e\u3059\u3002
editVariableTitle=\u5909\u6570\u3092\u7de8\u96c6
editVariableDescription=Groovy \u30b9\u30af\u30ea\u30d7\u30c8\u3067\u5909\u6570\u3092\u4f7f\u7528\u3057\u3066\u3044\u308b\u5834\u5408\u3001 [OK] \u3092\u30af\u30ea\u30c3\u30af\u3059\u308b\u3068 \u300c\u30ea\u30d5\u30a1\u30af\u30bf\u30ea\u30f3\u30b0\u300d\u30a6\u30a3\u30f3\u30c9\u30a6\u304c\u8868\u793a\u3055\u308c\u3001\u5909\u66f4\u3092\u691c\u8a3c\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002
transientDataWarning=\u6ce8\u610f\: \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3 \u30b5\u30fc\u30d0\u30fc\u304c\u518d\u8d77\u52d5\u3055\u308c\u305f\u5834\u5408\u3001\u3059\u3079\u3066\u306e\u4e00\u6642\u5909\u6570\u306e\u5024\u304c\u521d\u671f\u5024\u306b\u30ea\u30bb\u30c3\u30c8\u3055\u308c\u307e\u3059\u3002\n\u3053\u308c\u3092\u56de\u907f\u3059\u308b\u306b\u306f\u3001\u4e00\u6642\u5909\u6570\u3092\u4f7f\u7528\u3057\u306a\u3044\u3067\u304f\u3060\u3055\u3044\u3002
createVariable=\u5909\u6570\u3092\u4f5c\u6210\u3059\u308b...
dataSectionWithBusinessData=\u30d7\u30ed\u30bb\u30b9\u3067\u64cd\u4f5c\u3055\u308c\u308b\u30d7\u30ed\u30bb\u30b9 \u30c7\u30fc\u30bf\u307e\u305f\u306f\u30d3\u30b8\u30cd\u30b9 \u30c7\u30fc\u30bf\u306e\u51e6\u7406\u5909\u6570\u3092\u8ffd\u52a0\u3057\u307e\u3059\u3002
processData=\u30d7\u30fc\u30eb\u5909\u6570
businessData=\u30d3\u30b8\u30cd\u30b9\u5909\u6570
businessDataHint=\ \u30d3\u30b8\u30cd\u30b9\u6982\u5ff5\uff08\u30d3\u30b8\u30cd\u30b9 \u30c7\u30fc\u30bf \u30e2\u30c7\u30eb\u3067\u5b9a\u7fa9\uff09\u3092\u8868\u73fe\u3059\u308b\u30d3\u30b8\u30cd\u30b9\u5909\u6570\u3092\u4f5c\u6210\u3059\u308b\u3053\u3068\u3067\u3001\u3053\u306e\u30c7\u30fc\u30bf\u306f\u81ea\u52d5\u7684\u306b\u6c38\u4e45\u4fdd\u5b58\u3055\u308c\u307e\u3059\u3002\n\u3053\u306e\u30c7\u30fc\u30bf\u306f\u30d7\u30ed\u30bb\u30b9 \u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\uff08\u6848\u4ef6\u30c7\u30fc\u30bf\uff09\u3092\u30d7\u30ed\u30bb\u30b9\u5916\u90e8\u306b\u5b58\u5728\u3055\u305b\u3001\u4ed6\u306e\u8907\u6570\u306e\u30d7\u30ed\u30bb\u30b9\u3067\u30a2\u30af\u30bb\u30b9\u3067\u304d\u308b\u3088\u3046\u306b\u3057\u307e\u3059\u3002
processDataHint=\uff11\u3064\u306e\u30d7\u30ed\u30bb\u30b9\u3067\u30b0\u30ed\u30fc\u30d0\u30eb\u306b\u4f7f\u7528\u3001\u307e\u305f\u306f\u7279\u5b9a\u306e\u30bf\u30b9\u30af\u306b\u9650\u5b9a\u3067\u304d\u308b\u30d7\u30ed\u30bb\u30b9\u5909\u6570\u3092\u4f5c\u6210\u3057\u307e\u3059\u3002\n\u30d7\u30ed\u30bb\u30b9 \u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u304c\u5b8c\u4e86\u3057\u305f\u5f8c\u3001\u3053\u306e\u30c7\u30fc\u30bf\u306f\u5b58\u5728\u3057\u307e\u305b\u3093\u3002
localVariableDecsription=\u3053\u306e\u7279\u5b9a\u306e\u30a2\u30af\u30c6\u30a3\u30d3\u30c6\u30a3\u7bc4\u56f2\u306b\u9650\u5b9a\u3055\u308c\u308b\u5909\u6570\u3092\u4f5c\u6210\u3057\u307e\u3059\u3002

