processContractSectionDescription=Un contrato define la informaci\u00f3n que un proceso requiere para instanciarse.\nDespu\u00e9s de que se haya definido el contrato, puedes generar el formulario haciendo clic en el icono del UI Designer a la derecha de este panel.\nEsto genera un formulario con los widgets relevantes y datos pertinentes para las entradas de contrato.\nDebe manejar las limitaciones con la validaci\u00f3n del formulario.\nPuedes utilizar como valor inicial de las variables del contrato, variables, documentos y las claves de b\u00fasqueda o en los conectores de entrada (al entrar).
stepContractSectionDescription=Un contrato define la informaci\u00f3n que requiere una tarea para ejecutarse. Si faltan entradas o no se cumplen las restricciones en el env\u00edo del formulario, la tarea no se ejecuta y permanece en estado Ready. Despu\u00e9s de que se haya definido el contrato, se puede generar el formulario haciendo clic en el icono UI Designer a la derecha de este panel. Esto genera un formulario con los widgets relevantes y datos pertinentes para las entradas de contrato. Debe controlar las limitaciones con la validaci\u00f3n en el formulario. Puede utilizar un valor de entrada de contrato en operaciones y conectores de salida (al terminar).
name=Nombre
type=Tipo
mandatory=Requerido
multiple=M\u00faltiple
add=A\u00f1adir
addChild=Agregar hijo
remove=Eliminar
savedInto=Guardar datos
description=Descripci\u00f3n
automaticMappingTooltip=Usar "Ctrl + espacio" para que esta entrada se guarde autom\u00e1ticamente en los datos existentes.
constraints=Restricciones
none=Ninguno
addConstraint=Agregar...
editConstraint=Editar...
inputSuffix=Entrada
duplicatedInputNames=Nombre de entrada duplicado\: {0}
duplicatedConstraintNames=Nombre de restricci\u00f3n duplicado\: {0}
taskInputs=Entradas de la tarea
processInstantiationInputs=Entradas de la instanciaci\u00f3n de proceso
inputTabLabel=Entradas
constraintsTabLabel=Restricciones
contractInputTypeLabel=Entrada de contrato
removeInputConfirmationMessagePart1=\u00bfSeguro que desea borrar la siguiente entrada?
removeInputConfirmationMessagesPart2=\nSi esta entrada es COMPLEX se eliminar\u00e1 a todos los hijos. \nSi esta entrada es referencia \u00fanica de una restricci\u00f3n, esta restricci\u00f3n se eliminar\u00e1.
removeInputConfirmationTitle=\u00bfEst\u00e1 seguro que desea eliminar la entrada del contrato?
removeConstraintConfirmationTitle=\u00bfEst\u00e1 seguro que desea eliminar la(s) restricci\u00f3n(es) del contrato?
removeConstraintConfirmationMessage=\u00bfEst\u00e1 seguro que desea eliminar la(s) siguiente(s) restricci\u00f3n(es)?
returnType=tipo de retorno
up=Arriba
down=Abajo
expression=Expresi\u00f3n
errorMessage=Mensaje de error
noInputReferencedInConstraintExpression=No se hace referencia a ninguna entrada en la expresi\u00f3n de restricci\u00f3n\: {0}
unknownInputReferencedInConstraintExpression=Se hace referencia a ka Entrada desconocida "{0}" en la expresi\u00f3n de {1}
constraintEditorDescription=Escriba la restricci\u00f3n usando Groovy scripting.
contentAssistHint=Usar "Ctrl + espacio" para activar la ayuda de contenido.
addContentToConstraint=Agregar contenido a la restricci\u00f3n {0}
editContentToConstraint=Editar contenido de la restricci\u00f3n {0}
emptyExpressionContent=Vaciar expresi\u00f3n de contenido
noContractInputReferencedInExpression=No existe la entrada del contrato a la cual se hace referencia en la expresi\u00f3n
nullable=Se aceptan valores NULL
removeInputErrorTitle=No se pudo eliminar
removeInputErrorMsg=Error al eliminar la entrada de contrato.
severalCompilationErrors={0} errores de compilaci\u00f3n encontrados.
SelectBusinessDataWizardPageTitle=Seleccione un dato del negocio o un documento
selectBusinessDataWizardPageDescription=Seleccione la variable de negocio o documento desde donde se generar\u00e1 la entrada del contrato.
generate=A\u00f1adir desde datos...
contractInputGenerationTitle=A\u00f1adir entrada de contrato 
rootContractInputName=Nombre de entrada
selectFieldToGenerateTitle=Seleccione {0} atributos para a\u00f1adir al contrato
selectFieldToGenerateDescription=Seleccione los campos que desea reutilizar en su contrato.
inputOfType=de tipo COMPLEX
inputType=Tipo de Entrada
attributetype=Tipo de atributo
atLeastOneAttributeShouldBeSelectedError=Al menos un atributo debe ser seleccionado.
attributeName=Nombre del Atributo
warningAddFromData_noDataAvailable=Primero cree una variable de negocio o un documento desde la vista de Documentos.
warningAddFromData_noDataSelected=Por favor seleccione una variable de negocio en la lista.
reminderForStepMessage=De la definici\u00f3n del contrato, el estudio puede generar autom\u00e1ticamente las operaciones de guardar o actualizar las variables del negocio. \nPosteriormente, se pueden modificar estas operaciones si es necesario.
reminderForProcessMessage=De la definici\u00f3n de contrato, el estudio puede generar autom\u00e1ticamente scripts para inicializar variables de negocio.
contractInputDescriptionTooltip=Utilizado en los formularios auto-generados como sugerencia de usuario
errorTitle=Error
contractFromDataCreationErrorMessage=Error al generar el contrato basado en los datos.
contractGenerationTitle=Generaci\u00f3n de contrato
contractOperationGenerationMsg=Las entradas de contrato han sido especificadas. \n\nSe generar\u00e1n las operaciones para establecer los valores de los atributos de las variables de negocio con los valores de entrada del contrato. Pueden verse en el Panel de operaciones. \nSi las operaciones ya se han generado para estos atributos, no se reemplazar\u00e1n. Las nuevas operaciones se agregan a la lista. \n\nLas entradas y operaciones del Contrato pueden editarse manualmente. \nSin embargo, hay no refactorizaci\u00f3n (por ejemplo, actualizar el nombre de un atributo o de una propiedad m\u00faltiple en un elemento de objeto de negocio o del contrato romper\u00e1 la operaci\u00f3n).
doNotShowMeAgain=No volver a mostrar este cuadro de di\u00e1logo
notAllAttributesGeneratedTitle=Inicializaci\u00f3n incompleta de la variable de negocio
notAllAttributesGeneratedTaskTitle=Actualizaci\u00f3n incompleta de la variable de negocio
notAllAttributesGeneratedMsg=Algunos atributos de la variable de negocio no se inicializar\u00e1n desde los elementos del contrato ya que han sido deseleccionados.
notAllAttributesGeneratedTaskMsg=Algunos atributos de la variable de negocio no se actualizar\u00e1n desde los elementos del contrato ya que han sido deseleccionados.
autoGeneratedOperationStepButton=Generaci\u00f3n autom\u00e1tica de las operaciones de almacenamiento
manuallyDefinedOperationStepButton=No, gracias. Definir\u00e9 manualmente c\u00f3mo utilizar el contrato.
autoGeneratedOperationProcessButton=Generar autom\u00e1ticamente el script de inicializaci\u00f3n. Haga clic en el bot\u00f3n de vista previa para comprobar su contenido.
manuallyDefinedOperationProcessButton=No, gracias. Definir\u00e9 manualmente c\u00f3mo utilizar el contrato.
contractStrictGenerationMsg=Las entradas del contrato han sido especificadas. \nSe generar\u00e1 un script que establece los valores predeterminados de los atributos de las variables de negocio con los valores de entrada del contrato. Se puede ver y editar en la pesta\u00f1a de Datos. Si el valor predeterminado de una variable de negocio ya existe, este script lo sobreescribir\u00e1. \n\nLas entradas del Contrato y del Script pueden editarse manualmente. \nSin embargo, no hay refactorizaci\u00f3n (por ejemplo, actualizar el nombre del atributo o una propiedad m\u00faltiple en un objeto de negocio o en el contrato romper\u00e1 el script).
invalidBusinessDataSelected=Datos del negocio seleccionados no v\u00e1lidos.
setGeneratedScriptPreviewPageDescription=Vista previa del script generado que inicializa el valor predeterminado de la variable {0}. Para editar este script, vaya a la definici\u00f3n de esta variable y edite el valor por defecto.
generatedScriptPreviewTitle=Vista previa del script generado
scriptNameLabel=Nombre del script
selectAll=Seleccionar todo
deselectAll=Anular todas las selecciones
preview=Vista previa >
selectMandatories=Atributos obligatorios
mandatoryFieldsNotSelectedWarning=Uno o varios atributos obligatorios no han sido seleccionados\: {0}. Selecci\u00f3nelo(s) o inicial\u00edcelo(s) manualmente.
mandatoryFieldsNotSelectedStepWarning=Uno o varios atributos obligatorios no han sido seleccionados\: {0}. Selecci\u00f3nelos o o cree las operaciones de almacenamiento y actualizaci\u00f3n.
businessVariable=Variable de negocio
document=Documento
defaultValueAlreadyDefinedWarning=El documento {0} ya est\u00e1 inicializado. La creaci\u00f3n de esta entrada sobrescribir\u00e1 el valor actual de {0} por el valor de la entrada del contrato.
fileInputType=de tipo FILE
openUpdateDocumentOperationWarningTitle=Generaci\u00f3n de la operaci\u00f3n de actualizaci\u00f3n de documentos
openUpdateDocumentOperationWarningMessages=La entrada del contrato ha sido especificada. Se generar\u00e1n las operaciones para establecer el valor del documento {0} con el valor de entrada del contrato. Puede verse en la secci\u00f3n de Operaciones. Si la operaci\u00f3n ya ha sido generada por esta entrada, no se reemplazar\u00e1.
updateInitialDocumentContentWarningTitle=Actualizar el contenido del documento inicial
updateInitialDocumentContentWarningMsg=Se ha especificado la entrada del contrato. Se establecer\u00e1 el contenido inicial del documento "%s". Puede verse abriendo el documento en el panel de Datos. Si ya se ha definido el contenido inicial, se reemplazar\u00e1. La entrada de contrato puede ser editada manualmente.
longConversionWarning=Debido a un problema de interoperabilidad entre tipo Long de Java y el tipo num\u00e9rico de JavaScript, no deber\u00eda tener una entrada de contrato de tipo Long si va a iniciar su proceso mediante un formulario. El tipo Long en un contrato se recomienda para procesos iniciados por actividades de llamada o mediante programaci\u00f3n en Java.
creatingMappingOperation=Creando la operaci\u00f3n de mapeo para %s
saving=Guardando...
taskBdmTips=Primero defina <a>las variables de negocio</a> y/o<a>los documentos</a> y luego haga clic en "Agregar datos...". Autom\u00e1ticamente se mapen las entradas de contrato a los datos y se crean operaciones para actualizar datos con valores de contrato.
poolBdmTips=Primero defina <a>las variables de negocio</a> y/o<a>los documentos</a> y luego haga clic en "Agregar datos...". Autom\u00e1ticamente se mapean las entradas de contrato a los datos y se crean operaciones para actualizar datos con valores de contrato.
creatingNewForm=Creating new form...

