processContractSectionDescription=Un contrat d\u00e9finit les informations dont un processus a besoin pour s'instancier. \nD\u00e9finissez le contrat puis g\u00e9n\u00e9rez un formulaire en cliquant sur l'icon UI Designer \u00e0 droite dans ce panneau. Ce formulaire sera pr\u00e9-rempli avec les widgets et les variables li\u00e9s aux inputs du contrat. Vous g\u00e9rerez les contraintes en ajoutant des \u00e9l\u00e9ments de validation aux champs. \nLes inputs de contrat peuvent servir de valeurs initiales aux variables, documents ou cl\u00e9s de recherche, ou encore \u00eatre utilis\u00e9s par les connecteurs en entr\u00e9e (on enter).
stepContractSectionDescription=Un contrat d\u00e9finit les informations n\u00e9cessaires \u00e0 une t\u00e2che pour s'ex\u00e9cuter. S'il manque des inputs ou si les contraintes ne sont pas respect\u00e9es \u00e0 l'envoi du formulaire, la t\u00e2che n'est pas ex\u00e9cut\u00e9e (elle reste en attente (\u00e9tat ready)). \nD\u00e9finissez le contrat puis g\u00e9n\u00e9rez le formulaire en cliquant sur l'icon UI Designer \u00e0 droite dans ce panneau. Ce formulaire sera pr\u00e9-rempli avec les widgets et les variables li\u00e9s aux inputs du contrat. Vous g\u00e9rerez les contraintes en ajoutant des \u00e9l\u00e9ments de validation aux champs. \nUn input peut \u00eatre utilis\u00e9 dans les op\u00e9rations et les connecteurs en sortie (on finish).
name=Nom
type=Type
mandatory=Obligatoire
multiple=Multiple
add=Ajouter
addChild=Ajouter un enfant
remove=Supprimer
savedInto=Variable associ\u00e9e
description=Description
automaticMappingTooltip=Faites \u00ab Ctrl + espace \u00bb pour enregistrer cet input dans une variable existante.
constraints=Contraintes
none=Aucune
addConstraint=Ajouter...
editConstraint=Modifier ...
inputSuffix=Entr\u00e9e
duplicatedInputNames=Ce nom d''input existe d\u00e9j\u00e0 \: {0}
duplicatedConstraintNames=Ce nom de contrainte existe d\u00e9j\u00e0 \: {0}
taskInputs=Inputs de t\u00e2che
processInstantiationInputs=Inputs d'instanciation de processus
inputTabLabel=Entr\u00e9es
constraintsTabLabel=Contraintes
contractInputTypeLabel=Input de contrat
removeInputConfirmationMessagePart1=Voulez-vous vraiment supprimer l'input suivant ?
removeInputConfirmationMessagesPart2=\nSi cet input est de type COMPLEX, tous ses enfants seront supprim\u00e9s. S'il s'agit de la r\u00e9f\u00e9rence unique d'une contrainte, celle-ci sera supprim\u00e9e.
removeInputConfirmationTitle=\u00cates-vous s\u00fbr(e) de vouloir supprimer cet input de contrat ?
removeConstraintConfirmationTitle=\u00cates-vous s\u00fbr(e) de vouloir supprimer cette(ces) contrainte(s) de contrat ?
removeConstraintConfirmationMessage=\u00cates-vous s\u00fbr(e) de vouloir supprimer la(les) contrainte(s) suivante(s) ?
returnType=Type de retour
up=Monter
down=Descendre
expression=Expression
technicalErrorMessage=Message d'erreur technique
noInputReferencedInConstraintExpression=La contrainte {0} ne r\u00e9f\u00e9rence aucun input
unknownInputReferencedInConstraintExpression=L''expression de {1} fait r\u00e9f\u00e9rence \u00e0 un input inexistant "{0}"
constraintEditorDescription=Saisissez la contrainte en utilisant un script Groovy.
contentAssistHint=Faites \u00ab Ctrl + espace \u00bb pour afficher l'aide \u00e0 la compl\u00e9tion.
addContentToConstraint=Ajouter le contenu de la contrainte {0}
editContentToConstraint=Modifier la contrainte {0}
emptyExpressionContent=L'expression est vide
noContractInputReferencedInExpression=L'expression ne r\u00e9f\u00e9rence aucun input
nullable=Peut \u00eatre nul
removeInputErrorTitle=La suppression a \u00e9chou\u00e9
removeInputErrorMsg=Une erreur s'est produite lors de la suppression de l'input du contrat.
severalCompilationErrors={0} erreurs de compilation ont \u00e9t\u00e9 trouv\u00e9es.
SelectBusinessDataWizardPageTitle=Select the data and the action to perform
selectBusinessDataWizardPageDescription=Select the business variable or document which the contract inputs will be created as well as the action to perform.
generate=Ajouter \u00e0 partir de donn\u00e9es...
contractInputGenerationTitle=Ajouter l'input de contrat 
rootContractInputName=Nom de l'input
selectFieldToGenerateTitle=S\u00e9lectionnez les attributs de {0} \u00e0 ajouter au contrat
selectFieldToGenerateDescription=Choisissez les champs que vous souhaitez r\u00e9utiliser dans votre contrat.
inputOfType=de type COMPLEX
inputType=Type de l'input
attributetype=Type de l'attribut
atLeastOneAttributeShouldBeSelectedError=S\u00e9lectionnez au moins un attribut.
attributeName=Nom de l'attribut
warningAddFromData_noDataAvailable=Cr\u00e9ez d'abord une variable m\u00e9tier ou un document, dans l'onglet Donn\u00e9es.
warningAddFromData_noDataSelected=S\u00e9lectionnez une variable m\u00e9tier dans la liste.
reminderForStepMessage=Le Studio peut automatiquement g\u00e9n\u00e9rer les op\u00e9rations qui stockent ou mettent \u00e0 jour les variables m\u00e9tier \u00e0 partir de la d\u00e9finition du contrat. Vous pourrez les modifier par la suite si n\u00e9cessaire.
reminderForProcessMessage=Le Studio peut automatiquement g\u00e9n\u00e9rer le script qui initialise les variables m\u00e9tier \u00e0 partir de la d\u00e9finition du contrat.
contractInputDescriptionTooltip=Fournie \u00e0 l'utilisateur pour chaque champ dans les formulaires g\u00e9n\u00e9r\u00e9s automatiquement
errorTitle=Erreur
contractFromDataCreationErrorMessage=Une erreur s'est produite lors de la g\u00e9n\u00e9ration du contrat \u00e0 partir d'une donn\u00e9e.
contractGenerationTitle=G\u00e9n\u00e9ration de contrat
contractOperationGenerationMsg=Les inputs de contrat ont \u00e9t\u00e9 sp\u00e9cifi\u00e9s. \n\nLes op\u00e9rations qui attribuent les valeurs des inputs de contrat aux attributs de la variable m\u00e9tier vont \u00eatre g\u00e9n\u00e9r\u00e9es et affich\u00e9es dans le panneau Op\u00e9rations. \nElles ne remplaceront pas les op\u00e9rations d\u00e9j\u00e0 existantes sur ces attributs, s'il y en a. Elles seront ajout\u00e9es \u00e0 la liste. \n\nEnfin, le refactoring n'a pas \u00e9t\u00e9 impl\u00e9ment\u00e9 \: modifier le nom d'un attribut ou sa propri\u00e9t\u00e9 multiple dans un objet m\u00e9tier ou un input de contrat rendra l'op\u00e9ration invalide.
doNotShowMeAgain=Ne plus afficher ce dialogue
notAllAttributesGeneratedTitle=La variable m\u00e9tier n'a pas \u00e9t\u00e9 enti\u00e8rement initialis\u00e9e
notAllAttributesGeneratedTaskTitle=La variable m\u00e9tier n'a pas \u00e9t\u00e9 enti\u00e8rement mise \u00e0 jour
notAllAttributesGeneratedMsg=Certains attributs de la variable m\u00e9tier ne seront pas initialis\u00e9s \u00e0 partir des \u00e9l\u00e9ments du contrat, car ils ont \u00e9t\u00e9 d\u00e9s\u00e9lectionn\u00e9s.
notAllAttributesGeneratedTaskMsg=Certains attributs de la variable m\u00e9tier ne seront pas initialis\u00e9s \u00e0 partir des \u00e9l\u00e9ments de contrat, car ils ont \u00e9t\u00e9 d\u00e9s\u00e9lectionn\u00e9s.
autoGeneratedOperationStepButton=G\u00e9n\u00e9rer automatiquement les op\u00e9rations de stockage
manuallyDefinedOperationStepButton=Non merci. Je d\u00e9finirai manuellement comment le contrat sera utilis\u00e9.
autoGeneratedOperationProcessButton=G\u00e9n\u00e9rer automatiquement le script d'initialisation. Cliquez sur le bouton Aper\u00e7u pour v\u00e9rifier son contenu.
manuallyDefinedOperationProcessButton=Non merci. Je d\u00e9finirai manuellement comment le contrat sera utilis\u00e9.
contractStrictGenerationMsg=Les inputs de contrat ont \u00e9t\u00e9 sp\u00e9cifi\u00e9s. \nUn script qui initialise les valeurs par d\u00e9faut des attributs de la variable m\u00e9tier avec les inputs du contrat va \u00eatre g\u00e9n\u00e9r\u00e9. Il peut \u00eatre lu et \u00e9dit\u00e9 dans l'onglet Donn\u00e9es. Si la valeur par d\u00e9faut de la variable m\u00e9tier existe d\u00e9j\u00e0, elle sera remplac\u00e9e par ce script. \n\nEnfin, le refactoring n'a pas \u00e9t\u00e9 impl\u00e9ment\u00e9 \: modifier le nom d'un attribut ou sa propri\u00e9t\u00e9 multiple dans un objet m\u00e9tier ou un input de contrat rend l'expression de la valeur par d\u00e9faut invalide.
invalidBusinessDataSelected=La donn\u00e9e m\u00e9tier s\u00e9lectionn\u00e9e est invalide.
setGeneratedScriptPreviewPageDescription=Aper\u00e7u du script auto-g\u00e9n\u00e9r\u00e9 qui initalise la valeur par d\u00e9faut de la variable {0}. Pour \u00e9diter ce script, ouvrez la d\u00e9finition de cette variable et \u00e9ditez la valeur par d\u00e9faut.
generatedScriptPreviewTitle=Aper\u00e7u du script g\u00e9n\u00e9r\u00e9
scriptNameLabel=Nom du script
selectAll=Tout s\u00e9lectionner 
deselectAll=Tous d\u00e9selectionner
preview=Aper\u00e7u >
selectMandatories=Attributs obligatoires
mandatoryFieldsNotSelectedWarning=Un ou plusieurs attributs obligatoires ne sont pas s\u00e9lectionn\u00e9s \: {0}. S\u00e9lectionnez-le(s) ou initialisez-le(s) manuellement.
mandatoryFieldsNotSelectedStepWarning=Un ou plusieurs attributs obligatoires ne sont pas s\u00e9lectionn\u00e9s \: {0} . S\u00e9lectionnez-le(s) ou cr\u00e9ez ses/leurs op\u00e9rations de stockage et de mise \u00e0 jour.
businessVariable=Variable m\u00e9tier
document=Document
defaultValueAlreadyDefinedWarning=Le document {0} est d\u00e9j\u00e0 initialis\u00e9. La cr\u00e9ation de cet input va remplacer la valeur actuelle de {0} par la valeur de l''input.
fileInputType=de type FILE
openUpdateDocumentOperationWarningTitle=G\u00e9n\u00e9ration de l'op\u00e9ration de mise \u00e0 jour du document
openUpdateDocumentOperationWarningMessages=L'input de contrat a \u00e9t\u00e9 sp\u00e9cifi\u00e9.\nIl sp\u00e9cifiera le contenu du document `%s`, ou le remplacera s'il existe d\u00e9j\u00e0.\nPour afficher le contenu, allez dans le panneau Op\u00e9rations.\nL'input de contrat peut \u00eatre modifi\u00e9 manuellement.
updateInitialDocumentContentWarningTitle=Mise \u00e0 jour du contenu initial du document
updateInitialDocumentContentWarningMsg=L'input de contrat a \u00e9t\u00e9 sp\u00e9cifi\u00e9.\nIl sp\u00e9cifiera le contenu initial du document `%s`.\nPour afficher le contenu, allez dans le panneau de Donn\u00e9es et ouvrez le document.\nL'input de contrat peut \u00eatre modifi\u00e9 manuellement.
longConversionWarning=Si ce processus est instanci\u00e9 par un formulaire, n'utilisez pas d'input de contrat de type Long (probl\u00e8me d\u2019interop\u00e9rabilit\u00e9 entre le type Long de Java et le type Numeric de JavaScript). Vous pouvez le faire s'il est instanci\u00e9 par activit\u00e9 appelante ou de fa\u00e7on programmatique en Java.
creatingMappingOperation=Cr\u00e9ation des op\u00e9ration de mapping pour %s
saving=Enregistrement en cours...
taskBdmTips=Il est conseill\u00e9 de d'abord d\u00e9finir des <a>variables m\u00e9tier</a> et/ou des <a>documents</a> puis de cliquer sur \u00ab\u00a0Ajouter \u00e0 partir de donn\u00e9es...\u00a0\u00bb.\nCette fonction cr\u00e9era automatiquement le mapping entre inputs de contrat et donn\u00e9es. Elle cr\u00e9era aussi les op\u00e9rations de mise \u00e0 jour des donn\u00e9es avec les valeurs du contrat.
poolBdmTips=Il est conseill\u00e9 de d'abord d\u00e9finir des <a>variables m\u00e9tier</a> et/ou des <a>documents</a> puis de cliquer sur \u00ab\u00a0Ajouter \u00e0 partir de donn\u00e9es...\u00a0\u00bb.\nCette fonction cr\u00e9era automatiquement le mapping entre inputs de contrat et donn\u00e9es. Elle initialisera aussi les donn\u00e9es avec les valeurs du contrat.
creatingNewForm=Cr\u00e9ation d'un nouveau formulaire ...
createDataFromContractChoice=Instantiate
editDataFromContractChoice=Edit
lazyFieldInAMultipleParentRelationHasBeenDeselect=La modification de cette variable dans le formulaire g\u00e9n\u00e9r\u00e9 automatiquement n'est pas support\u00e9e (r\u00e9f\u00e9rence lazy avec parent multiple).\nVous pouvez vous r\u00e9f\u00e9rer \u00e0 la documentation en lien ci-dessous. Si n\u00e9cessaire, cochez la case pour impl\u00e9menter manuellement l'\u00e9dition dans le formulaire g\u00e9n\u00e9r\u00e9.
aChildHasBeenUnselected=Un objet imbriqu\u00e9 a \u00e9t\u00e9 d\u00e9s\u00e9lectionn\u00e9.
moreInfoFormGenerationLink=Plus d\u2019informations sur <a>les contrats et la g\u00e9n\u00e9ration de formulaires</a>.
contractInputEqualToBusinessDataError=Le nom de l'input de contrat doit \u00eatre diff\u00e9rent du nom des donn\u00e9es m\u00e9tier associ\u00e9es
createReadOnlWidgetsTitle=Cr\u00e9er des widgets pour les attributs en lecture seule
createReadOnlWidgetsMessage=Le formulaire g\u00e9n\u00e9r\u00e9 comportera des widgets pour les inputs de contrat qui doivent \u00eatre remplis.\nIl peut \u00e9galement comporter des widgets pour afficher en lecture seule les autres attributs des variables en lien avec les inputs de contrat.\nAvez-vous besoin de ces widgets sur le formulaire ?
contractInputEqualToDocumentError=Le nom de l'input de contrat doit \u00eatre diff\u00e9rent du nom du document associ\u00e9
createReadOnlWidgetsdetails=Pour en savoir plus, lisez la documentation sur la <a>G\u00e9n\u00e9ration de formulaire</a>.
data=Data
action=Action
createActionHint=The variable will be instantiated with the contract input value.
editActionHint=The existing values for the variable will be retrieved from the context, and edited with the contract inputs.