processContractSectionDescription=\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u306f\u3001\u30d7\u30ed\u30bb\u30b9\u304c\u5fc5\u8981\u3068\u3059\u308b\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u3092\u751f\u6210\u3059\u308b\u305f\u3081\u306e\u60c5\u5831\u3092\u5b9a\u7fa9\u3057\u307e\u3059\u3002\n\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u3092\u5b9a\u7fa9\u3057\u305f\u5f8c\u3001\u3053\u306e\u30d1\u30cd\u30eb\u306e\u53f3\u5074\u306b\u3042\u308b UI \u30c7\u30b6\u30a4\u30ca\u30fc\u306e\u30a2\u30a4\u30b3\u30f3\u3092\u30af\u30ea\u30c3\u30af\u3057\u3066\u30d5\u30a9\u30fc\u30e0\u3092\u751f\u6210\u3067\u304d\u307e\u3059\u3002UI \u30c7\u30b6\u30a4\u30ca\u30fc\u306f\u3001\u30d7\u30ed\u30bb\u30b9 \u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306e\u5165\u529b\u9805\u76ee\u306b\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0\u3057\u3066\u3044\u308b\u95a2\u9023\u306e\u30a6\u30a3\u30b8\u30a7\u30c3\u30c8\u3068\u30c7\u30fc\u30bf\u3067\u30d5\u30a9\u30fc\u30e0\u3092\u751f\u6210\u3057\u307e\u3059\u3002\u30d5\u30a9\u30fc\u30e0\u306e\u30c7\u30fc\u30bf\u5165\u529b\u691c\u8a3c\uff08\u30a8\u30e9\u30fc\u30c1\u30a7\u30c3\u30af\uff09\u306b\u306f\u3001\u5236\u7d04\u6761\u4ef6\uff08constraint\uff09\u3092\u5b9a\u7fa9\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002\n\u5909\u6570\u3001\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8\u304a\u3088\u3073\u691c\u7d22\u30ad\u30fc\u306e\u521d\u671f\u5024\u3068\u3057\u3066\u5165\u529b\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u306e\u5024\u3092\u4f7f\u7528\u3067\u304d\u307e\u3059\u3002\u307e\u305f\u3001 \u30bf\u30b9\u30af\u958b\u59cb\u6642\u306b\u30b3\u30fc\u30eb\u3055\u308c\u308b\u5165\u53e3\u30b3\u30cd\u30af\u30bf\u5185\u3067\u3082\u4f7f\u7528\u3067\u304d\u307e\u3059\u3002
stepContractSectionDescription=\u30b3\u30f3\u30b9\u30c8\u30e9\u30af\u30c8\u306f\u3001\u30bf\u30b9\u30af\u306e\u5b9f\u884c\u306b\u5fc5\u8981\u306a\u60c5\u5831\u3092\u5b9a\u7fa9\u3057\u307e\u3059\u3002\u30d5\u30a9\u30fc\u30e0\u306e\u9001\u4fe1\u6642\u306b\u5165\u529b\u9805\u76ee\u304c\u6b20\u843d\u3057\u3066\u3044\u305f\u308a\u3001\u5236\u7d04\uff08constraint\uff09\u6761\u4ef6\u304c\u6e80\u305f\u3055\u308c\u306a\u3044\u5834\u5408\u306f\u3001\u305d\u306e\u30bf\u30b9\u30af\u306f\u5b9f\u884c\u3055\u308c\u305a\u3001\u5f85\u6a5f\u72b6\u614b\u306e\u307e\u307e\u306b\u306a\u308a\u307e\u3059\u3002\n\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u3092\u5b9a\u7fa9\u3057\u305f\u5f8c\u3001\u3053\u306e\u30d1\u30cd\u30eb\u306e\u53f3\u5074\u306b\u3042\u308b UI \u30c7\u30b6\u30a4\u30ca\u30fc\u306e\u30a2\u30a4\u30b3\u30f3\u3092\u30af\u30ea\u30c3\u30af\u3059\u308b\u3053\u3068\u306b\u3088\u3063\u3066\u3001\u30d5\u30a9\u30fc\u30e0\u3092\u751f\u6210\u3067\u304d\u307e\u3059\u3002UI \u30c7\u30b6\u30a4\u30ca\u30fc\u306f\u30bf\u30b9\u30af\u306e\u5165\u529b\u9805\u76ee\u306b\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0\u3057\u3066\u3044\u308b\u95a2\u9023\u306e\u30a6\u30a3\u30b8\u30a7\u30c3\u30c8\u3068\u30c7\u30fc\u30bf\u3067\u30d5\u30a9\u30fc\u30e0\u3092\u751f\u6210\u3057\u307e\u3059\u3002\u30d5\u30a9\u30fc\u30e0\u306e\u30c7\u30fc\u30bf\u5165\u529b\u691c\u8a3c\uff08\u30a8\u30e9\u30fc\u30c1\u30a7\u30c3\u30af\uff09\u306b\u306f\u3001\u5236\u7d04\u6761\u4ef6\uff08constraint\uff09\u3092\u5b9a\u7fa9\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002\n\u30c7\u30fc\u30bf\u64cd\u4f5c\u5185\u3001\u304a\u3088\u3073\u30bf\u30b9\u30af\u7d42\u4e86\u6642\u306b\u30b3\u30fc\u30eb\u3055\u308c\u308b\u51fa\u53e3\u30b3\u30cd\u30af\u30bf\u5185\u3067\u5165\u529b\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u306e\u5024\u3092\u4f7f\u7528\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002
name=\u540d\u524d
type=\u30bf\u30a4\u30d7
mandatory=\u5fc5\u9808
multiple=\u8907\u6570
add=\u8ffd\u52a0
addChild=\u5b50\u3092\u8ffd\u52a0
remove=\u524a\u9664
savedInto=\u30c7\u30fc\u30bf\u3092\u4fdd\u5b58
description=\u8aac\u660e
automaticMappingTooltip=\u65e2\u5b58\u306e\u30c7\u30fc\u30bf\u5165\u529b\u3092\u81ea\u52d5\u7684\u306b\u4fdd\u5b58\u3059\u308b\u306b\u306f\u3001"Ctrl + Space"\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002
constraints=\u5236\u7d04
none=\uff1c\u306a\u3057\uff1e
addConstraint=\u8ffd\u52a0...
editConstraint=\u7de8\u96c6...
inputSuffix=\u5165\u529b
duplicatedInputNames=\u91cd\u8907\u3057\u3066\u3044\u308b\u5165\u529b\u540d\: {0}
duplicatedConstraintNames=\u91cd\u8907\u3057\u3066\u3044\u308b\u5236\u7d04\u540d\: {0}
taskInputs=\u30bf\u30b9\u30af\u306e\u5165\u529b\u9805\u76ee
processInstantiationInputs=\u30d7\u30ed\u30bb\u30b9\u8d77\u6848\uff08\u521d\u671f\u5316\uff09\u306e\u5165\u529b\u9805\u76ee
inputTabLabel=\u5165\u529b
constraintsTabLabel=\u5236\u7d04
contractInputTypeLabel=\u5165\u529b\u30b3\u30f3\u30c8\u30e9\u30af\u30c8
removeInputConfirmationMessagePart1=\u6b21\u306e\u5165\u529b\u3092\u524a\u9664\u3057\u3066\u3082\u3088\u308d\u3057\u3044\u3067\u3059\u304b?
removeInputConfirmationMessagesPart2=\u3053\u306e\u5165\u529b\u304c\u8907\u5408\u30c7\u30fc\u30bf\u578b\uff08COMPLEX\uff09\u306e\u5834\u5408\u3001\u3059\u3079\u3066\u306e\u5b50\u304c\u524a\u9664\u3055\u308c\u307e\u3059\u3002\n\u3053\u306e\u5165\u529b\u304c\u5236\u7d04\u3092\uff11\u3064\u53c2\u7167\u3057\u3066\u3044\u308b\u5834\u5408\u3001\u305d\u306e\u5236\u7d04\u304c\u524a\u9664\u3055\u308c\u307e\u3059\u3002
removeInputConfirmationTitle=\u5165\u529b\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u3092\u524a\u9664\u3057\u3066\u3088\u308d\u3057\u3044\u3067\u3059\u304b\uff1f
removeConstraintConfirmationTitle=\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u306e\u5236\u7d04\u6761\u4ef6\uff08\u8907\u6570\uff09\u3092\u524a\u9664\u3057\u3066\u3088\u308d\u3057\u3044\u3067\u3059\u304b\uff1f
removeConstraintConfirmationMessage=\u6b21\u306e\u5236\u7d04\u6761\u4ef6\u3092\u524a\u9664\u3057\u3066\u3082\u3088\u308d\u3057\u3044\u3067\u3059\u304b\uff1f
returnType=\u623b\u308a\u5024\u306e\u578b
up=\u4e0a\u3078
down=\u4e0b\u3078
expression=\u5f0f
errorMessage=\u30a8\u30e9\u30fc\u30e1\u30c3\u30bb\u30fc\u30b8
noInputReferencedInConstraintExpression=\u5236\u7d04\u306e\u5f0f\u306b\u5165\u529b\u304c\u53c2\u7167\u3055\u308c\u3066\u3044\u306a\u3044\uff1a {0}
unknownInputReferencedInConstraintExpression={1} \u306e\u5f0f\u3067\u672a\u77e5\u306e\u5165\u529b\u300c{0}\u300d\u304c\u53c2\u7167\u3055\u308c\u3066\u3044\u307e\u3059\u3002
constraintEditorDescription=Groovy \u30b9\u30af\u30ea\u30d7\u30c8\u3092\u4f7f\u7528\u3057\u3066\u5236\u7d04\u3092\u5165\u529b\u3057\u307e\u3059\u3002
contentAssistHint=\u30b3\u30f3\u30c6\u30f3\u30c4 \u30a2\u30b7\u30b9\u30c8\u3092\u8d77\u52d5\u3059\u308b\u306b\u306f\u3001\u300cCtrl + \u30b9\u30da\u30fc\u30b9\u300d\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002
addContentToConstraint=\u5236\u7d04 {0} \u306b\u30b3\u30f3\u30c6\u30f3\u30c4\u3092\u8ffd\u52a0
editContentToConstraint=\u5236\u7d04 {0} \u306e\u30b3\u30f3\u30c6\u30f3\u30c4\u3092\u7de8\u96c6
emptyExpressionContent=\u5f0f\u306e\u30b3\u30f3\u30c6\u30f3\u30c4\u304c\u7a7a\u3067\u3059
noContractInputReferencedInExpression=\u5165\u529b\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u306f\u3001\u5f0f\u3067\u53c2\u7167\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
nullable=Null \u3092\u8a31\u3059
removeInputErrorTitle=\u524a\u9664\u306b\u5931\u6557\u3057\u307e\u3057\u305f
removeInputErrorMsg=\u5165\u529b\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u306e\u524a\u9664\u6642\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
severalCompilationErrors={0} \u30b3\u30f3\u30d1\u30a4\u30eb \u30a8\u30e9\u30fc\u304c\u898b\u3064\u304b\u308a\u307e\u3057\u305f\u3002
SelectBusinessDataWizardPageTitle=\u30d3\u30b8\u30cd\u30b9 \u30c7\u30fc\u30bf\u3001\u307e\u305f\u306f\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8\u3092\u9078\u629e
selectBusinessDataWizardPageDescription=\u5165\u529b\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u306e\u751f\u6210\u5143\u306e\u30d3\u30b8\u30cd\u30b9\u5909\u6570\u3001\u307e\u305f \u30c9\u30ad\u30e5\u30e1\u30f3\u30c8\u3092\u9078\u629e\u3057\u307e\u3059\u3002
generate=\u30c7\u30fc\u30bf\u304b\u3089\u8ffd\u52a0...
contractInputGenerationTitle=\u5165\u529b\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u3092\u8ffd\u52a0
rootContractInputName=\u5165\u529b\u540d
selectFieldToGenerateTitle=\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u306b\u8ffd\u52a0\u3059\u308b{0} \u5c5e\u6027\u3092\u9078\u629e\u3057\u307e\u3059
selectFieldToGenerateDescription=\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u306e\u4e2d\u3067\u518d\u5229\u7528\u3057\u305f\u3044\u30d5\u30a3\u30fc\u30eb\u30c9\u3092\u9078\u629e\u3057\u307e\u3059\u3002
inputOfType=\u8907\u5408\u578b\uff08COMPLEX\uff09
inputType=\u5165\u529b\u306e\u578b
attributetype=\u5c5e\u6027\u306e\u578b
atLeastOneAttributeShouldBeSelectedError=\u5c11\u306a\u304f\u3068\u3082 1 \u3064\u306e\u5c5e\u6027\u3092\u30c1\u30a7\u30c3\u30af\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
attributeName=\u5c5e\u6027\u540d
warningAddFromData_noDataAvailable=\u6700\u521d\u306b\u30c7\u30fc\u30bf \u30d3\u30e5\u30fc\u304b\u3089\u30d3\u30b8\u30cd\u30b9\u5909\u6570\u3001\u307e\u305f\u306f\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8 \u30d3\u30e5\u30fc\u304b\u3089\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8\u3092\u4f5c\u6210\u3057\u3066\u304f\u3060\u3055\u3044\u3002
warningAddFromData_noDataSelected=\u30d3\u30b8\u30cd\u30b9\u5909\u6570\u3092\u4e00\u89a7\u3067\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044\u3002
reminderForStepMessage=Studio \u306f\u3001\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u5b9a\u7fa9\u3092\u57fa\u306b\u30d3\u30b8\u30cd\u30b9\u5909\u6570\u306e\u5024\u3092\u30bb\u30c3\u30c8\u3001\u307e\u305f\u306f\u66f4\u65b0\u3059\u308b\u30c7\u30fc\u30bf\u64cd\u4f5c\u3092\u81ea\u52d5\u751f\u6210\u3067\u304d\u307e\u3059\u3002\n\u3053\u308c\u3089\u306e\u64cd\u4f5c\u306f\u3001\u5fc5\u8981\u306b\u5fdc\u3058\u3066\u5909\u66f4\u3067\u304d\u307e\u3059\u3002
reminderForProcessMessage=Studio \u306f\u3001\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u5b9a\u7fa9\u3092\u57fa\u306b\u30d3\u30b8\u30cd\u30b9\u5909\u6570\u3092\u521d\u671f\u5316\u3059\u308b\u30b9\u30af\u30ea\u30d7\u30c8\u3092\u81ea\u52d5\u751f\u6210\u3067\u304d\u307e\u3059\u3002
contractInputDescriptionTooltip=\u81ea\u52d5\u751f\u6210\u3055\u308c\u305f\u30d5\u30a9\u30fc\u30e0\u3067\u30e6\u30fc\u30b6\u30fc\u306e\u30d2\u30f3\u30c8\u3068\u3057\u3066\u4f7f\u7528\u3055\u308c\u307e\u3059
errorTitle=\u30a8\u30e9\u30fc
contractFromDataCreationErrorMessage=\u30c7\u30fc\u30bf\u304b\u3089\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u3092\u751f\u6210\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
contractGenerationTitle=\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u306e\u751f\u6210
contractOperationGenerationMsg=\u5165\u529b\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u304c\u6307\u5b9a\u3055\u308c\u307e\u3057\u305f\u3002\n\n\u5165\u529b\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u306e\u5024\u3067\u30d3\u30b8\u30cd\u30b9\u5909\u6570\u5c5e\u6027\u306e\u5024\u3092\u8a2d\u5b9a\u3059\u308b\u305f\u3081\u306e\u30c7\u30fc\u30bf\u64cd\u4f5c\u304c\u751f\u6210\u3055\u308c\u307e\u3059\u3002\u30c7\u30fc\u30bf\u64cd\u4f5c\u30da\u30a4\u30f3\u3067\u305d\u308c\u3089\u3092\u898b\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002\n\u30c7\u30fc\u30bf\u64cd\u4f5c\u304c\u65e2\u306b\u305d\u308c\u3089\u306e\u5c5e\u6027\u7528\u306b\u751f\u6210\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u3001\u305d\u308c\u3089\u3092\u7f6e\u304d\u63db\u3048\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002\u65b0\u3057\u3044\u30c7\u30fc\u30bf\u64cd\u4f5c\u304c\u4e00\u89a7\u306b\u8ffd\u52a0\u3055\u308c\u307e\u3059\u3002 \n\n\u5165\u529b\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u3068\u30c7\u30fc\u30bf\u64cd\u4f5c\u3092\u624b\u52d5\u3067\u7de8\u96c6\u3059\u308b\u3053\u3068\u306f\u53ef\u80fd\u3067\u3059\u3002\n\u305f\u3060\u3057\u3001\u5165\u529b\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u306e\u5909\u66f4\u306b\u5bfe\u3057\u3066\u306f\u3001\u30ea\u30d5\u30a1\u30af\u30bf\u30ea\u30f3\u30b0\u6a5f\u80fd \uff08\u305f\u3068\u3048\u3070\u3001\u30d3\u30b8\u30cd\u30b9 \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u5185\u306e\u5c5e\u6027\u540d\u3084\u8907\u6570\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u3001\u307e\u305f\u306f\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u8981\u7d20\u306f\u3001\u30c7\u30fc\u30bf\u64cd\u4f5c\u3068\u95a2\u4fc2\u3092\u6301\u305f\u306a\u3044\uff09\u306f\u3042\u308a\u307e\u305b\u3093\u3002
doNotShowMeAgain=\u4eca\u5f8c\u3053\u306e\u30c0\u30a4\u30a2\u30ed\u30b0\u306f\u8868\u793a\u3057\u307e\u305b\u3093\u3002
notAllAttributesGeneratedTitle=\u30d3\u30b8\u30cd\u30b9\u5909\u6570\u306e\u4e0d\u5b8c\u5168\u306a\u521d\u671f\u5316
notAllAttributesGeneratedTaskTitle=\u30d3\u30b8\u30cd\u30b9\u5909\u6570\u306e\u4e0d\u5b8c\u5168\u306a\u66f4\u65b0
notAllAttributesGeneratedMsg=\u9078\u629e\u304c\u89e3\u9664\u3055\u308c\u305f\u306e\u3067\u3001\u30d3\u30b8\u30cd\u30b9\u5909\u6570\u306e\u3044\u304f\u3064\u304b\u306e\u5c5e\u6027\u306f\u305d\u306e\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u8981\u7d20\u3067\u521d\u671f\u5316\u3055\u308c\u307e\u305b\u3093\u3002
notAllAttributesGeneratedTaskMsg=\u9078\u629e\u304c\u89e3\u9664\u3055\u308c\u305f\u305f\u3081\u3001\u30d3\u30b8\u30cd\u30b9\u5909\u6570\u306e\u3044\u304f\u3064\u304b\u306e\u5c5e\u6027\u306f\u305d\u306e\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u8981\u7d20\u3092\u57fa\u306b\u66f4\u65b0\u3055\u308c\u307e\u305b\u3093\u3002
autoGeneratedOperationStepButton=\u30c7\u30fc\u30bf\u64cd\u4f5c\u3092\u81ea\u52d5\u3067\u751f\u6210\u3057\u307e\u3059\u3002
manuallyDefinedOperationStepButton=\u3044\u3044\u3048\u3001\u624b\u52d5\u3067\u5b9a\u7fa9\u3057\u307e\u3059\u3002
autoGeneratedOperationProcessButton=\u521d\u671f\u5316\u30b9\u30af\u30ea\u30d7\u30c8\u3092\u81ea\u52d5\u751f\u6210\u3059\u308b\u306b\u306f\u3001\u30d7\u30ec\u30d3\u30e5\u30fc \u30dc\u30bf\u30f3\u3092\u30af\u30ea\u30c3\u30af\u3057\u305d\u306e\u5185\u5bb9\u3092\u78ba\u8a8d\u3057\u307e\u3059\u3002
manuallyDefinedOperationProcessButton=\u3044\u3044\u3048\u3001\u624b\u52d5\u3067\u5b9a\u7fa9\u3057\u307e\u3059\u3002
contractStrictGenerationMsg=\u5165\u529b\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u3059\u3002\n\u5165\u529b\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u306e\u5024\u3067\u30d3\u30b8\u30cd\u30b9\u5909\u6570\u5c5e\u6027\u306e\u30c7\u30d5\u30a9\u30eb\u30c8\u5024\u3092\u8a2d\u5b9a\u3059\u308b\u305f\u3081\u306e\u30b9\u30af\u30ea\u30d7\u30c8\u304c\u751f\u6210\u3055\u308c\u307e\u3059\u3002[\u30c7\u30fc\u30bf] \u30bf\u30d6\u3067\u305d\u308c\u3089\u3092\u78ba\u8a8d\u3057\u305f\u308a\u3001\u7de8\u96c6\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002\u30d3\u30b8\u30cd\u30b9\u5909\u6570\u306e\u30c7\u30d5\u30a9\u30eb\u30c8\u5024\u304c\u65e2\u306b\u5b58\u5728\u3059\u308b\u5834\u5408\u306f\u3001\u3053\u306e\u30b9\u30af\u30ea\u30d7\u30c8\u306b\u3088\u3063\u3066\u4e0a\u66f8\u304d\u3055\u308c\u307e\u3059\u3002 \n\n\u5165\u529b\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u3068\u305d\u306e\u30b9\u30af\u30ea\u30d7\u30c8\u3092\u624b\u52d5\u3067\u7de8\u96c6\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002\n\u305f\u3060\u3057\u3001\u5165\u529b\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u306e\u5909\u66f4\u306b\u5bfe\u3059\u308b\u30ea\u30d5\u30a1\u30af\u30bf\u30ea\u30f3\u30b0\u6a5f\u80fd \uff08\u305f\u3068\u3048\u3070\u3001\u30d3\u30b8\u30cd\u30b9 \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u5185\u306e\u5c5e\u6027\u540d\u3084\u8907\u6570\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u3001\u307e\u305f\u306f\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u8981\u7d20\u306f\u3001\u30c7\u30fc\u30bf\u64cd\u4f5c\u3068\u95a2\u4fc2\u3092\u6301\u305f\u306a\u3044\uff09\u306f\u3042\u308a\u307e\u305b\u3093\u3002
invalidBusinessDataSelected=\u7121\u52b9\u306a\u30d3\u30b8\u30cd\u30b9 \u30c7\u30fc\u30bf\u304c\u9078\u629e\u3055\u308c\u307e\u3057\u305f\u3002
setGeneratedScriptPreviewPageDescription=\u30c7\u30fc\u30bf {0} \u306e\u30c7\u30d5\u30a9\u30eb\u30c8\u5024\u3092\u521d\u671f\u5316\u3059\u308b\u305f\u3081\u306e\u81ea\u52d5\u751f\u6210\u30b9\u30af\u30ea\u30d7\u30c8\u3092\u30d7\u30ec\u30d3\u30e5\u30fc\u3057\u307e\u3059\u3002\u3053\u306e\u30b9\u30af\u30ea\u30d7\u30c8\u3092\u7de8\u96c6\u3059\u308b\u306b\u306f\u3001\u30c7\u30fc\u30bf\u306e\u5ba3\u8a00\u306b\u79fb\u52d5\u3057\u3066\u305d\u306e\u30c7\u30d5\u30a9\u30eb\u30c8\u5024\u306e\u5b9a\u7fa9\u3092\u7de8\u96c6\u3057\u307e\u3059\u3002
generatedScriptPreviewTitle=\u751f\u6210\u3055\u308c\u305f\u30b9\u30af\u30ea\u30d7\u30c8\u306e\u30d7\u30ec\u30d3\u30e5\u30fc
scriptNameLabel=\u30b9\u30af\u30ea\u30d7\u30c8\u540d
selectAll=\u3059\u3079\u3066\u9078\u629e
deselectAll=\u9078\u629e\u3092\u3059\u3079\u3066\u89e3\u9664
preview=\u30d7\u30ec\u30d3\u30e5\u30fc >
selectMandatories=\u5fc5\u9808\u5c5e\u6027
mandatoryFieldsNotSelectedWarning=\u5fc5\u9808\u5c5e\u6027 {0} \u304c\u9078\u629e\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002\u305d\u308c\u3089\u3092\u9078\u629e\u3059\u308b\u304b\u3001\u307e\u305f\u306f\u305d\u308c\u3089\u3092\u624b\u52d5\u3067\u521d\u671f\u5316\u3057\u307e\u3059\u3002
mandatoryFieldsNotSelectedStepWarning=\u5fc5\u9808\u5c5e\u6027 {0} \u304c\u9078\u629e\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002\u305d\u308c\u3089\u3092\u9078\u629e\u3059\u308b\u304b\u3001\u307e\u305f\u306f\u30b9\u30c8\u30ec\u30fc\u30b8\u3092\u4f5c\u6210\u3057\u30c7\u30fc\u30bf\u64cd\u4f5c\u3092\u66f4\u65b0\u3057\u307e\u3059\u3002
businessVariable=\u30d3\u30b8\u30cd\u30b9\u5909\u6570
document=\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8
defaultValueAlreadyDefinedWarning=\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8 {0} \u306f\u65e2\u306b\u521d\u671f\u5316\u3055\u308c\u3066\u3044\u307e\u3059\u3002\u5165\u529b\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u306e\u5024\u3067 {0} \u306e\u5024\u3092\u4e0a\u66f8\u304d\u3059\u308b\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8\u306e\u5165\u529b\u3092\u4f5c\u6210\u3057\u307e\u3059\u3002
fileInputType=\u30d5\u30a1\u30a4\u30eb\u306e\u5165\u529b\u30bf\u30a4\u30d7
openUpdateDocumentOperationWarningTitle=\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8\u64cd\u4f5c\u306e\u751f\u6210\u3092\u66f4\u65b0
openUpdateDocumentOperationWarningMessages=\u5165\u529b\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u3059\u3002\u5165\u529b\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u306e\u5024\u306b\u57fa\u3044\u3066\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8 {0} \u306e\u5024\u3092\u8a2d\u5b9a\u3059\u308b\u64cd\u4f5c\u304c\u751f\u6210\u3055\u308c\u307e\u3059\u3002\u305d\u306e\u751f\u6210\u7d50\u679c\u306f [\u30c7\u30fc\u30bf\u64cd\u4f5c] \u30da\u30a4\u30f3\u306b\u8868\u793a\u3055\u308c\u307e\u3059\u3002\n\u30c7\u30fc\u30bf\u64cd\u4f5c\u304c\u3053\u306e\u5165\u529b\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u304b\u3089\u65e2\u306b\u751f\u6210\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u306f\u3001\u3053\u306e\u751f\u6210\u7d50\u679c\u306f\u7f6e\u304d\u63db\u3048\u3089\u308c\u307e\u305b\u3093\u3002
updateInitialDocumentContentWarningTitle=\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8\u306e\u521d\u671f\u30b3\u30f3\u30c6\u30f3\u30c4\u3092\u66f4\u65b0
updateInitialDocumentContentWarningMsg=\u5165\u529b\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u3059\u3002\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8\u300c%s\u300d\u306e\u521d\u671f\u30b3\u30f3\u30c6\u30f3\u30c4\u304c\u8a2d\u5b9a\u3055\u308c\u307e\u3059\u3002[\u30c7\u30fc\u30bf] \u30da\u30a4\u30f3\u3067\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8\u3092\u958b\u304f\u3053\u3068\u306b\u3088\u3063\u3066\u8868\u793a\u3067\u304d\u307e\u3059\u3002\u521d\u671f\u30b3\u30f3\u30c6\u30f3\u30c4\u304c\u65e2\u306b\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u306f\u3001\u305d\u308c\u304c\u7f6e\u304d\u63db\u3048\u3089\u308c\u307e\u3059\u3002\n\u5165\u529b\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u306f\u624b\u52d5\u3067\u7de8\u96c6\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002
longConversionWarning=java \u306eLong \u30c7\u30fc\u30bf\u578b\u3068 JavaScript \u306e\u6570\u5024\u578b\u306e\u9593\u306b\u306f\u76f8\u4e92\u904b\u7528\u6027\u306e\u554f\u984c\u304c\u3042\u308a\u307e\u3059\u3002\u30d5\u30a9\u30fc\u30e0\u3092\u4f7f\u7528\u3057\u3066\u30d7\u30ed\u30bb\u30b9\u3092\u958b\u59cb\u3059\u308b\u5834\u5408\u306f\u3001\u5165\u529b\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u306bLong \u30c7\u30fc\u30bf\u578b\u3092\u6301\u3064\u3079\u304d\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002\njava \u306e\u30d7\u30ed\u30af\u30e9\u30e0\u304b\u3089\u81ea\u52d5\u3067\u3001\u3042\u308b\u3044\u306f\u30b3\u30fc\u30eb \u30a2\u30af\u30c6\u30a3\u30d3\u30c6\u30a3\u306b\u3088\u3063\u3066\u30d7\u30ed\u30bb\u30b9\u304c\u958b\u59cb\u3055\u308c\u308b\u30d7\u30ed\u30bb\u30b9\u306b\u306e\u307f\u3001\u5165\u529b\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u306bLong \u30c7\u30fc\u30bf\u578b\u3092\u6301\u3064\u3053\u3068\u304c\u63a8\u5968\u3055\u308c\u307e\u3059\u3002
creatingMappingOperation=%s \u306e\u30de\u30c3\u30d4\u30f3\u30b0\u64cd\u4f5c\u3092\u4f5c\u6210\u4e2d
saving=\u4fdd\u5b58\u4e2d...
taskBdmTips=\u6700\u521d\u306b<a>\u30d3\u30b8\u30cd\u30b9\u5909\u6570</a>\u3001\u304a\u3088\u3073/\u307e\u305f\u306f<a>\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8</a>\u3092\u5b9a\u7fa9\u3057\u3001\u300c\u30c7\u30fc\u30bf\u304b\u3089\u8ffd\u52a0...\u300d\u3092\u30af\u30ea\u30c3\u30af\u3057\u307e\u3059\u3002\n\u5165\u529b\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u304c\u81ea\u52d5\u7684\u306b\u30c7\u30fc\u30bf\u306b\u30de\u30c3\u30d7\u3055\u308c\u308b\u306e\u3067\u3001\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u306e\u5024\u3092\u4f7f\u3063\u3066\u30c7\u30fc\u30bf\u3092\u66f4\u65b0\u3059\u308b\u64cd\u4f5c\u3092\u4f5c\u6210\u3057\u307e\u3059\u3002
poolBdmTips=\u6700\u521d\u306b<a>\u30d3\u30b8\u30cd\u30b9\u5909\u6570</a>\u3001\u304a\u3088\u3073/\u307e\u305f\u306f<a>\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8</a>\u3092\u5b9a\u7fa9\u3057\u3001\u300c\u30c7\u30fc\u30bf\u304b\u3089\u8ffd\u52a0...\u300d\u3092\u30af\u30ea\u30c3\u30af\u3057\u307e\u3059\u3002\n\u5165\u529b\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u304c\u81ea\u52d5\u7684\u306b\u30c7\u30fc\u30bf\u306b\u30de\u30c3\u30d7\u3055\u308c\u308b\u306e\u3067\u3001\u30b3\u30f3\u30c8\u30e9\u30af\u30c8\u306e\u5024\u3092\u4f7f\u3063\u3066\u30c7\u30fc\u30bf\u3092\u521d\u671f\u5316\u3057\u307e\u3059\u3002
creatingNewForm=Creating new form...
createDataFromContractChoice=Create data from contract
editDataFromContractChoice=Edit an existing data using contract and context when generating a Form from the contract
lazyFieldInAMultipleParentRelationHasBeenDeselect=%s.%s has been unselected. Generating an edition form for this field is not supported (lazy reference in a multiple parent).
aChildHasBeenUnselected=A child relation has been unselected.
moreInfoFormGenerationLink=More information about <a>Contract and Form generation</a>.

