processContractSectionDescription=A contract defines the information that a process requires for instantiation.\nAfter you have defined the contract, you can generate the form by clicking the UI Designer icon on the right of this panel. This generates a form with the relevant widgets and data bindings for the process instantiation inputs. You must handle constraints with validation in the form.\nYou can use contract input values as the initial value of variables, documents and search keys or in connectors in (on enter).
stepContractSectionDescription=A contract defines the information that a task requires to execute. If inputs are missing or constraints are not fulfilled on form submission, the task is not executed and stays ready.\nAfter you have defined the contract, you can generate the form by clicking the UI Designer icon on the right of this panel. This generates a form with the relevant widgets and data bindings for the task inputs. You must handle constraints with validation in the form.\nYou can use a contract input value in operations and connectors out (on finish).
name=Name
type=Type
mandatory=Mandatory
multiple=Multiple
add=Add
addChild=Adicionar filho
remove=Remover
savedInto=Salvar na vari\u00e1vel
description=Description
automaticMappingTooltip=Use "Ctrl + espa\u00e7o" para salvar automaticamente esta entrada em uma vari\u00e1vel existente.
constraints=Restri\u00e7\u00f5es
none=None
addConstraint=Add...
editConstraint=Edit...
inputSuffix=Input
duplicatedInputNames=Nome de entrada duplicado\: {0}
duplicatedConstraintNames=Nome da restri\u00e7\u00e3o duplicado\: {0}
taskInputs=Task Inputs
processInstantiationInputs=Process instantiation inputs
inputTabLabel=Inputs
constraintsTabLabel=Constraints
contractInputTypeLabel=Entrada de contrato
removeInputConfirmationMessagePart1=Are you sure you want to remove the following input?
removeInputConfirmationMessagesPart2=\nIf this input is COMPLEX it will remove all children.\nIf this input is a single reference of a constraint, this constraint will be removed.
removeInputConfirmationTitle=Are you sure you want to remove contract input?
removeConstraintConfirmationTitle=Are you sure you want to remove contract constraint(s)?
removeConstraintConfirmationMessage=Are you sure you want to remove following constraint(s)?
returnType=Return type
up=Acima
down=Baixar
expression=Express\u00e3o
technicalErrorMessage=Mensagem de erro t\u00e9cnico
noInputReferencedInConstraintExpression=A restri\u00e7\u00e3o {0} n\u00e3o referencia nenhuma entrada de contrato
unknownInputReferencedInConstraintExpression=A express\u00e3o {1} referencia uma entrada desconhecida "{0}"
constraintEditorDescription=Escreva a restri\u00e7\u00e3o usando um script Groovy.
contentAssistHint=Use "Ctrl + espa\u00e7o" para acionar o auxiliar de conte\u00fado.
addContentToConstraint=Escreva o conte\u00fado da restri\u00e7\u00e3o {0}
editContentToConstraint=Modifique o conte\u00fado da restri\u00e7\u00e3o {0}
emptyExpressionContent=A express\u00e3o n\u00e3o tem nenhum conte\u00fado
noContractInputReferencedInExpression=Nenhuma entrada de contrato \u00e9 referenciada na express\u00e3o
nullable=Pode ser nulo
removeInputErrorTitle=Falha ao excluir
removeInputErrorMsg=Ocorreu um erro ao remover a entrada do contrato.
severalCompilationErrors={0} erros de compila\u00e7\u00e3o encontrados.
SelectBusinessDataWizardPageTitle=Select the data and the action to perform
selectBusinessDataWizardPageDescription=Select the business variable or document which the contract inputs will be created as well as the action to perform.
generate=Adicionar a partir de dados...
contractInputGenerationTitle=Adicionar entrada de contrato 
rootContractInputName=Nome de entrada
selectFieldToGenerateTitle=Selecione {0} atributos a serem adicionados ao contrato
selectFieldToGenerateDescription=Escolha os campos que deseja reutilizar no contrato.
inputOfType=de tipo COMPLEXO
inputType=Tipo de entrada
attributetype=Tipo de Atributo
atLeastOneAttributeShouldBeSelectedError=Selecione pelo menos um atributo.
attributeName = Nome do atributo
warningAddFromData_noDataAvailable=Please create first a business variable from Data view or a document from Document view.
warningAddFromData_noDataSelected=Por favor, selecione uma vari\u00e1vel de neg\u00f3cio na lista.
reminderForStepMessage=From the contract definition, the Studio can automatically generate operations to store or update business variables.\nYou can then modify these operations if necessary.
reminderForProcessMessage=From the contract definition, the Studio can automatically generate scripts to initialize business variables.
contractInputDescriptionTooltip=Usado nos formul\u00e1rios gerados automaticamente como dica ao usu\u00e1rio
errorTitle=Error
contractFromDataCreationErrorMessage=An error occurred while generating the contract from a data.
contractGenerationTitle=Contract generation
contractOperationGenerationMsg=As entradas do contrato foram especificadas.\n\nOpera\u00e7\u00f5es para definir os valores dos atributos com os dados de entradas do contrato ser\u00e3o geradas e exibidas no painel de opera\u00e7\u00f5es.\nEles n\u00e3o substituir\u00e3o opera\u00e7\u00f5es existentes para estes atributos, se houver. Elas ser\u00e3o adicionadas \u00e0 lista.\n\nTamb\u00e9m n\u00e3o h\u00e1 refatora\u00e7\u00e3o\: atualizar o nome do atributo ou uma propriedade m\u00faltipla em um objeto de neg\u00f3cio ou entrada de contrato ir\u00e1 quebrar a opera\u00e7\u00e3o.
doNotShowMeAgain=Do not show me this dialog again
notAllAttributesGeneratedTitle=Incomplete initialization of the business variable
notAllAttributesGeneratedTaskTitle=Incomplete update of the business variable
notAllAttributesGeneratedMsg=Some attributes of the business variable will not be initialized from the contract elements as they have been deselected.
notAllAttributesGeneratedTaskMsg=Some attributes of the business variable will not be updated from the contract elements as they have been deselected.
autoGeneratedOperationStepButton=Auto-generate storage operations
manuallyDefinedOperationStepButton=No, thanks. I'll manually define how to use the contract.
autoGeneratedOperationProcessButton=Auto-generate the initialization script.Click on preview button to check its content.
manuallyDefinedOperationProcessButton=No, thanks. I'll manually define how to use the contract.
contractStrictGenerationMsg=As entradas de contrato foram especificadas.\nUm script que define os valores padr\u00e3o dos atributos da vari\u00e1vel de neg\u00f3cio com os valores de entrada de contrato ser\u00e3o gerados. Ele pode ser visto e editado na aba de Dados. Se o valor padr\u00e3o de uma vari\u00e1vel de neg\u00f3cio j\u00e1 existe, este script ir\u00e1 sobrescrev\u00ea-lo.\n\nTamb\u00e9m n\u00e3o h\u00e1 refatora\u00e7\u00e3o\: atualizar o nome do atributo ou uma propriedade m\u00faltipla em um objeto de neg\u00f3cio ou entrada de contrato ir\u00e1 quebrar a express\u00e3o de valor padr\u00e3o.
invalidBusinessDataSelected=Invalid business data selected.
setGeneratedScriptPreviewPageDescription=Preview of the generated script that initializes the default value of the data {0}. To edit this script, go to the Data declaration and edit the default value definition.
generatedScriptPreviewTitle=Generated script preview
scriptNameLabel=Script name
selectAll=Select all
deselectAll=Desmarcar todos
preview=Preview >
selectMandatories=Mandatory attributes
mandatoryFieldsNotSelectedWarning=Mandatory attribute(s) {0} is/are not selected. Either select it/them or initialize it/them manually.
mandatoryFieldsNotSelectedStepWarning=Mandatory attribute(s) {0} is/are not selected. Either select it/them or create storage and update operations.
businessVariable=Business variable
document=Document
defaultValueAlreadyDefinedWarning=The document {0} is already initialized. Create input from this document will overwrite the current value of {0} by the value of contract input.
fileInputType=of type FILE
openUpdateDocumentOperationWarningTitle=Update document operation generation
openUpdateDocumentOperationWarningMessages=A entrada do contrato foi especificada.\nEle ir\u00e1 definir o conte\u00fado do documento `%s` ou substitu\u00ed-lo se j\u00e1 existe.\nPara visualizar o conte\u00fado, v\u00e1 para o painel de opera\u00e7\u00e3o.\nA entrada do contrato pode ser editada manualmente.
updateInitialDocumentContentWarningTitle=Update document initial content
updateInitialDocumentContentWarningMsg=A entrada do contrato foi especificada.\nEle ir\u00e1 definir o conte\u00fado inicial do documento `%s.\nPara visualizar o conte\u00fado, v\u00e1 para o painel de dados e abra o documento.\nA entrada do contrato pode ser editada manualmente.
longConversionWarning=Due to inter-operability issue between Java Long type and numeric JavaScript type you should not have Long contract input if you plan to start your process using a form.\nLong in contract is recommended for processes started by call activities or programmatically in Java.
creatingMappingOperation=Criando opera\u00e7\u00e3o de mapeamento para %s
saving=Salvando...
taskBdmTips=Voc\u00ea pode definir primeiro as <a>vari\u00e1veis de neg\u00f3cio <a> e/ou <a>documentos</a>, e ent\u00e3o clique em "Adicionar a dados...".\nEle ir\u00e1 automaticamente mapear entradas de contrato para dados e criar opera\u00e7\u00f5es para atualizar dados com valores de contrato.
poolBdmTips=Voc\u00ea pode definir as <a>vari\u00e1veis de neg\u00f3cio</a> e/ou <a>documentos</a>, e ent\u00e3o clique em "Adicionar a dados...".\nEle ir\u00e1 automaticamente mapear entradas de contrato para dados e inicializar dados com valores de contrato.
creatingNewForm=Criando novo formul\u00e1rio...
createDataFromContractChoice=Instantiate
editDataFromContractChoice=Edit
lazyFieldInAMultipleParentRelationHasBeenDeselect=Gerar um formul\u00e1rio para editar esta vari\u00e1vel n\u00e3o \u00e9 suportado (refer\u00eancia pregui\u00e7osa em um pai m\u00faltiplo).\nLeia a documenta\u00e7\u00e3o apontada abaixo. Se necess\u00e1rio, verifique a caixa para implementar a edi\u00e7\u00e3o manualmente no formul\u00e1rio gerado.
aChildHasBeenUnselected=Uma rela\u00e7\u00e3o filho foi n\u00e3o desmarcada.
moreInfoFormGenerationLink=Mais informa\u00e7\u00f5es sobre <a>Contrato e gera\u00e7\u00e3o de formul\u00e1rio</a>.
contractInputEqualToBusinessDataError=O nome de entrada do contrato deve ser diferente do nome dos dados de neg\u00f3cio associados
createReadOnlWidgetsTitle=Criar widgets somente leitura
createReadOnlWidgetsMessage=O formul\u00e1rio gerado exibir\u00e1 widgets para todas as entradas de contrato que ser\u00e3o preenchidas.\nPode exibir widgets para todos os atributos, relacionados com as entradas de contrato, que precisam ser exibidos como somente leitura.\nVoc\u00ea precisa de widgets somente leitura relacionados com as entradas de contrato no formul\u00e1rio?
contractInputEqualToDocumentError=Nome de entrada do contrato deve ser diferente do nome do documento associado
createReadOnlWidgetsdetails=Para saber mais, leia documenta\u00e7\u00e3o em <a>Gera\u00e7\u00e3o Formul\u00e1rio</a>.
data=Data
action=Action
createActionHint=The variable will be instantiated with the contract input value.
editActionHint=The existing values for the variable will be retrieved from the context, and edited with the contract inputs.