#X-Generator: crowdin.com
callActivityTargetNameMigrationDescription=Destinazione della call activity e' diventato un'espressione
callActivityTargetVersionMigrationDescription=La versione del target della call activity \u00e8 stata migrata ad un'espressione.
callActivityTargetNameProperty=Nome sottoprocesso
callActivityTargetVersionProperty=versione del sub-processo
dataProperty=Dati
document=Documento
documentProperty=Documenti
documentCreationDescription=Un documento \u00e8 stato creato da dati in allegato. Dati allegati non esistono pi\u00f9.
dataDefaultValueMigrationDescription=Il valore predefinito di questo dato \u00e8 stato convertito in un'espressione.
dataDefaultValueProperty=Valore dei dati prederiniti
dataDefaultValueWithOtherDataDependencyMigrationDescription=Un valore predefinito del dato dipendente da altri dati dallo stesso contenitore non \u00e8 supportato.
sequenceFlowConditionMigrationDescription=La condizione di questo flusso di sequenza \u00e8 stata convertita in un'espressione.
sequenceFlowConditionProperty=Condizione di flusso sequenza
removeDeadlinesMigrationDescription=Questa deadline \u00e8 stata rimossa dal modello. Questo concetto non \u00e8 pi\u00f9 sopportato. Aggiorna il progetto per recuperare una semantica valida.
connectorProperty=Connettori
loopMaximumScriptMigrationDescription=Lo script del numero massimo di cicli \u00e8 stato convertito in un'espressione.
loopConditionScriptMigrationDescription=Lo script di condizione del ciclo \u00e8 stato convertito in un'espressione.
iterationProperty=Iterazione
dynamicLabelMigrationDescription=Visualizza il nome dello script che \u00e8 stato convertito in un'espressione.
portalProperty=Portale
dynamicDescriptionMigrationDescription=Lo script di visualizzazione della descrizione \u00e8 stato convertito in un'espressione.
stepSummaryMigrationDescription=La descrizione dopo lo script di completamento \u00e8 stata convertita in un'espressione.
removeConnectorMigrationDescription=Connettore \u00e8 stato rimosso.
removeCustomConnectorMigrationDescription=Il connettore \u00e8 stato rimosso perch\u00e9 nessuna definizione del connettore corrispondente \u00e8 stata trovata. Nel caso in cui si tratti di un connettore personalizzato, verificare che esso sia stato esportato nel file bar.
removeGroupMigrationDescription=Questo selettore di attore \u00e8 stato rimosso.
actorProperty=Attori
actorSelector=Selettore di attore
redirectionUrlMigrationDescription=Script dell'url di reindirizzamento \u00e8 stato convertito in un'espressione.
entryPageflowProperty=flusso della pagina
confirmationProperty=Conferma
confirmationMessageMigrationDescription=Script del messaggio di conferma \u00e8 stato convertito in un'espressione.
redirectionActionMigrationDescription=Un'azione di redirezione \u00e8 stata convertita in un'operazione.
viewPageflowProperty=Storia del flusso di pagina
recapPageflowProperty=Riassunto del flusso di pagina
pageFlowTransitionMigrationDescription=Lo script di transizione del flusso di pagina \u00e8 stato convertito in un'espressione.
messageContentMigrationDescription=Il contenuto del messaggio \u00e8 stato convertito in espressioni.
messagesProperty=Messaggi
targetProcessNameMigrationDescription=Nome del processo di destinazione \u00e8 stato convertito in un'espressione.
targetElementNameMigrationDescription=Nome dell'elemento di destinazione \u00e8 stato convertito in un'espressione.
correlationMigrationDescription=Valori e chiavi di correlazione sono state convertite in espressioni.
correlationProperty=Correlazione
timerConditionProperty=Condizioni del timer
timerConditionMigrationDescription=Condizione di timer \u00e8 stato convertito in un'espressione.
removeFilterMigrationDescription=Il filtro \u00e8 stato rimosso.
formActionsMigrationDescription=Le azioni del modulo sono state convertite in operazioni.
actionProperty=azioni
widgetActionsMigrationDescription=L'operazione di output del widget \u00e8 stata convertita in operazioni.
widgetModifierMigrationDescription=Il modificatore del tipo di ritorno del widget \u00e8 stato impostato.
widgetDataInputAtProcessLevelMigrationDescription=Widget input ha utilizzato una variabile per inizializzare il suo valore predefinito. Tuttavia la variabile non \u00e8 pi\u00f9 accessibile sul modulo istanziato.
widgetDataInputMigrationDescription=Il widget di input \u00e8 stato convertito in un'espressione.
generalProperty=Generale
userAidsProperty=Aiuti per l'utente
tooltipMigrationDescription=Tooltip \u00e8 stato convertito in un'espressione.
helpMessageMigrationDescription=Messaggio di aiuto \u00e8 stata convertito in un'espressione.
displayAfterEventConditionMigrationDescription=La condizione 'Mostra quando viene modificato un campo contingente' \u00e8 stata convertita in un'espressione.
contingencyProperty=contingenze
showImmediatelyConditionMigrationDescription=La condizione 'Mostra immediatamente' \u00e8 stata convertita in un'espressione.
optionsProperty=Opzioni
updateSelectedValueMigrationDescription=Il valore selezionato dopo lo script di aggiornamento della contingenza \u00e8 stato convertito in un'espressione.
updateAvailableValueMigrationDescription=Il valore disponibile dopo lo script di aggiornamento della contingenza \u00e8 stato convertito in un'espressione.
updateValueMigrationDescription=Lo script di aggiornamento del valore dalle contingenze \u00e8 stato convertito in un'espressione.
displayLabelMigrationDescription=Etichetta \u00e8 stata convertita in un'espressione.
exampleMigrationDescription=Script di esempio \u00e8 stato convertito in un'espressione.
initialValueMigrationDescription=Valore iniziale \u00e8 stato convertito in un'espressione.
buttonActionsMigrationDescription=Le azioni dei pulsanti di Submit sono stati convertiti in operazioni.
validatorParameterMigrationDescription=Il parametro del validatore \u00e8 stato convertito in un'espressione.
validatorsProperty=Validatori
appearanceProperty=Aspetto
maxNumberMigrationDescription=Numero max di duplicazione \u00e8 stata convertita in un'espressione.
minNumberMigrationDescription=Numero minimo di duplicazione \u00e8 stato convertito in un'espressione.
displayLabelForAddMigrationDescription=Etichetta 'Aggiungi' \u00e8 stata convertita in espressione.
displayLabelForRemoveMigrationDescription=Etichetta 'Rimuovi' \u00e8 stata convertita in espressione.
tooltipForAddMigrationDescription=Etichetta 'Aggiungi' \u00e8 stata convertita in espressione.
tooltipForRemoveMigrationDescription=Etichetta 'Rimuovi' \u00e8 stata convertita in espressione.
imgPathMigrationDescription=Percorso immagine \u00e8 stato convertito in espressione.
validatorDisplayNameMigrationDescription=Il messaggio di errore del validatore \u00e8 stato convertito in espressione.
changeGatewayTypeToInclusiveGatewayMigrationDescription=Gateway parallelo sostituito da un Gateway Inclusivo per adattarsi alle regole BPMN2.
changeInclusiveGatewayMigrationDescription=Modifica Gateway Inclusive
changeParallelGatewayWithIncomingConditionsMigrationDescription=Gateway parallelo con in ingresso condizioni di SequenceFlow modificate.
changeParallelGatewayWithOutgoingConditionsMigrationDescription=Gateway parallelo con in uscita condizioni di SequenceFlow modificate.
mandatoryLabelMigrationDescription=Etichetta di obbligatorio \u00e8 stato convertita in un'espressione.
mandatorySymbolMigrationDescription=Simbolo obbligatorio \u00e8 stato convertito in un'espressione.
verticalHeaderMigrationDescription=Script di intestazione verticale \u00e8 stato convertito in un'espressione.
horizontalHeaderMigrationDescription=Script di intestazione orizzontale \u00e8 stato convertito in un'espressione.
cellExpressionMigrationDescription=Contenuto della tabella \u00e8 stato convertito in un'espressione.
kpiBinding=Collegamento a KPI
bamProperty=BAM
removeKpiMigrationDescription=La migrazione dell'associazione KPI non supportata ed \u00e8 stato eliminata.
maxRowForPaginationMigrationDescription=Il numero massimo di righe per pagina \u00e8 stato convertito in un'espressione.
columnForInitialIndexMigrationDescription=La colonna per l'indice iniziale \u00e8 stata convertita in un'espressione.
selectedValuesMigrationDescription=I valori selezionati sono stati convertiti in un'espressione.
minNumberOfColumnMigrationDescription=Numero min. di colonne \u00e8 stato convertito in espressione.
maxNumberOfColumnMigrationDescription=Numero max. di colonne \u00e8 stato convertito in espressione.
maxNumberOfRowMigrationDescription=Numero max. di righe \u00e8 stato convertito in espressione.
minNumberOfRowMigrationDescription=Numero min. di righe \u00e8 stato convertito in espressione.
simDataExpressionMigrationDescription=I dati di simulazione sono stati convertiti in espressione.
simDataChangeValueMigrationDescription=L'aggiornamento dati di simulazione \u00e8 stato convertito in espressione.
migrationReportOf=Importa rapporto per {0}
removeMultiInstantiationMigrationDescription=Rimuovi Multi-istanza
deadlinesToNonInterruptingEventMigrationDescription=Questa deadline \u00e8 stata sostituita da un altro tipo di elemento. Questo concetto \u00e8 ora associato con un evento boundary timer non interrompente. Il connettore collegato alla deadline precedente \u00e8 stato rimosso.
removeMessageEventFromSendTaskDescription=Evento message\: {0} \u00e8 stato rimosso da questo task di invio per essere compatibile con la notazione BPMN. Un solo evento message  \u00e8 supportato da task di tipo send.
attachementDataRemovedFromMessage=I dati in allegato {0} sono stati rimossi dal contenuto del messaggio.
invalidArchiveStructure=Il file BAR {0} non ha una struttura corretta. Manca il file .proc. Puoi provare a importare un  6.x.bar, anche se solo 5.9+ \u00e8 supportato.
startTimerCycleMigration=Il formato della condizione del timer per il ciclo di condizione \u00e8 stato migrato in un'espressione cron. Se si sta utilizzando una condizione di ciclo con una data, questa non sar\u00e0 pi\u00f9 supportata.
timerCondition=Condizioni del timer
connectorMigrationDescription=Il connettore \u00e8 stato migrato. Si prega di controllare la coerenza dei parametri di input e di output. 
development=Sviluppo
customConnectorMigrationDescription=Questo connettore personalizzato \u00e8 stato migrato in una definizione di connettore ed in una implementazione di connettore. L'implementazione del connettore deve essere riesaminata al fine di garantirne il corretto funzionamento.
customConnector=Connettore personalizzato
connectorMigrationSetVarConnectorOnEnterOrOnStartDescription=Il connettore imposta variabile, "{0}", \u00e8 stato convertito in uno o pi\u00f9 step di operazione. Si informa che sebbene il connettore fosse impostato su Enter o su Start, le operazioni saranno eseguite alla fine dello step. Nota che per i task umani, saranno eseguiti dopo la sottomissione del form. Se ci\u00f2 non coincide con il comportamento voluto, si prega di muovere queste operazioni sullo step precedente.
connectorMigrationSetVarConnectorOnFinishDescription=Il connettore imposta variabile "{0}" \u00e8 stato convertito in uno o pi\u00f9 step operazione.
connectorMigrationFinishTaskDescription=In v6, il ciclo di vita dell'attivit\u00e0 \u00e8 cambiato e l'azione di fine task non \u00e8 pi\u00f9 presente.
connectorMigrationStartInstanceDescription=Si prega di utilizzare un segnale o un messaggio per avviare un'istanza di processo.
connectorMigrationUseScriptAndApiDescription=\u00c8 necessario utilizzare uno script Groovy. \u00c8 possibile utilizzare direttamente l'API o riutilizzare i metodi forniti dalla categoria Bonita.
customConnectorMigrationFailureDescription=Questo connettore personalizzato non \u00e8 stato migrato. Mancano alcune dipendenze nel file bar originale\:\n{0}
unsupportedVersionMessage=La versione del codice sorgente del tuo processo \u00e8 {0}. La migrazione \u00e8 supportata per le versioni di {1}.
descripitonProperty=Descrizione
tooLongDescriptionHasBeenTruncated=La descrizione di questo elemento \u00e8 stata troncata perch\u00e9 superiore al numero massimo di caratteri consentiti
warningImageFormat=Formato dell'immagine non valido
warningImageFormatMessage={0} non \u00e8 stato importato perch\u00e9 non \u00e8 nel formato corretto. Si prega di usare uno tra i seguenti formati supportati\: .gif;.jpg;.jpeg;.png;*.bmp.
migratingCustomConnector=Migrazione connettore personalizzato {0}...
groovyForNameWarningDescription=Una riflessione Groovy \u00e8 stata rilevata nello script. La gestione del classpath \u00e8 cambiata e si dovrebbe considerare di cambiare lo script o aggiungere le librerie nel classpath condiviso
groovyForNameWarningPropertyName=Contenuto dello script
widgetDataInputTooManyConnectorMigrationDescription=Pi\u00f9 di un connettore \u00e8 stato utilizzato come input di widget. Solo il primo elemento \u00e8 stato migrato.
widgetContigencyConnectorMigrationDescription=Pi\u00f9 di un connettore \u00e8 stato utilizzato in delle contingenze. Solo il primo elemento \u00e8 stato migrato.
