#X-Generator: crowdin.com
contractSectionDescription=Defina um contrato para esta etapa ou para a instancia\u00e7\u00e3o deste processo.
processContractSectionDescription=A contract defines the information that a process requires for instantiation.\nAfter you have defined the contract, you can generate the form by clicking the UI Designer icon on the right of this panel. This generates a form with the relevant widgets and data bindings for the process instantiation inputs. You must handle constraints with validation in the form.\nYou can use contract input values as the initial value of variables, documents and search keys or in connectors in (on enter).
stepContractSectionDescription=A contract defines the information that a task requires to execute. If inputs are missing or constraints are not fulfilled on form submission, the task is not executed and stays ready.\nAfter you have defined the contract, you can generate the form by clicking the UI Designer icon on the right of this panel. This generates a form with the relevant widgets and data bindings for the task inputs. You must handle constraints with validation in the form.\nYou can use a contract input value in operations and connectors out (on finish).
name=Nome
type=Tipo
mandatory=Obrigat\u00f3rio
multiple=M\u00faltiplo
add=Adicionar
addChild=Adicionar filho
remove=Remover
savedInto=Salvar na vari\u00e1vel
description=Descri\u00e7\u00e3o
automaticMappingTooltip=Use "Ctrl + espa\u00e7o" para salvar automaticamente esta entrada em uma vari\u00e1vel existente.
constraints=Restri\u00e7\u00f5es
none=Nenhum
addConstraint=Adicionar...
editConstraint=Editar...
inputSuffix=Entrada
duplicatedInputNames=Nome de entrada duplicado\: {0}
duplicatedConstraintNames=Nome de restri\u00e7\u00e3o duplicado\: {0}
taskInputs=Entradas de tarefa
processInstantiationInputs=Entradas de instancia\u00e7\u00e3o de processo
inputTabLabel=Entradas
constraintsTabLabel=Restri\u00e7\u00f5es
contractInputTypeLabel=Entrada de contrato
removeInputConfirmationMessage=Tem certeza que deseja remover a seguinte entrada? \nSe esta entrada for de tipo complexo, todas as entradas filhas tamb\u00e9m ser\u00e3o removidas. \nSe esta entrada for uma refer\u00eancia de uma restri\u00e7\u00e3o, a restri\u00e7\u00e3o ser\u00e1 removida.
removeInputConfirmationTitle=Tem certeza que deseja remover a entrada do contrato?
removeConstraintConfirmationTitle=Tem certeza que deseja remover a(s) restri\u00e7\u00e3o(\u00f5es) do contrato?
removeConstraintConfirmationMessage=Tem certeza que deseja remover as restri\u00e7\u00f5es a seguir?
returnType=Tipo de retorno
up=Acima
down=\ Abaixo
expression=Express\u00e3o
errorMessage=Mensagem de erro
noInputReferencedInConstraintExpression=A restri\u00e7\u00e3o {0} n\u00e3o referencia nenhuma entrada
unknownInputReferencedInConstraintExpression=A express\u00e3o {1} referencia uma entrada desconhecida "{0}"
constraintEditorDescription=Escreva a restri\u00e7\u00e3o usando um script Groovy.
contentAssistHint=Use "Ctrl + espa\u00e7o" para acionar o auxiliar de conte\u00fado.
addContentToConstraint=Adicionar o conte\u00fado da restri\u00e7\u00e3o {0}
editContentToConstraint=Modificar o conte\u00fado da restri\u00e7\u00e3o {0}
emptyExpressionContent=A express\u00e3o est\u00e1 vazia
noContractInputReferencedInExpression=Nenhuma entrada de contrato \u00e9 referenciada na express\u00e3o
nullable=Pode ser nulo
removeInputErrorTitle=Falha ao excluir
removeInputErrorMsg=Ocorreu um erro ao remover a entrada do contrato.
severalCompilationErrors={0} erros de compila\u00e7\u00e3o encontrados.
SelectBusinessDataWizardPageTitle=Selecionar os dados de neg\u00f3cio
selectBusinessDataWizardPageDescription=Selecione a vari\u00e1vel de neg\u00f3cio a partir da qual a entrada do contrato ser\u00e1 gerada.
generate=Adicionar a partir de dados...
contractInputGenerationTitle=Adicionar entrada de contrato 
rootContractInputName=Nome da entrada
selectFieldToGenerateTitle=Selecione {0} atributos a serem adicionados ao contrato
selectFieldToGenerateDescription=Escolha os campos que deseja reutilizar no contrato.
inputOfType=de tipo COMPLEXO
inputType=Tipo de entrada
attributetype=Tipo de Atributo
atLeastOneAttributeShouldBeSelectedError=Selecione pelo menos um atributo.
attributeName=Nome do atributo
warningAddFromData_noDataAvailable=\u00c9 necess\u00e1rio criar primeiro uma vari\u00e1vel de neg\u00f3cio a partir da aba de Dados.
warningAddFromData_noDataSelected=Por favor, selecione uma vari\u00e1vel de neg\u00f3cio na lista.
reminderForStepMessage=Os elementos do contrato e as opera\u00e7\u00f5es de mapeamento ser\u00e3o geradas automaticamente e poder\u00e3o ser editados manualmente. \nOpera\u00e7\u00f5es de estocagem para atualizar as vari\u00e1veis de neg\u00f3cios tamb\u00e9m podem ser geradas. \nSelecione a op\u00e7\u00e3o que se adapta \u00e0s suas necessidades\:
reminderForProcessMessage=Os elementos do contrato ser\u00e3o gerados automaticamente e poder\u00e3o ser editados manualmente. \nO script groovy para inicializar vari\u00e1veis de neg\u00f3cios tamb\u00e9m pode ser gerado. \nSelecione a op\u00e7\u00e3o que se adapta melhor \u00e0s suas necessidades\:
contractInputDescriptionTooltip=Usado nos formul\u00e1rios gerados automaticamente como dica ao usu\u00e1rio
errorTitle=Erro
contractFromDataCreationErrorMessage=Ocorreu um erro ao gerar o contrato a partir dos dados.
contractGenerationTitle=Gera\u00e7\u00e3o de contrato
contractOperationGenerationMsg=As entradas de contrato foram especificadas. \n\nAs opera\u00e7\u00f5es para definir os valores dos atributos de vari\u00e1veis de neg\u00f3cios a partir dos valores de entradas de contrato ser\u00e3o geradas. Elas podem ser visualizados no painel de opera\u00e7\u00f5es. \nCaso as opera\u00e7\u00f5es para tais atributos j\u00e1 tenham sido geradas anteriormente, elas n\u00e3o ser\u00e3o substitu\u00eddas. As novas opera\u00e7\u00f5es ser\u00e3o adicionadas \u00e0 lista. \n\nAs entradas de contrato e as opera\u00e7\u00f5es podem ser editadas manualmente. \nNo entanto, nenhuma refatora\u00e7\u00e3o ser\u00e1 executada (por exemplo, a atualiza\u00e7\u00e3o do nome do atributo ou da propriedade M\u00faltiplo no objeto de neg\u00f3cio ou em um elemento do contrato vai tornar a opera\u00e7\u00e3o inv\u00e1lida).
doNotShowMeAgain=N\u00e3o mostrar este di\u00e1logo novamente
notAllAttributesGeneratedTitle=incomplete initialization of the business variable
notAllAttributesGeneratedMsg=Some attributes of the business variable will not be initialized from the contract elements as they have been deselected.
autoGeneratedOperationStepButton=Auto-generate storage operations
manuallyDefinedOperationStepButton=No, thanks. I'll manually define how to use the contract.
autoGeneratedOperationProcessButton=Auto-generate the initialization script
manuallyDefinedOperationProcessButton=No, thanks. I'll manually define how to use the contract.
contractStrictGenerationMsg=As entradas de contrato foram definidas. \n\nUm script que define os valores padr\u00f5es dos atributos das vari\u00e1veis neg\u00f3cios a partir dos valores das entrada de contrato ser\u00e1 gerado. Ele pode ser visualizado e editado na guia de dados. Caso o valor padr\u00e3o de uma vari\u00e1vel de neg\u00f3cio j\u00e1 exista, este script ir\u00e1 substitu\u00ed-lo. \n\nAs entradas de contrato e o script podem ser editados manualmente. \nNo entanto, nenhuma refatora\u00e7\u00e3o ser\u00e1 executada (por exemplo, a atualiza\u00e7\u00e3o do nome do atributo ou da propriedade M\u00faltiplo no objeto de neg\u00f3cio ou em um elemento do contrato vai tornar o script inv\u00e1lido).
invalidBusinessDataSelected=Invalid business data selected.
setGeneratedScriptPreviewPageDescription=Preview of the generated script that initializes the default value of the data {0}. 
generatedScriptPreviewTitle=Generated script preview
scriptNameLabel=Script name
selectAll=Selecionar todos
deselectAll=Desmarcar todos
preview=Preview >

