#X-Generator: crowdin.com
callActivityTargetNameMigrationDescription=Nombre de destino la actividad llamada emigraron a una expresi\u00f3n.
callActivityTargetVersionMigrationDescription=Llame la versi\u00f3n de la actividad de destino migrando a una expresi\u00f3n.
callActivityTargetNameProperty=Nombre del subproceso
callActivityTargetVersionProperty=Versi\u00f3n de Subproceso
dataProperty=Datos
document=Documento
documentProperty=Documentos
documentCreationDescription=Un documento que ha sido creado a partir de datos adjuntos. Los datos adjuntos ya no existe.
dataDefaultValueMigrationDescription=El valor predeterminado de estos datos se ha convertido en una expresi\u00f3n.
dataDefaultValueProperty=Valor predeterminado
dataDefaultValueWithOtherDataDependencyMigrationDescription=El valor por defecto de datos dependiendo de otra los datos del mismo envase no es compatible.
sequenceFlowConditionMigrationDescription=La condici\u00f3n de esta secuencia de flujo ha sido convertida en una expresi\u00f3n.
sequenceFlowConditionProperty=Estado de flujo de secuencia
removeDeadlinesMigrationDescription=Esta fecha l\u00edmite ha sido removida del modelo. Este concepto ya no es m\u00e1s soportado actualize su dise\u00f1o para recuperar una sem\u00e1ntica v\u00e1lida.
connectorProperty=Conectores
loopMaximumScriptMigrationDescription=El script de bucle m\u00e1xima se ha convertido a una expresi\u00f3n.
loopConditionScriptMigrationDescription=La condici\u00f3n secuencia en bucle se ha convertido a una expresi\u00f3n.
iterationProperty=Iteraci\u00f3n
dynamicLabelMigrationDescription=Pantalla script de nombre se ha convertido a una expresi\u00f3n.
portalProperty=Portal
dynamicDescriptionMigrationDescription=visualizaci\u00f3n de descripci\u00f3n  escritura se ha convertido en una expresi\u00f3n.
stepSummaryMigrationDescription=Descripci\u00f3n despu\u00e9s de la escritura de finalizaci\u00f3n se ha convertido en una expresi\u00f3n.
removeConnectorMigrationDescription=Conector se ha eliminado.
removeCustomConnectorMigrationDescription=El conector ha sido eliminado porque no se ha encontrado ninguna definici\u00f3n de conector correspondiente. Si es un Conector Personalizado, compruebe que se ha exportado en el fichero .bar.
removeGroupMigrationDescription=Este  actor seleccionado ha sido eliminado.
actorProperty=Actores
actorSelector=Selector de Actor
redirectionUrlMigrationDescription=El script de la URL de redirecci\u00f3n ha sido convertido en una expresi\u00f3n.
entryPageflowProperty=Formulario Web
confirmationProperty=Confirmaci\u00f3n
confirmationMessageMigrationDescription=Escritura del mensaje de confirmaci\u00f3n se ha convertido en una expresi\u00f3n.
redirectionActionMigrationDescription=Una acci\u00f3n de redirecci\u00f3n se ha convertido en una operaci\u00f3n.
viewPageflowProperty=Pageflow de Consulta
recapPageflowProperty=Cr\u00f3nica pageflow
pageFlowTransitionMigrationDescription=Script de transici\u00f3n pageflow se ha convertido a una expresi\u00f3n.
messageContentMigrationDescription=Contenido de los mensajes se ha convertido en expresiones.
messagesProperty=Mensajes
targetProcessNameMigrationDescription=Nombre del proceso de destino se ha convertido en una expresi\u00f3n.
targetElementNameMigrationDescription=Nombre del elemento objetivo se ha convertido a una expresi\u00f3n.
correlationMigrationDescription=Claves y valores de correlaci\u00f3n se han convertido a expresiones.
correlationProperty=Correlaci\u00f3n
timerConditionProperty=Condici\u00f3n de temporizador
timerConditionMigrationDescription=La condici\u00f3n del temporizador ha sido convertido a una expresi\u00f3n.
removeFilterMigrationDescription=Este filtro ha sido eliminado.
formActionsMigrationDescription=Acciones del formulario se ha convertido en operaciones.
actionProperty=acciones
widgetActionsMigrationDescription=Operaci\u00f3n de salida de widget ha sido transformado en operaciones.
widgetModifierMigrationDescription=Se ha establecido Widget modificador return type.
widgetDataInputAtProcessLevelMigrationDescription=Widget de entrada estaba utilizando una variable para iniciar su valor predeterminado. Sin embargo variables no son accesibles en forma de instancias.
widgetDataInputMigrationDescription=Widget de entrada se ha convertido en una expresi\u00f3n.
generalProperty=General
userAidsProperty=Ayudas del usuario
tooltipMigrationDescription=Tooltip se ha convertido en una expresi\u00f3n.
helpMessageMigrationDescription=Mensaje de la ayuda se ha convertido en una expresi\u00f3n.
displayAfterEventConditionMigrationDescription='Mostrar cuando un campo contingente ha cambiado' condici\u00f3n se ha convertido en una expresi\u00f3n.
contingencyProperty=Dependencias
showImmediatelyConditionMigrationDescription='Mostrar inmediatamente' condici\u00f3n se ha convertido a una expresi\u00f3n.
optionsProperty=Opciones
updateSelectedValueMigrationDescription=El valor seleccionado despu\u00e9s de script de actualizaci\u00f3n de contingencias se ha convertido en una expresi\u00f3n.
updateAvailableValueMigrationDescription=El valor seleccionado despu\u00e9s de script de actualizaci\u00f3n de contingencias se ha convertido en una expresi\u00f3n.
updateValueMigrationDescription=Secuencia de actualizaci\u00f3n de valor de contingencias se ha convertido a una expresi\u00f3n.
displayLabelMigrationDescription=Etiqueta a visualizar se ha convertido a una expresi\u00f3n.
exampleMigrationDescription=Ejemplo de secuencia de comandos se ha convertido a una expresi\u00f3n.
initialValueMigrationDescription=Valor inicial se ha convertido en una expresi\u00f3n.
buttonActionsMigrationDescription=Enviar acciones de los botones se han convertido en operaciones.
validatorParameterMigrationDescription=Par\u00e1metro de validaci\u00f3n se ha convertido en una expresi\u00f3n.
validatorsProperty=Validadores
appearanceProperty=Apariencia
maxNumberMigrationDescription=Min n\u00famero de duplicaci\u00f3n se ha convertido en una expresi\u00f3n.
minNumberMigrationDescription=Min n\u00famero de duplicaci\u00f3n se ha convertido en una expresi\u00f3n.
displayLabelForAddMigrationDescription=Etiqueta de la pantalla de 'Agregar' se ha convertido en una expresi\u00f3n.
displayLabelForRemoveMigrationDescription=Etiqueta de la pantalla de 'Agregar' se ha convertido en una expresi\u00f3n.
tooltipForAddMigrationDescription=Tooltip etiqueta 'A\u00f1adir' se ha convertido en una expresi\u00f3n.
tooltipForRemoveMigrationDescription=Tooltip etiqueta 'A\u00f1adir' se ha convertido en una expresi\u00f3n.
imgPathMigrationDescription=Ruta de la imagen se ha convertido a una expresi\u00f3n.
validatorDisplayNameMigrationDescription=Mensaje de error Valiator se ha convertido a una expresi\u00f3n.
changeGatewayTypeToInclusiveGatewayMigrationDescription=La compuerta Paralela ha sido sustituida por una compuerta inclusiva para adaptarse a reglas  BPMN2.
changeInclusiveGatewayMigrationDescription=Modificado compuerta inclusiva.
changeParallelGatewayWithIncomingConditionsMigrationDescription=Compuerta paralela con las condiciones en los flujos entrantes modificadas.
changeParallelGatewayWithOutgoingConditionsMigrationDescription=Compuerta paralela con las condiciones en los flujos salientes modificadas.
mandatoryLabelMigrationDescription=S\u00edmbolo obligatorio se ha convertido en una expresi\u00f3n.
mandatorySymbolMigrationDescription=S\u00edmbolo obligatorio se ha convertido en una expresi\u00f3n.
verticalHeaderMigrationDescription=Script de titulo vertical se ha convertido en una expresi\u00f3n.
horizontalHeaderMigrationDescription=Script encabezado horizontal se ha convertido en una expresi\u00f3n.
cellExpressionMigrationDescription=Contenido de la tabla se ha convertido en una expresi\u00f3n.
kpiBinding=Enlace de KPI
bamProperty=BAM
removeKpiMigrationDescription=Migraci\u00f3n vinculante Kpi no es compatible y se ha suprimido.
maxRowForPaginationMigrationDescription=Maxima fila para la paginaci\u00f3n se ha convertido a una expresi\u00f3n.
columnForInitialIndexMigrationDescription=La columna para el \u00edndice inicial se ha convertido a una expresi\u00f3n.
selectedValuesMigrationDescription=Valores seleccionados se ha convertido en una expresi\u00f3n.
minNumberOfColumnMigrationDescription=N\u00famero m\u00ednimo de la columna se ha convertido a una expresi\u00f3n.
maxNumberOfColumnMigrationDescription=N\u00famero m\u00ednimo de la columna se ha convertido a una expresi\u00f3n.
maxNumberOfRowMigrationDescription=N\u00famero m\u00e1ximo de fila se ha convertido en una expresi\u00f3n.
minNumberOfRowMigrationDescription=N\u00famero m\u00ednimo de filas se ha convertido en una expresi\u00f3n.
simDataExpressionMigrationDescription=Expresi\u00f3n de datos de simulaci\u00f3n se ha convertido en una expresi\u00f3n.
simDataChangeValueMigrationDescription=Simulaci\u00f3n de datos expresi\u00f3n de actualizaci\u00f3n se ha convertido a una expresi\u00f3n.
migrationReportOf=Importar reporte para {0}
removeMultiInstantiationMigrationDescription=Eliminar la multi instanciaci\u00f3n
deadlinesToNonInterruptingEventMigrationDescription=Este plazo ha sido sustituido por otro tipo de elemento. Este concepto est\u00e1 vinculado con un evento temporizador de borde sin interrupci\u00f3n. El conector vinculado al deadline ha sido eliminado.
removeMessageEventFromSendTaskDescription=evento de mensaje {0} ha eliminado de esta tarea de enviar a ser obediente con BPMN. S\u00f3lo un mensaje evento es apoyado por la tarea de enviar.
attachementDataRemovedFromMessage=Accesorio datos {0} haber extraido el contenido de este mensaje.
invalidArchiveStructure=El archivo BAR {0} no tiene la estructura correcta. Falta el archivo .proc. Tal vez has intentado importar un fichero 6.x.bar aunque s\u00f3lo las versiones 5.9 + son compatibles.
startTimerCycleMigration=El formato de condici\u00f3n de temporizador c\u00edclico ha sido migrado a una expresi\u00f3n cron. El formato de condici\u00f3n c\u00edclica desde una fecha dada ya no es soportado.
timerCondition=Condici\u00f3n de temporizador
connectorMigrationDescription=El conector ha sido migrado. Por favor, compruebe la consistencia de los par\u00e1metros de entrada y salida.
development=Desarrollo
customConnectorMigrationDescription=Este conector personalizado ha ido migrado a una definici\u00f3n de conector, y a una Implementaci\u00f3n de conector. La Implementaci\u00f3n de conector tiene que ser revisada para validar que funciona como se espera.
customConnector=Conector personalizado
connectorMigrationSetVarConnectorOnEnterOrOnStartDescription=El conector "set variable"  "{0}", ha sido convertido a una(s) operaci\u00f3n(es) de tarea.\nPresta atenci\u00f3n, a pesar de que el conector haya sido configurado en "on Enter" u "on Start", las operaciones se ejecutar\u00e1n al final de la tarea. Observe que para las tareas humanas se ejecutar\u00e1n despu\u00e9s de env\u00edo del formulario. Si esto no corresponde con el comportamiento deseado, mueve las operaciones a una tarea anterior.
connectorMigrationSetVarConnectorOnFinishDescription=El conector 'set variable' {0} ha sido transformado en operaciones de tarea.
connectorMigrationFinishTaskDescription=En v6, el ciclo de vida de las actividades ha cambiado y la acci\u00f3n a la finalizaci\u00f3n de tarea no est\u00e1 disponible.
connectorMigrationStartInstanceDescription=Utilice un mensaje o una se\u00f1al para iniciar una instancia del proceso.
connectorMigrationUseScriptAndApiDescription=Tienes que utilizar un script Groovy. Puede utilizar directamente el API o reutilice los metodos proporcionados en la categor\u00eda de Bonita.
customConnectorMigrationFailureDescription=El conector propio no ha sido migrado. Faltan varias dependencias en el fichero bar original\: {0}
unsupportedVersionMessage=La versi\u00f3n origen de su proceso es {0}. La migraci\u00f3n es compatible con las versiones {1}.
descripitonProperty=Descripci\u00f3n
tooLongDescriptionHasBeenTruncated=Una descripci\u00f3n de este elemento se ha truncado porque exced\u00eda el nuevo m\u00e1ximo de caracteres permitidos
warningImageFormat=Formato de imagen no v\u00e1lido
warningImageFormatMessage={0} no puede ser importado debido a que no tiene el formato correcto..Utilice uno de los siguientes formatos soportados\: .gif;.jpg;.jpeg;.png;*.bmp.
migratingCustomConnector=Migrando conector personalizado {0}...
groovyForNameWarningDescription=Se ha detectado una reflexi\u00f3n en el script Groovy. La gesti\u00f3n de classpath ha cambiado y debe considerar cambiar el script o agregar las librerias en el classpath compartido
groovyForNameWarningPropertyName=Contenido del script
widgetDataInputTooManyConnectorMigrationDescription=M\u00e1s de un conector se utiliz\u00f3 como entrada del widget. S\u00f3lo el primero de ellos se ha migrado.
widgetContigencyConnectorMigrationDescription=M\u00e1s de un conector se utiliz\u00f3 en contingencias. S\u00f3lo el primero de ellos se ha migrado.
